---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\encuesta\/desc_wav
> e8.log
  log type:  text
 opened on:   8 Aug 2021, 22:45:28

. 
. use "$datos/91224059_w01_w08_appended_merge_w1_w8_v1_06042021_ETIQUETA SEND_weights.dta", clear

. 
. keep if wave == 8
(10,508 observations deleted)

. 
. save "$datos/w08_resultados.dta", replace
file datos/encuesta//w08_resultados.dta saved

. export excel using "$datos/wave8.xlsx", replace
file datos/encuesta//wave8.xlsx saved

. 
. // etiquetas 
. label define numcaj 1 "14 cigarros" 2 "20 cigarros" 3 "25 cigarros" ///
>         4 "Otro" 5 "No sé"

. label values q029a numcaj 

. 
. // consumo en el 'ultimo mes
. ta has_fumado_1mes

has_fumado_ |
       1mes |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |         85        5.67        5.67
         Si |      1,415       94.33      100.00
------------+-----------------------------------
      Total |      1,500      100.00

. ta has_fumado_1mes, nol

has_fumado_ |
       1mes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         85        5.67        5.67
          1 |      1,415       94.33      100.00
------------+-----------------------------------
      Total |      1,500      100.00

. 
. // 30-junio: se decidio omitir a los individuos que consumieron en 
. // los levantamientos anteriores
. // consumo: selección para el análisis
. // ta has_fumado_1mes 
. // ta has_fumado_1mes patron, m
. keep if has_fumado_1mes 
(85 observations deleted)

. 
. // sexo
. ta sexo if has_fumado_1mes

       sexo |      Freq.     Percent        Cum.
------------+-----------------------------------
  Masculino |        666       47.07       47.07
   Femenino |        749       52.93      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. ta identidad_genero if has_fumado_1mes

                 RECODE of q191 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                   Heterosexual |      1,281       90.53       90.53
                   Gay/lesbiana |         37        2.61       93.14
                       Bisexual |         62        4.38       97.53
               Otro/especificar |          4        0.28       97.81
          Prefiero no contestar |         31        2.19      100.00
--------------------------------+-----------------------------------
                          Total |      1,415      100.00

. 
. // edad 
. ta q001 if has_fumado_1mes

       q001 |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |          4        0.28        0.28
         19 |         15        1.06        1.34
         20 |         14        0.99        2.33
         21 |         29        2.05        4.38
         22 |         32        2.26        6.64
         23 |         34        2.40        9.05
         24 |         36        2.54       11.59
         25 |         37        2.61       14.20
         26 |         41        2.90       17.10
         27 |         39        2.76       19.86
         28 |         45        3.18       23.04
         29 |         41        2.90       25.94
         30 |         49        3.46       29.40
         31 |         29        2.05       31.45
         32 |         28        1.98       33.43
         33 |         38        2.69       36.11
         34 |         47        3.32       39.43
         35 |         50        3.53       42.97
         36 |         45        3.18       46.15
         37 |         31        2.19       48.34
         38 |         43        3.04       51.38
         39 |         35        2.47       53.85
         40 |         38        2.69       56.54
         41 |         35        2.47       59.01
         42 |         26        1.84       60.85
         43 |         26        1.84       62.69
         44 |         25        1.77       64.45
         45 |         22        1.55       66.01
         46 |         24        1.70       67.70
         47 |         34        2.40       70.11
         48 |         24        1.70       71.80
         49 |         23        1.63       73.43
         50 |         50        3.53       76.96
         51 |         33        2.33       79.29
         52 |         45        3.18       82.47
         53 |         26        1.84       84.31
         54 |         30        2.12       86.43
         55 |         36        2.54       88.98
         56 |         20        1.41       90.39
         57 |         26        1.84       92.23
         58 |         21        1.48       93.71
         59 |         19        1.34       95.05
         60 |         14        0.99       96.04
         61 |         12        0.85       96.89
         62 |         12        0.85       97.74
         63 |          8        0.57       98.30
         64 |         10        0.71       99.01
         65 |          1        0.07       99.08
         66 |          2        0.14       99.22
         67 |          3        0.21       99.43
         68 |          2        0.14       99.58
         69 |          3        0.21       99.79
         70 |          1        0.07       99.86
         72 |          1        0.07       99.93
         75 |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. tab1 edad* if has_fumado_1mes

-> tabulation of edad_cat4 if has_fumado_1mes 

  edad_cat4 |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-29 |        367       25.94       25.94
      30-39 |        395       27.92       53.85
      40-49 |        277       19.58       73.43
   50 y mas |        376       26.57      100.00
------------+-----------------------------------
      Total |      1,415      100.00

-> tabulation of edad_cat3 if has_fumado_1mes 

  edad_cat3 |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-29 |        367       25.94       25.94
      30-39 |        395       27.92       53.85
40 and more |        653       46.15      100.00
------------+-----------------------------------
      Total |      1,415      100.00

-> tabulation of edad_cat2 if has_fumado_1mes 

  edad_cat2 |      Freq.     Percent        Cum.
------------+-----------------------------------
 < 30 years |        367       25.94       25.94
>= 30 years |      1,048       74.06      100.00
------------+-----------------------------------
      Total |      1,415      100.00

-> tabulation of edad_min_vap if has_fumado_1mes 
no observations

. 
. // escolaridad
. tab1 escolaridad educ_3catr educ_9cat if has_fumado_1mes

-> tabulation of escolaridad if has_fumado_1mes 

                     escolaridad |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
No asistio o primaria incompleta |          1        0.07        0.07
               Primaria completa |          9        0.64        0.71
             Secundaria completa |        112        7.92        8.62
Escuela téc o comercial completa |        180       12.72       21.34
           Preparatoria completa |        376       26.57       47.92
           Carrera universitaria |        258       18.23       66.15
                    Licenciatura |        424       29.96       96.11
                       Postgrado |         48        3.39       99.51
                            Otro |          7        0.49      100.00
---------------------------------+-----------------------------------
                           Total |      1,415      100.00

-> tabulation of educ_3catr if has_fumado_1mes 

         educ_3catr |      Freq.     Percent        Cum.
--------------------+-----------------------------------
High school or less |        684       48.34       48.34
       Some college |        259       18.30       66.64
 College and higher |        472       33.36      100.00
--------------------+-----------------------------------
              Total |      1,415      100.00

-> tabulation of educ_9cat if has_fumado_1mes 

          RECODE of q003 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
No asistí/primaria incom |          1        0.07        0.07
       Primaria completa |          9        0.64        0.71
     Secundaria completa |        115        8.13        8.83
       Tecnica/Comercial |        183       12.93       21.77
      Preparatoria compl |        376       26.57       48.34
            Licen incomp |        259       18.30       66.64
           Licenc comple |        424       29.96       96.61
               Postgrado |         48        3.39      100.00
-------------------------+-----------------------------------
                   Total |      1,415      100.00

. 
. // ingresos
. ta ingreso_hogar if has_fumado_1mes

      RECODE of q192 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      De 0 a $1,500  |         28        1.98        1.98
  De $1,501 a $3,000 |         48        3.39        5.37
 De $3,001 a $5,000  |        104        7.35       12.72
 De $5,001 a $8,000  |        188       13.29       26.01
De $8,001 a $10,000  |        167       11.80       37.81
De $10,001 a $15,000 |        264       18.66       56.47
De $15,001 a $20,000 |        225       15.90       72.37
De $20,001 a $49,999 |        261       18.45       90.81
       $50,000 o más |         58        4.10       94.91
               No se |         72        5.09      100.00
---------------------+-----------------------------------
               Total |      1,415      100.00

. 
. // lugar
. ta estados if has_fumado_1mes

  estado_donde_vive |      Freq.     Percent        Cum.
--------------------+-----------------------------------
     Aguascalientes |         15        1.06        1.06
    Baja California |         23        1.63        2.69
Baja California Sur |          6        0.42        3.11
           Campeche |         12        0.85        3.96
            Chiapas |         21        1.48        5.44
          Chihuahua |         26        1.84        7.28
           Coahuila |         17        1.20        8.48
             Colima |          6        0.42        8.90
   Ciudad de México |        437       30.88       39.79
            Durango |         12        0.85       40.64
         Guanajuato |         40        2.83       43.46
           Guerrero |         18        1.27       44.73
            Hidalgo |         23        1.63       46.36
            Jalisco |        104        7.35       53.71
          Michoacán |         16        1.13       54.84
            Morelos |         24        1.70       56.54
             México |        235       16.61       73.14
            Nayarit |          5        0.35       73.50
         Nuevo León |         87        6.15       79.65
             Oaxaca |         14        0.99       80.64
             Puebla |         58        4.10       84.73
          Querétaro |         31        2.19       86.93
       Quintana Roo |         19        1.34       88.27
    San Luis Potosí |         16        1.13       89.40
            Sinaloa |         22        1.55       90.95
             Sonora |         16        1.13       92.08
            Tabasco |         18        1.27       93.36
         Tamaulipas |         10        0.71       94.06
           Tlaxcala |          6        0.42       94.49
           Veracruz |         46        3.25       97.74
            Yucatán |         24        1.70       99.43
          Zacatecas |          8        0.57      100.00
--------------------+-----------------------------------
              Total |      1,415      100.00

. 
. // cada cuándo compra?
. ta patron if has_fumado_1mes, m

  RECODE of |
smoking_pat |
       tern |      Freq.     Percent        Cum.
------------+-----------------------------------
   nondaily |        723       51.10       51.10
      daily |        663       46.86       97.95
          . |         29        2.05      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. ta patron if has_fumado_1mes, m nol

  RECODE of |
smoking_pat |
       tern |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        723       51.10       51.10
          1 |        663       46.86       97.95
          . |         29        2.05      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. 
. // consumo
. ta patron if has_fumado_1mes, su(q012) 

  RECODE of |
smoking_pat |           Summary of q012
       tern |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   nondaily |   10.762102   11.569199         723
      daily |   46.983409   28.567745         663
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

. 
. // precio
. 
. /* ¿Cómo compra?
> 1- cajetilla
> 2- suelto
> */
. // precio de cigarros sueltos
. su q030 if has_fumado_1mes

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        q030 |        229    6.558952    2.933439          2         20

. // patron
. ta q028 patron if has_fumado_1mes, su(q030)

            Means, Standard Deviations and Frequencies of q030

           |      RECODE of
           |   smoking_pattern
      q028 |  nondaily      daily |     Total
-----------+----------------------+----------
         2 | 6.5608466       6.55 |  6.558952
           | 2.9804775  2.7358025 | 2.9334386
           |       189         40 |       229
-----------+----------------------+----------
     Total | 6.5608466       6.55 |  6.558952
           | 2.9804775  2.7358025 | 2.9334386
           |       189         40 |       229

. 
. // pagado por cajetillas
. ta q028 if has_fumado_1mes , m

       q028 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,157       81.77       81.77
          2 |        229       16.18       97.95
          . |         29        2.05      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. ta q028 patron if has_fumado_1mes , m

           |    RECODE of smoking_pattern
      q028 |  nondaily      daily          . |     Total
-----------+---------------------------------+----------
         1 |       534        623          0 |     1,157 
         2 |       189         40          0 |       229 
         . |         0          0         29 |        29 
-----------+---------------------------------+----------
     Total |       723        663         29 |     1,415 


. ta q028 if has_fumado_1mes & patron , m

       q028 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        623       90.03       90.03
          2 |         40        5.78       95.81
          . |         29        4.19      100.00
------------+-----------------------------------
      Total |        692      100.00

. 
. // para los comprados en cajetilla
. ta q029a if has_fumado_1mes, m

      q029a |      Freq.     Percent        Cum.
------------+-----------------------------------
14 cigarros |        160       11.31       11.31
20 cigarros |        861       60.85       72.16
25 cigarros |        110        7.77       79.93
       Otro |         13        0.92       80.85
      No sé |         13        0.92       81.77
          . |        258       18.23      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. ta q029a if has_fumado_1mes, su(q029)

            |           Summary of q029
      q029a |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  14 cigarr |    55.49375   20.756145         160
  20 cigarr |   60.590012     12.3262         861
  25 cigarr |   61.536364   11.976029         110
       Otro |   70.230769   58.279719          13
      No sé |   64.076923   18.117494          13
------------+------------------------------------
      Total |   60.122731   15.136706       1,157

. 
. // definici'on de precio por cigarro para compra por cajetilla
. // 
. gen n_cig_caj = .
(1,415 missing values generated)

. replace n_cig_caj  = 14 if q029a == 1 & q028 == 1
(160 real changes made)

. replace n_cig_caj  = 20 if q029a == 2 & q028 == 1
(861 real changes made)

. replace n_cig_caj  = 25 if q029a == 3 & q028 == 1
(110 real changes made)

. 
. // precio por cigarro
. gen ppc_caj = q029/n_cig_caj
(284 missing values generated)

. 
. // 
. su q030 ppc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        q030 |        229    6.558952    2.933439          2         20
     ppc_caj |      1,131    3.106432    .8772658         .5   14.28571

. 
. // 
. hist q030 
(bin=15, start=2, width=1.2)

. hist ppc
(bin=30, start=.5, width=.4595238)

. 
. // Cross-tabs> consumo
. // sexo
. ta sexo, sum(q012) 

            |           Summary of q012
       sexo |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Masculino |   31.355283   29.751568         653
   Femenino |   25.178718   26.144815         733
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

. 
. // edad 
. ta q001, sum(q012) 

            |           Summary of q012
       q001 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         18 |        4.75   1.8929694           4
         19 |   5.7142857   3.1726856          14
         20 |   7.7142857   8.4346225          14
         21 |   14.111111    18.06044          27
         22 |    16.65625   24.033054          32
         23 |   12.393939   11.813497          33
         24 |   22.138889   24.592859          36
         25 |   18.194444   19.882253          36
         26 |    24.74359    27.51432          39
         27 |   21.641026   25.540976          39
         28 |   23.386364   22.608103          44
         29 |      23.875   26.410165          40
         30 |   20.673913   19.113758          46
         31 |   17.730769   13.906999          26
         32 |   21.928571   23.555967          28
         33 |   21.485714   21.572547          35
         34 |   23.173913   23.689008          46
         35 |       33.38   30.170867          50
         36 |        29.4   24.749105          45
         37 |   27.741935   29.569092          31
         38 |   25.785714   22.156358          42
         39 |   33.117647   29.962365          34
         40 |   25.972973   26.664048          37
         41 |   29.028571   23.682316          35
         42 |   28.269231   24.792834          26
         43 |   27.153846    26.89192          26
         44 |        29.2   27.924004          25
         45 |   23.727273   25.573762          22
         46 |      34.375   29.834052          24
         47 |   27.235294   29.883672          34
         48 |   30.913043   33.954399          23
         49 |   39.772727   37.388478          22
         50 |       28.72   27.105267          50
         51 |   36.969697    33.55265          33
         52 |   33.659091   33.623042          44
         53 |   40.884615   28.198336          26
         54 |   39.233333   37.255579          30
         55 |   44.138889   34.007691          36
         56 |   35.631579   32.211472          19
         57 |       54.56   33.729413          25
         58 |   29.894737    25.62528          19
         59 |   38.526316   31.623424          19
         60 |   41.571429    33.11452          14
         61 |   34.583333   24.817363          12
         62 |   45.916667    32.57846          12
         63 |        39.5   27.349589           8
         64 |          44   39.743623          10
         65 |          40           0           1
         66 |        52.5   67.175144           2
         67 |          51    43.27817           3
         68 |        12.5   16.263456           2
         69 |   48.666667   36.018514           3
         70 |          80           0           1
         72 |           4           0           1
         75 |          80           0           1
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

. // definir grupos de edad, 
. // acorde a la encuesta nacional
. tab1 edad*, sum(q012) 

-> tabulation of edad_cat4  

            |           Summary of q012
  edad_cat4 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
      18-29 |   18.924581   22.499235         358
      30-39 |   25.861619   24.779217         383
      40-49 |   29.222628   28.368159         274
   50 y mas |   38.393531   32.214423         371
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

-> tabulation of edad_cat3  

            |           Summary of q012
  edad_cat3 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
      18-29 |   18.924581   22.499235         358
      30-39 |   25.861619   24.779217         383
  40 and mo |   34.497674   30.950954         645
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

-> tabulation of edad_cat2  

            |           Summary of q012
  edad_cat2 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  < 30 year |   18.924581   22.499235         358
  >= 30 yea |   31.280156    29.09544       1,028
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

-> tabulation of edad_min_vap  
no observations

. 
. // escolaridad
. tab1 escolaridad educ_3catr educ_9cat, sum(q012) 

-> tabulation of escolaridad  

            |           Summary of q012
escolaridad |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  No asisti |         100           0           1
  Primaria  |   38.555556   38.916934           9
  Secundari |   35.432432   32.449015         111
  Escuela t |   30.767045   29.637568         176
  Preparato |   25.204918   25.929072         366
  Carrera u |   25.802372   29.045812         253
  Licenciat |   27.673077   26.053954         416
  Postgrado |   34.808511   31.127814          47
       Otro |   33.571429   27.530935           7
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

-> tabulation of educ_3catr  

            |           Summary of q012
 educ_3catr |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  High scho |    28.67713   28.596728         669
  Some coll |   25.976378   29.120701         254
  College a |   28.397408   26.662346         463
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

-> tabulation of educ_9cat  

  RECODE of |           Summary of q012
       q003 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  No asistí |         100           0           1
  Primaria  |   38.555556   38.916934           9
  Secundari |   34.947368   32.261334         114
  Tecnica/C |   30.888268   29.548643         179
  Preparato |   25.204918   25.929072         366
  Licen inc |   25.976378   29.120701         254
  Licenc co |   27.673077   26.053954         416
  Postgrado |   34.808511   31.127814          47
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

. 
. // ingresos
. ta ingreso_hogar, sum(q012) 

  RECODE of |           Summary of q012
       q192 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  De 0 a $1 |   21.185185   27.927154          27
  De $1,501 |     18.4375   20.855028          48
  De $3,001 |   21.287129   25.410367         101
  De $5,001 |   25.616216   27.654286         185
  De $8,001 |   26.163636   28.122184         165
  De $10,00 |    27.29572   26.823317         257
  De $15,00 |   30.182648   28.889912         219
  De $20,00 |   33.890625   28.515214         256
  $50,000 o |   42.362069   32.830612          58
      No se |   21.571429   25.059102          70
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

. 
. // lugar
. ta estados, sum(q012) 

estado_dond |           Summary of q012
     e_vive |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Aguascali |        46.2   35.996428          15
  Baja Cali |   27.565217   33.655779          23
  Baja Cali |          22   38.444766           6
   Campeche |   20.166667   26.754212          12
    Chiapas |   19.105263   25.198974          19
  Chihuahua |   32.166667   32.191906          24
   Coahuila |   25.117647   26.018941          17
     Colima |   18.666667   15.845083           6
  Ciudad de |   29.484919   28.698094         431
    Durango |          30   23.920322          12
  Guanajuat |      30.625   30.240648          40
   Guerrero |   14.888889   13.230486          18
    Hidalgo |   13.238095   17.360601          21
    Jalisco |   34.217822   29.338577         101
  Michoacán |     19.6875    25.99415          16
    Morelos |   22.958333   27.367831          24
     México |   23.174672   25.252498         229
    Nayarit |        28.8    11.54123           5
  Nuevo Leó |   33.465116   26.806363          86
     Oaxaca |   37.857143   35.134592          14
     Puebla |      28.125   28.628062          56
  Querétaro |   24.172414   20.587911          29
  Quintana  |          28   26.959665          18
  San Luis  |          23   29.157209          15
    Sinaloa |   38.272727   31.148159          22
     Sonora |     37.3125   31.750525          16
    Tabasco |   24.352941   28.668234          17
  Tamaulipa |        22.8   28.118005          10
   Tlaxcala |   37.166667   38.747473           6
   Veracruz |   27.086957    28.24325          46
    Yucatán |      28.625   27.552026          24
  Zacatecas |       21.75   32.433448           8
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

. // definir grupos de entidades 
. // comparable a ? encuesta nacional?
. 
. // cada cuándo compra?
. ta patron, sum(q012)

  RECODE of |
smoking_pat |           Summary of q012
       tern |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   nondaily |   10.762102   11.569199         723
      daily |   46.983409   28.567745         663
------------+------------------------------------
      Total |   28.088745   28.062026       1,386

. 
. ////////////////////////////////////
> // Cross-tabs> precio por cigarro
. // sexo
. ta sexo, sum(q030) 

            |           Summary of q030
       sexo |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Masculino |   6.3529412   2.8689881          85
   Femenino |   6.6805556   2.9740199         144
------------+------------------------------------
      Total |    6.558952   2.9334386         229

. ta sexo, sum(ppc) 

            |         Summary of ppc_caj
       sexo |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Masculino |    3.017532   .66460622         558
   Femenino |   3.1930042   1.0368309         573
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

. 
. // edad 
. ta q001, sum(q030) 

            |           Summary of q030
       q001 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         18 |           5           0           1
         19 |   7.4285714    2.572751           7
         20 |   6.8333333    2.786874           6
         21 |        5.75   .88640526           8
         22 |   7.0909091   4.3693145          11
         23 |        6.25   .88640526           8
         24 |   8.1666667    5.231316           6
         25 |   6.2857143   .75592895           7
         26 |   6.2727273   2.0045403          11
         27 |   6.6428571   3.8949107          14
         28 |         8.8   6.3007936           5
         29 |           6   1.1547005          10
         30 |           6   1.9493589          11
         31 |         6.6   1.3416408           5
         32 |       7.375   4.3073857           8
         33 |        8.75   5.5741751           8
         34 |   6.6666667   2.0597146          12
         35 |         5.5   .83666003           6
         36 |         5.5   .57735027           4
         37 |   5.3333333   .57735027           3
         38 |   6.2222222   1.6414763           9
         39 |         8.5    6.350853           4
         40 |   6.4285714   .78679579           7
         41 |         5.5   .70710678           2
         42 |   5.6666667   .57735027           3
         43 |           6           0           2
         44 |   8.3333333   5.7735027           3
         45 |           5           0           3
         47 |   7.3333333   2.3094011           3
         48 |          13   9.8994949           2
         49 |        5.75   .95742711           4
         50 |       5.375   1.0264363           8
         51 |         5.5   .70710678           2
         52 |   6.8333333   2.5625508           6
         53 |         5.5   .57735027           4
         54 |         5.8   1.3038405           5
         55 |   4.3333333   1.1547005           3
         56 |           5           0           2
         58 |         5.5   .70710678           2
         59 |          10           0           1
         60 |         5.5   .70710678           2
         67 |           5           0           1
------------+------------------------------------
      Total |    6.558952   2.9334386         229

. ta q001, sum(ppc) 

            |         Summary of ppc_caj
       q001 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         18 |   3.1904762   .32991442           3
         19 |   2.9316327   .53794548           7
         20 |         3.1   .71564157           8
         21 |   3.8597744   1.6750608          19
         22 |   3.0248572   .65118652          20
         23 |   3.1925325   .69454867          22
         24 |   3.4131746   .95950443          27
         25 |   3.2512245   .74348291          28
         26 |   3.0852041   .44385417          28
         27 |   3.3701786   .84052329          24
         28 |   3.2512088    .5505305          39
         29 |   3.1146305   .60832451          29
         30 |   3.2588572   .86935553          35
         31 |   2.9519728    .6598617          21
         32 |   2.9994737   .54486852          19
         33 |   3.1140741   .60689052          27
         34 |   3.1887013   .75676021          33
         35 |   3.4033117   1.2495263          44
         36 |   2.9624042   .45404279          41
         37 |   3.0149735   .59492189          27
         38 |   3.0542424   .77633463          33
         39 |   3.1333005   .69013627          29
         40 |   2.9702463   .67641249          29
         41 |    3.140303   .94961006          33
         42 |   3.1725466   .77195977          23
         43 |   3.1248447   .56878801          23
         44 |   3.1785715   .68545916          22
         45 |   3.6609022   2.6542252          19
         46 |   3.0175595    .8123874          24
         47 |   3.0338249    .5330229          31
         48 |   2.8779286   .85081354          20
         49 |   3.0653968   .73536585          18
         50 |   2.8358504   .60077615          42
         51 |   2.8711521   .87194575          31
         52 |   2.8725483   .74328211          37
         53 |   2.9845578   .63360188          21
         54 |    3.071369   .53345496          24
         55 |   3.0149553   .46930285          32
         56 |      2.8375   .51478481          16
         57 |   2.9328571   .51140318          23
         58 |   3.2303571    .3655161          16
         59 |   2.9829412   .55908145          17
         60 |   3.1970238    .5898292          12
         61 |   2.9371428   .93286697          12
         62 |   2.8116667   .54912878          12
         63 |   2.9641071   .83225796           8
         64 |        2.64   .79441105          10
         65 |        2.75           0           1
         66 |        2.25   .77781739           2
         67 |   2.9000001   .35355339           2
         68 |   7.8214284   8.1317278           2
         69 |   2.7166667   .71821539           3
         70 |         3.3           0           1
         72 |         3.5           0           1
         75 |         3.3           0           1
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

. // definir grupos de edad, 
. // acorde a la encuesta nacional
. tab1 edad*, sum(q030) 

-> tabulation of edad_cat4  

            |           Summary of q030
  edad_cat4 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
      18-29 |    6.712766   3.0922113          94
      30-39 |         6.7   3.1037612          70
      40-49 |   6.7586207    3.225514          29
   50 y mas |   5.7222222   1.5740959          36
------------+------------------------------------
      Total |    6.558952   2.9334386         229

-> tabulation of edad_cat3  

            |           Summary of q030
  edad_cat3 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
      18-29 |    6.712766   3.0922113          94
      30-39 |         6.7   3.1037612          70
  40 and mo |   6.1846154   2.4852207          65
------------+------------------------------------
      Total |    6.558952   2.9334386         229

-> tabulation of edad_cat2  

            |           Summary of q030
  edad_cat2 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  < 30 year |    6.712766   3.0922113          94
  >= 30 yea |   6.4518519   2.8243835         135
------------+------------------------------------
      Total |    6.558952   2.9334386         229

-> tabulation of edad_min_vap  
no observations

. tab1 edad*, sum(ppc) 

-> tabulation of edad_cat4  

            |         Summary of ppc_caj
  edad_cat4 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
      18-29 |   3.2541057   .81474587         254
      30-39 |    3.128197   .78858234         309
      40-49 |    3.112804   1.0251555         242
   50 y mas |   2.9660123    .8678254         326
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

-> tabulation of edad_cat3  

            |         Summary of ppc_caj
  edad_cat3 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
      18-29 |   3.2541057   .81474587         254
      30-39 |    3.128197   .78858234         309
  40 and mo |   3.0285538   .94003134         568
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

-> tabulation of edad_cat2  

            |         Summary of ppc_caj
  edad_cat2 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  < 30 year |   3.2541057   .81474587         254
  >= 30 yea |   3.0636618   .89043315         877
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

-> tabulation of edad_min_vap  
no observations

. 
. // escolaridad
. tab1 escolaridad educ_3catr educ_9cat, sum(q030) 

-> tabulation of escolaridad  

            |           Summary of q030
escolaridad |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Primaria  |           6           0           1
  Secundari |   7.0322581   4.1591976          31
  Escuela t |   6.2580645   2.5293971          31
  Preparato |       6.225   2.2932206          80
  Carrera u |   6.1666667   2.2628671          48
  Licenciat |         7.4   3.2557641          35
  Postgrado |        12.5   10.606602           2
       Otro |           6           0           1
------------+------------------------------------
      Total |    6.558952   2.9334386         229

-> tabulation of educ_3catr  

            |           Summary of q030
 educ_3catr |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  High scho |   6.4027778   2.8261255         144
  Some coll |   6.1666667   2.2628671          48
  College a |   7.6756757   3.8082808          37
------------+------------------------------------
      Total |    6.558952   2.9334386         229

-> tabulation of educ_9cat  

  RECODE of |           Summary of q030
       q003 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Primaria  |           6           0           1
  Secundari |           7    4.095631          32
  Tecnica/C |   6.2580645   2.5293971          31
  Preparato |       6.225   2.2932206          80
  Licen inc |   6.1666667   2.2628671          48
  Licenc co |         7.4   3.2557641          35
  Postgrado |        12.5   10.606602           2
------------+------------------------------------
      Total |    6.558952   2.9334386         229

. tab1 escolaridad educ_3catr educ_9cat, sum(ppc) 

-> tabulation of escolaridad  

            |         Summary of ppc_caj
escolaridad |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  No asisti |        3.75           0           1
  Primaria  |   2.5158929   .55806176           8
  Secundari |   2.8217033   .69391483          78
  Escuela t |   2.9255332   .64087398         142
  Preparato |   3.0240632   .68619123         276
  Carrera u |   3.0751948   .62915474         198
  Licenciat |   3.3288859   1.1498992         377
  Postgrado |   3.0749524   .84803902          45
       Otro |   2.8476191   .41220335           6
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

-> tabulation of educ_3catr  

            |         Summary of ppc_caj
 educ_3catr |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  High scho |   2.9571036   .67595389         510
  Some coll |   3.0748169   .62758659         199
  College a |   3.3018077   1.1235004         422
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

-> tabulation of educ_9cat  

  RECODE of |         Summary of ppc_caj
       q003 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  No asistí |        3.75           0           1
  Primaria  |   2.5158929   .55806176           8
  Secundari |   2.8299107   .68701371          80
  Tecnica/C |   2.9186995   .63838086         145
  Preparato |   3.0240632   .68619123         276
  Licen inc |   3.0748169   .62758659         199
  Licenc co |   3.3288859   1.1498992         377
  Postgrado |   3.0749524   .84803902          45
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

. 
. // ingresos
. ta ingreso_hogar, sum(q030) 

  RECODE of |           Summary of q030
       q192 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  De 0 a $1 |   5.6666667   .51639778           6
  De $1,501 |   7.1944444   4.7438471          18
  De $3,001 |   6.5147059   3.0113052          34
  De $5,001 |           6   2.2267315          49
  De $8,001 |   6.7647059   2.2570942          34
  De $10,00 |   7.3571429   4.0112276          28
  De $15,00 |        6.25   1.5782081          28
  De $20,00 |   7.6666667   4.4507891          15
  $50,000 o |   5.3333333    2.081666           3
      No se |   5.7857143   .57893422          14
------------+------------------------------------
      Total |    6.558952   2.9334386         229

. ta ingreso_hogar, sum(ppc) 

  RECODE of |         Summary of ppc_caj
       q192 |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  De 0 a $1 |   2.8209023   .71175714          19
  De $1,501 |   2.9086667   .61341947          30
  De $3,001 |   2.9360268   .72154571          64
  De $5,001 |   2.8964232   .75426469         133
  De $8,001 |   3.0136703   .85046355         130
  De $10,00 |   3.1163584   .74351043         224
  De $15,00 |   3.2121925   .70425543         187
  De $20,00 |   3.2392528   1.0097626         239
  $50,000 o |   3.3733242   1.7649741          52
      No se |   3.0051213   .42059588          53
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

. 
. // lugar
. ta estados, sum(q030) 

estado_dond |           Summary of q030
     e_vive |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Aguascali |   4.3333333   1.1547005           3
  Baja Cali |           7   4.3588989           3
  Baja Cali |           6           0           1
   Campeche |   7.3333333   2.3094011           3
    Chiapas |           8   5.8991525           6
  Chihuahua |           7   1.4142136           2
   Coahuila |   6.3333333   1.1547005           3
     Colima |           8           0           1
  Ciudad de |   6.2166667   1.7953959          60
    Durango |        5.75          .5           4
  Guanajuat |   7.4285714    4.237025           7
   Guerrero |         6.8   2.9495762           5
    Hidalgo |         7.5         2.5           7
    Jalisco |   7.8888889   6.4506675           9
  Michoacán |         4.8    .4472136           5
    Morelos |   10.333333   8.3864971           3
     México |   6.2016129   1.7021194          62
  Nuevo Leó |           6   .70710678           9
     Oaxaca |           7   2.6457513           3
     Puebla |   7.1818182   3.6281726          11
  San Luis  |        11.2    8.043631           5
    Tabasco |         5.5   .70710678           2
  Tamaulipa |           5           0           2
   Tlaxcala |           6           0           1
   Veracruz |         5.8   1.9321836          10
    Yucatán |           5           0           1
  Zacatecas |           6           0           1
------------+------------------------------------
      Total |    6.558952   2.9334386         229

. ta estados, sum(ppc) 

estado_dond |         Summary of ppc_caj
     e_vive |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Aguascali |   2.8516666   .75908837          12
  Baja Cali |   3.1515038   .94745326          19
  Baja Cali |        2.96   .57814357           5
   Campeche |   2.9926984   .75764654           9
    Chiapas |   3.0813187   .66942162          13
  Chihuahua |   2.8380952   .69747845          21
   Coahuila |   3.0066327   .31685344          14
     Colima |   2.8214286   .82113353           5
  Ciudad de |   3.0741283   .88687741         363
    Durango |   3.3133929   .54305096           8
  Guanajuat |   3.3449784   .90403428          33
   Guerrero |   3.3153846   .99025803          13
    Hidalgo |      2.9275   .43774473          12
    Jalisco |    3.121254    .7640008          90
  Michoacán |   3.8305195   3.5059586          11
    Morelos |   3.0409774    .5677303          19
     México |    3.119625   .75140434         160
    Nayarit |   3.4928572   1.3105635           5
  Nuevo Leó |   3.2784211   1.0902803          76
     Oaxaca |   3.3783117   1.1333501          11
     Puebla |   3.0551948   .55163896          44
  Querétaro |   2.9364039   .52608068          29
  Quintana  |   3.3829365   .87879905          18
  San Luis  |   2.9285715   .44967865          10
    Sinaloa |   2.9536735   .51779233          21
     Sonora |        3.04   .62731042          16
    Tabasco |   2.8912381    .5379084          15
  Tamaulipa |   3.4383928   .90195716           8
   Tlaxcala |        3.05   .19685021           5
   Veracruz |   3.1659524    .7022058          36
    Yucatán |   2.9065218   .78640442          23
  Zacatecas |   2.7887755   .93518578           7
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

. 
. // cada cuándo compra?
. ta patron, sum(q030)

  RECODE of |
smoking_pat |           Summary of q030
       tern |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   nondaily |   6.5608466   2.9804775         189
      daily |        6.55   2.7358025          40
------------+------------------------------------
      Total |    6.558952   2.9334386         229

. ta patron, sum(ppc)

  RECODE of |
smoking_pat |         Summary of ppc_caj
       tern |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   nondaily |   3.2139182   1.0162711         517
      daily |    3.015926   .72893114         614
------------+------------------------------------
      Total |   3.1064317   .87726581       1,131

. 
. log close
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\encuesta\/desc_wav
> e8.log
  log type:  text
 closed on:   8 Aug 2021, 22:45:51
---------------------------------------------------------------------------------------------------
