--------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\USUARIO\OneDrive\Documentos\R\tax_ene2020\tax_2020\r
> esultados/encuesta/para_precio_w6.log
  log type:  text
 opened on:  10 Sep 2021, 14:10:21

. 
. global datos = "datos/encuesta/"

. global codigo = "stata_code\encuesta_\"

. global resultados = "resultados\encuesta\"

. 
. use "$datos/91224059_w01_w08_appended_merge_w1_w8_v1_06042021_ETIQUETA S
> END_weights.dta", clear

. 
. keep if wave == 6
(10,507 observations deleted)

. 
. do "$codigo/etiquetas_marcas.do"

. /*
> etiquetas_marcas.do
> usado: recodificar.do
> Etiquetar e identificar las marcas más relevantes para el análisis
> 2.      Benson y Hedges o B&H
> 4.      Camel
> 5.      Chesterfield
> 7.      Delicados > 5
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 19.     Pall Mall
> 22.     Raleigh[021] > 15 
> * también está la marca q026, último consumo, pero se reporta menos
> */
. gen marca = .
(1,501 missing values generated)

. replace marca = 1 if q019 == 2
(177 real changes made)

. replace marca = 2 if q019 == 4
(77 real changes made)

. replace marca = 3 if q019 == 5
(23 real changes made)

. replace marca = 3 if q019 == 7 // Delicados por Chesterfield
(26 real changes made)

. replace marca = 4 if q019 == 15
(59 real changes made)

. replace marca = 4 if q019 == 22 // Raleigh a Lucky
(6 real changes made)

. replace marca = 5 if q019 == 16
(608 real changes made)

. replace marca = 6 if q019 == 17
(47 real changes made)

. replace marca = 7 if q019 == 19
(269 real changes made)

. recode marca . = 99
(209 changes made to marca)

. 
. #delimit ;
delimiter now ;
. label define marca 1 "Benson y Hedges" 
>                                 2 "Camel"
>                                 3 "Chesterfield"
>                                 4 "Lucky Strike"
>                                 5 "Marlboro"
>                                 6 "Montana"
>                                 7 "Pall Mall"
>                                 99 "Otras"
>                 ;

. #delimit cr
delimiter now cr
. 
. label values marca marca

. 
. // tipo_marca
. gen tipo = 1 if marca == 1 | marca == 2 | marca == 5
(639 missing values generated)

. replace tipo = 2 if marca == 4 | marca == 7
(334 real changes made)

. replace tipo = 3 if marca == 3 | marca == 6
(96 real changes made)

. 
. label define tipo 1 "premium" 2 "medio" 3 "bajo"

. label values tipo tipo

. 
. // Juntar Chesterfield y Delicados
. // Raleigh : Lucky
. // ajustar manual q019r30oe.xls
. // 
. // wave 8
. replace marca = 1 if q019r30oe =="Benson cristal"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pall mart"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallman"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shot"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. 
. replace marca = 5 if q019r30oe =="Malboro rubi"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro ice"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro Sandía"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(1 real change made)

. replace marca = 1 if q019r30oe =="Benson & Hedges Violeta"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson violeta"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 5 if q019r30oe =="ICE EXPRESS DE MARLBORO"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallmall"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="lucky strike"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(0 real changes made)

. replace marca = 3 if q019r30oe =="chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pollmol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pallmall"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shots"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall Mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MAL"
(0 real changes made)

. replace marca = 3 if q019r30oe =="delicados sin filtro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(0 real changes made)

. replace marca = 5 if q019r30oe =="malvoro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo Mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="raleigt"
(0 real changes made)

. replace marca = 1 if q019r30oe =="BENSON DORADOS LIGHT"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucky strike"
(1 real change made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson mentolado"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palmall doble clik"
(0 real changes made)

. replace marca = 7 if q019r30oe =="paull mool"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Marlboro rubi"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pollman"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 2 if q019r30oe =="Camel mentolados"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pallmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo mall"
(1 real change made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucy strigth"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mart"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Montana"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallman"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shot"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. // 
. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. /*
> [IF 018=1] ¿Qué marca es?
> [IF 018=2] ¿Qué marca estás fumando actualmente o fumaste más recienteme
> nte?
> 1.      Alas[023]
> 2.      Benson y Hedges o B&H
> 3.      Broadway[023]
> 4.      Camel
> 5.      Chesterfield
> 6.      Cohiba[021]
> 7.      Delicados
> 8.      Dunhill
> 9.      Faros
> 10.     Fiesta[021]
> 11.     Fortuna
> 12.     Garañon[021]
> 13.     Joe’s
> 14.     Kent
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 18.     Murattimar
> 19.     Pall Mall
> 20.     Popular 
> 21.     RGD
> 22.     Raleigh[021]
> 23.     Salem[021]
> 24.     Seneca
> 25.     Viceroy[021]
> 26.     West[021]
> 27.     Winston
> 28.     L & M Baronet 
> 29.     Link Ice Fusion 
> 30.     Otro [Especificar] ___________ [021]
> 99      No sé[021]
> */
. 
. 
end of do-file

. 
. keep id wave marca q019 q029 

. 
. //----------------
. 
. gen cantidad_cigarros = .
(1,501 missing values generated)

. 
. recode cantidad_cigarros . = 14 if marca == 1 & q029 <=51
(14 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 20 if marca == 1 & q029 >51
(165 changes made to cantidad_cigarros)

. 
. recode cantidad_cigarros . = 14 if marca == 2 & q029 <=53
(10 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 20 if marca == 2 & q029 >53
(68 changes made to cantidad_cigarros)

. 
. //recode cantidad_cigarros . = 15 if marca == 3 & q029 <=44.5
. // 14 desde 15: sustituye por la siguiente
. recode cantidad_cigarros . = 14 if marca == 3 & q029 <=44.5
(9 changes made to cantidad_cigarros)

. //recode cantidad_cigarros . = 18 if marca == 3 & q029 <=50.75
. // 18 queda en 20
. recode cantidad_cigarros . = 20 if marca == 3 & q029 <=47
(2 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 24 if marca == 3 & q029 <=55
(16 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 25 if marca == 3 & q029 >55
(22 changes made to cantidad_cigarros)

. 
. recode cantidad_cigarros . = 20 if marca == 4 & q029 <=63.5
(40 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 25 if marca == 4 & q029 >63.5
(26 changes made to cantidad_cigarros)

. 
. recode cantidad_cigarros . = 14 if marca == 5 & q029 <=54.25
(94 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 20 if marca == 5 & q029 >54.25
(514 changes made to cantidad_cigarros)

. 
. recode cantidad_cigarros . = 14 if marca == 6 & q029 <=37
(13 changes made to cantidad_cigarros)

. //recode cantidad_cigarros . = 15 if marca == 6 & q029 <=46
. //recode cantidad_cigarros . = 24 if marca == 6 & q029 <=54
. // 15 y 24 a 20:
. recode cantidad_cigarros . = 20 if marca == 6 & q029 <=54
(15 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 25 if marca == 6 & q029 >54
(19 changes made to cantidad_cigarros)

. 
. recode cantidad_cigarros . = 14 if marca == 7 & q029 <=47
(24 changes made to cantidad_cigarros)

. recode cantidad_cigarros . = 20 if marca == 7 & q029 <=55.95
(72 changes made to cantidad_cigarros)

. //recode cantidad_cigarros . = 24 if marca == 7 & q029 >55.95
. // 24 a 25
. recode cantidad_cigarros . = 25 if marca == 7 & q029 >55.95
(177 changes made to cantidad_cigarros)

.         
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        164       12.62       12.62
         20 |        876       67.38       80.00
         24 |         16        1.23       81.23
         25 |        244       18.77      100.00
------------+-----------------------------------
      Total |      1,300      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         24         25 |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        14        165          0          0 |       179 
          Camel |        10         68          0          0 |        78 
   Chesterfield |         9          2         16         22 |        49 
   Lucky Strike |         0         40          0         26 |        66 
       Marlboro |        94        514          0          0 |       608 
        Montana |        13         15          0         19 |        47 
      Pall Mall |        24         72          0        177 |       273 
          Otras |         0          0          0          0 |       201 
----------------+--------------------------------------------+----------
          Total |       164        876         16        244 |     1,501 


                | cantidad_c
                |  igarros
          marca |         . |     Total
----------------+-----------+----------
Benson y Hedges |         0 |       179 
          Camel |         0 |        78 
   Chesterfield |         0 |        49 
   Lucky Strike |         0 |        66 
       Marlboro |         0 |       608 
        Montana |         0 |        47 
      Pall Mall |         0 |       273 
          Otras |       201 |       201 
----------------+-----------+----------
          Total |       201 |     1,501 

. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 1
(2 real changes made)

. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 6
(1 real change made)

. 
. replace cantidad_cigarros = 20 if q019 == 8
(3 real changes made)

. replace cantidad_cigarros = 20 if q019 == 9
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 10
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 11
(0 real changes made)

. replace cantidad_cigarros = 20 if q019 == 12
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 13
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 14
(3 real changes made)

. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 18
(2 real changes made)

. 
. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 20
(0 real changes made)

. replace cantidad_cigarros = 20 if q019 == 21
(0 real changes made)

. 
. replace cantidad_cigarros = 20 if q019 == 23
(4 real changes made)

. replace cantidad_cigarros = 20 if q019 == 24
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 25
(5 real changes made)

. replace cantidad_cigarros = 20 if q019 == 26
(3 real changes made)

. replace cantidad_cigarros = 20 if q019 == 27
(19 real changes made)

. replace cantidad_cigarros = 20 if q019 == 28
(9 real changes made)

. replace cantidad_cigarros = 20 if q019 == 29
(2 real changes made)

. 
. // SE CAMBIA q019 por marca PARA MANTENER LA CONSISTENCIA SOBRE LAS MARC
> AS EN etiquetas_marcas.do
. recode cantidad_cigarros . = 20 if marca == 99
(141 changes made to cantidad_cigarros)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        164       10.93       10.93
         20 |      1,077       71.75       82.68
         24 |         16        1.07       83.74
         25 |        244       16.26      100.00
------------+-----------------------------------
      Total |      1,501      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         24         25 |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        14        165          0          0 |       179 
          Camel |        10         68          0          0 |        78 
   Chesterfield |         9          2         16         22 |        49 
   Lucky Strike |         0         40          0         26 |        66 
       Marlboro |        94        514          0          0 |       608 
        Montana |        13         15          0         19 |        47 
      Pall Mall |        24         72          0        177 |       273 
          Otras |         0        201          0          0 |       201 
----------------+--------------------------------------------+----------
          Total |       164      1,077         16        244 |     1,501 

. 
. save "$datos/cantidades_cigarros_w6.dta", replace
(file datos/encuesta//cantidades_cigarros_w6.dta not found)
file datos/encuesta//cantidades_cigarros_w6.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\USUARIO\OneDrive\Documentos\R\tax_ene2020\tax_2020\r
> esultados/encuesta/para_precio_w6.log
  log type:  text
 closed on:  10 Sep 2021, 14:10:21
--------------------------------------------------------------------------
