--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\encuesta\/para_precio_w8.log
  log type:  text
 opened on:  17 Sep 2021, 15:28:44

. 
. global datos = "datos/encuesta/"

. global codigo = "stata_code\encuesta_\"

. 
. *cd "C:\Users\danny\Desktop\Cohorte de fumadores\"
. 
. *use "91224059_w01_w08_appended_merge_w1_w8_v1_06042021_ETIQUETA SEND_weights.dta", clear
. use "$datos/91224059_w01_w08_appended_merge_w1_w8_v1_06042021_ETIQUETA SEND_weights.dta", clear

. 
. keep if wave == 8
(10,508 observations deleted)

. 
. do "$codigo/etiquetas_marcas.do"

. /*
> etiquetas_marcas.do
> usado: recodificar.do
> Etiquetar e identificar las marcas más relevantes para el análisis
> 2.      Benson y Hedges o B&H
> 4.      Camel
> 5.      Chesterfield
> 7.      Delicados > 5
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 19.     Pall Mall
> 22.     Raleigh[021] > 15 
> * también está la marca q026, último consumo, pero se reporta menos
> */
. gen marca = .
(1,500 missing values generated)

. replace marca = 1 if q019 == 2
(186 real changes made)

. replace marca = 2 if q019 == 4
(86 real changes made)

. replace marca = 3 if q019 == 5
(46 real changes made)

. replace marca = 3 if q019 == 7 // Delicados por Chesterfield
(26 real changes made)

. replace marca = 4 if q019 == 15
(42 real changes made)

. replace marca = 4 if q019 == 22 // Raleigh a Lucky
(2 real changes made)

. replace marca = 5 if q019 == 16
(602 real changes made)

. replace marca = 6 if q019 == 17
(65 real changes made)

. replace marca = 7 if q019 == 19
(290 real changes made)

. recode marca . = 99
(marca: 155 changes made)

. 
. #delimit ;
delimiter now ;
. label define marca 1 "Benson y Hedges" 
>                                 2 "Camel"
>                                 3 "Chesterfield"
>                                 4 "Lucky Strike"
>                                 5 "Marlboro"
>                                 6 "Montana"
>                                 7 "Pall Mall"
>                                 99 "Otras"
>                 ;

. #delimit cr
delimiter now cr
. 
. label values marca marca

. 
. // tipo_marca
. gen tipo = 1 if marca == 1 | marca == 2 | marca == 5
(626 missing values generated)

. replace tipo = 2 if marca == 4 | marca == 7
(334 real changes made)

. replace tipo = 3 if marca == 3 | marca == 6
(137 real changes made)

. 
. label define tipo 1 "premium" 2 "medio" 3 "bajo"

. label values tipo tipo

. 
. // Juntar Chesterfield y Delicados
. // Raleigh : Lucky
. // ajustar manual q019r30oe.xls
. // 
. // wave 8
. replace marca = 1 if q019r30oe =="Benson cristal"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pall mart"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pallman"
(1 real change made)

. replace marca = 5 if q019r30oe =="Marlboro"
(1 real change made)

. replace marca = 6 if q019r30oe =="Shot"
(1 real change made)

. replace marca = 5 if q019r30oe =="marlboro"
(1 real change made)

. replace marca = 7 if q019r30oe =="Poll moll"
(1 real change made)

. 
. 
. replace marca = 5 if q019r30oe =="Malboro rubi"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro ice"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro Sandía"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson & Hedges Violeta"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson violeta"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 5 if q019r30oe =="ICE EXPRESS DE MARLBORO"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="lucky strike"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(0 real changes made)

. replace marca = 3 if q019r30oe =="chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pollmol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pallmall"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shots"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall Mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MAL"
(0 real changes made)

. replace marca = 3 if q019r30oe =="delicados sin filtro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(0 real changes made)

. replace marca = 5 if q019r30oe =="malvoro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo Mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="raleigt"
(0 real changes made)

. replace marca = 1 if q019r30oe =="BENSON DORADOS LIGHT"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucky strike"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson mentolado"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palmall doble clik"
(0 real changes made)

. replace marca = 7 if q019r30oe =="paull mool"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Marlboro rubi"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pollman"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 2 if q019r30oe =="Camel mentolados"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo mall"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucy strigth"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mart"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Montana"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallman"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shot"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. // 
. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. /*
> [IF 018=1] ¿Qué marca es?
> [IF 018=2] ¿Qué marca estás fumando actualmente o fumaste más recientemente?
> 1.      Alas[023]
> 2.      Benson y Hedges o B&H
> 3.      Broadway[023]
> 4.      Camel
> 5.      Chesterfield
> 6.      Cohiba[021]
> 7.      Delicados
> 8.      Dunhill
> 9.      Faros
> 10.     Fiesta[021]
> 11.     Fortuna
> 12.     Garañon[021]
> 13.     Joe’s
> 14.     Kent
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 18.     Murattimar
> 19.     Pall Mall
> 20.     Popular 
> 21.     RGD
> 22.     Raleigh[021]
> 23.     Salem[021]
> 24.     Seneca
> 25.     Viceroy[021]
> 26.     West[021]
> 27.     Winston
> 28.     L & M Baronet 
> 29.     Link Ice Fusion 
> 30.     Otro [Especificar] ___________ [021]
> 99      No sé[021]
> */
. 
. 
end of do-file

. 
. // solo cantidades 14, 20 y 25
. // no considera compras de cigarro suelto
. drop if q029a > 3
(341 observations deleted)

. // 341 obs deleted
. drop if has_ == 0
(28 observations deleted)

. // 38 obs deleted
. 
. gen cantidad_cajetilla = q029a

. gen precio_cajetilla = q029

. gen ppu_ = q029/14 if q029a == 1 
(971 missing values generated)

. replace ppu = q029/20 if q029a == 2
(861 real changes made)

. replace ppu = q029/25 if q029a == 3
(110 real changes made)

. 
. // a partir de qué precio por cajetilla
. // se observa una mayor proporción de cajetillas en cada grupo?
. 
. // tablas para cantidad
. ta precio cantidad if marca == 3, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

precio_caj |        cantidad_cajetilla
    etilla |         1          2          3 |     Total
-----------+---------------------------------+----------
        35 |         1          1          0 |         2 
           |     50.00      50.00       0.00 |    100.00 
           |      7.69       4.00       0.00 |      3.33 
-----------+---------------------------------+----------
        38 |         2          0          0 |         2 
           |    100.00       0.00       0.00 |    100.00 
           |     15.38       0.00       0.00 |      3.33 
-----------+---------------------------------+----------
        39 |         2          1          0 |         3 
           |     66.67      33.33       0.00 |    100.00 
           |     15.38       4.00       0.00 |      5.00 
-----------+---------------------------------+----------
        40 |         3          0          0 |         3 
           |    100.00       0.00       0.00 |    100.00 
           |     23.08       0.00       0.00 |      5.00 
-----------+---------------------------------+----------
        45 |         3          1          0 |         4 
           |     75.00      25.00       0.00 |    100.00 
           |     23.08       4.00       0.00 |      6.67 
-----------+---------------------------------+----------
        47 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00       4.00       0.00 |      1.67 
-----------+---------------------------------+----------
        48 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00       4.00       0.00 |      1.67 
-----------+---------------------------------+----------
        50 |         0          3          0 |         3 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00      12.00       0.00 |      5.00 
-----------+---------------------------------+----------
        53 |         0          3          1 |         4 
           |      0.00      75.00      25.00 |    100.00 
           |      0.00      12.00       4.55 |      6.67 
-----------+---------------------------------+----------
        54 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00       4.00       0.00 |      1.67 
-----------+---------------------------------+----------
        55 |         0          5          1 |         6 
           |      0.00      83.33      16.67 |    100.00 
           |      0.00      20.00       4.55 |     10.00 
-----------+---------------------------------+----------
        56 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00       4.00       0.00 |      1.67 
-----------+---------------------------------+----------
        57 |         0          0          4 |         4 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00      18.18 |      6.67 
-----------+---------------------------------+----------
        58 |         1          0         10 |        11 
           |      9.09       0.00      90.91 |    100.00 
           |      7.69       0.00      45.45 |     18.33 
-----------+---------------------------------+----------
        59 |         0          0          1 |         1 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00       4.55 |      1.67 
-----------+---------------------------------+----------
        60 |         0          2          2 |         4 
           |      0.00      50.00      50.00 |    100.00 
           |      0.00       8.00       9.09 |      6.67 
-----------+---------------------------------+----------
        63 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00       4.00       0.00 |      1.67 
-----------+---------------------------------+----------
        65 |         0          2          1 |         3 
           |      0.00      66.67      33.33 |    100.00 
           |      0.00       8.00       4.55 |      5.00 
-----------+---------------------------------+----------
        68 |         0          0          1 |         1 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00       4.55 |      1.67 
-----------+---------------------------------+----------
        70 |         1          1          0 |         2 
           |     50.00      50.00       0.00 |    100.00 
           |      7.69       4.00       0.00 |      3.33 
-----------+---------------------------------+----------
        85 |         0          1          1 |         2 
           |      0.00      50.00      50.00 |    100.00 
           |      0.00       4.00       4.55 |      3.33 
-----------+---------------------------------+----------
     Total |        13         25         22 |        60 
           |     21.67      41.67      36.67 |    100.00 
           |    100.00     100.00     100.00 |    100.00 


. 
. ta precio cantidad if marca == 6, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

precio_caj |        cantidad_cajetilla
    etilla |         1          2          3 |     Total
-----------+---------------------------------+----------
        20 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00      10.00       0.00 |      1.72 
-----------+---------------------------------+----------
        35 |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
           |      5.26       0.00       0.00 |      1.72 
-----------+---------------------------------+----------
        36 |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
           |      5.26       0.00       0.00 |      1.72 
-----------+---------------------------------+----------
        37 |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
           |      5.26       0.00       0.00 |      1.72 
-----------+---------------------------------+----------
        38 |         2          1          0 |         3 
           |     66.67      33.33       0.00 |    100.00 
           |     10.53      10.00       0.00 |      5.17 
-----------+---------------------------------+----------
        39 |         7          0          0 |         7 
           |    100.00       0.00       0.00 |    100.00 
           |     36.84       0.00       0.00 |     12.07 
-----------+---------------------------------+----------
        40 |         1          2          0 |         3 
           |     33.33      66.67       0.00 |    100.00 
           |      5.26      20.00       0.00 |      5.17 
-----------+---------------------------------+----------
        42 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00      10.00       0.00 |      1.72 
-----------+---------------------------------+----------
        45 |         0          1          1 |         2 
           |      0.00      50.00      50.00 |    100.00 
           |      0.00      10.00       3.45 |      3.45 
-----------+---------------------------------+----------
        48 |         0          0          2 |         2 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00       6.90 |      3.45 
-----------+---------------------------------+----------
        50 |         2          1          1 |         4 
           |     50.00      25.00      25.00 |    100.00 
           |     10.53      10.00       3.45 |      6.90 
-----------+---------------------------------+----------
        52 |         0          0          1 |         1 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00       3.45 |      1.72 
-----------+---------------------------------+----------
        53 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00      10.00       0.00 |      1.72 
-----------+---------------------------------+----------
        55 |         0          0          3 |         3 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00      10.34 |      5.17 
-----------+---------------------------------+----------
        56 |         0          0          3 |         3 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00      10.34 |      5.17 
-----------+---------------------------------+----------
        57 |         0          0          2 |         2 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00       6.90 |      3.45 
-----------+---------------------------------+----------
        58 |         0          0         12 |        12 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00      41.38 |     20.69 
-----------+---------------------------------+----------
        59 |         0          0          2 |         2 
           |      0.00       0.00     100.00 |    100.00 
           |      0.00       0.00       6.90 |      3.45 
-----------+---------------------------------+----------
        60 |         2          0          2 |         4 
           |     50.00       0.00      50.00 |    100.00 
           |     10.53       0.00       6.90 |      6.90 
-----------+---------------------------------+----------
        65 |         0          1          0 |         1 
           |      0.00     100.00       0.00 |    100.00 
           |      0.00      10.00       0.00 |      1.72 
-----------+---------------------------------+----------
        68 |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
           |      5.26       0.00       0.00 |      1.72 
-----------+---------------------------------+----------
        70 |         1          1          0 |         2 
           |     50.00      50.00       0.00 |    100.00 
           |      5.26      10.00       0.00 |      3.45 
-----------+---------------------------------+----------
     Total |        19         10         29 |        58 
           |     32.76      17.24      50.00 |    100.00 
           |    100.00     100.00     100.00 |    100.00 


. 
. // histogramas de cantidad por marca
. * histogram q029 if marca == 99, normal kdensity
. //graph save Graph "graficos\exploratorios\precio_caja_m99_w8.gph", replace
. 
. // todas las proporciones
. proportion q029a, over(marca)

Proportion estimation             Number of obs   =      1,131

      _prop_1: q029a = 1
      _prop_2: q029a = 2
      _prop_3: q029a = 3

    _subpop_1: marca = Benson y Hedges
        Camel: marca = Camel
 Chesterfield: marca = Chesterfield
    _subpop_4: marca = Lucky Strike
     Marlboro: marca = Marlboro
      Montana: marca = Montana
    _subpop_7: marca = Pall Mall
        Otras: marca = Otras

--------------------------------------------------------------
        Over | Proportion   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
_prop_1      |
   _subpop_1 |   .1139241   .0253567       .072822    .1738743
       Camel |    .109375   .0393221      .0526919    .2133046
Chesterfield |   .2166667   .0536344       .129517    .3395813
   _subpop_4 |   .2352941   .0738407      .1209085    .4077064
    Marlboro |   .1319588   .0153839      .1045873    .1651722
     Montana |   .3275862   .0621647        .21877    .4587449
   _subpop_7 |   .1084906   .0214101      .0730621    .1581671
       Otras |   .1333333   .0442557      .0676577    .2459434
-------------+------------------------------------------------
_prop_2      |
   _subpop_1 |   .8164557   .0308949      .7480066    .8695544
       Camel |    .859375   .0437978      .7500774    .9256142
Chesterfield |   .4166667    .064184      .2984693    .5452888
   _subpop_4 |   .6764706   .0814375      .5018777    .8127056
    Marlboro |   .8123711   .0177462      .7750511    .8447399
     Montana |   .1724138   .0500328       .094781    .2930485
   _subpop_7 |   .8349057    .025559      .7785059    .8791731
       Otras |         .8   .0520756      .6786766    .8833859
-------------+------------------------------------------------
_prop_3      |
   _subpop_1 |   .0696203   .0203118       .038873    .1216104
       Camel |     .03125    .021921      .0077313    .1178183
Chesterfield |   .3666667   .0627373      .2541468    .4958824
   _subpop_4 |   .0882353   .0493748      .0282073     .243942
    Marlboro |   .0556701    .010422      .0384198    .0800211
     Montana |         .5   .0662266      .3729075    .6270925
   _subpop_7 |   .0566038   .0159085      .0323601    .0971863
       Otras |   .0666667   .0324748      .0250114    .1658925
--------------------------------------------------------------

. // para Chesterfield 25 es muy alto, pero 20 no es tanto
. // para Montana 20 es muy bajo, 25 llega a 50 %, 14 también es alto
. matrix prop_cant_caj_marca = r(table)

. 
. rename ppu ppu_cuest

. label variable ppu_cuest "obtenido desde el cuestionario"

. 
. keep id wave cantidad_cajetilla precio_cajetilla ppu_cuest

. 
. save "$datos/cantidades_cigarros_w8_sin_inegi.dta", replace
file datos/encuesta//cantidades_cigarros_w8_sin_inegi.dta saved

. 
. // // 
. // use "$datos/c_pw4_w5_unbalanc.dta", clear
. //
. // drop if has_ == 0
. // keep if q028 == 1
. // //(525 observations deleted)
. //
. // append using "$datos/cantidades_cigarros_w8.dta"
. //
. // save "$datos/c_pw4_w5_w8_caj.dta", replace
. 
. log close
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\encuesta\/para_precio_w8.log
  log type:  text
 closed on:  17 Sep 2021, 15:28:45
--------------------------------------------------------------------------------------------------------------------------------------------------------
