--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados/encuesta/para_precio_w4_w5_prom_minmax.log
  log type:  text
 opened on:   8 Sep 2021, 12:35:49

. 
. global datos = "datos/encuesta/"

. global codigo = "stata_code\encuesta_\"

. global resultados = "resultados\encuesta\"

. 
. use "$datos/91224059_w01_w08_appended_merge_w1_w8_v1_06042021_ETIQUETA SEND_weights.dta", clear

. 
. keep if wave == 5
(10,509 observations deleted)

. 
. do "$codigo/etiquetas_marcas.do"

. /*
> etiquetas_marcas.do
> usado: recodificar.do
> Etiquetar e identificar las marcas más relevantes para el análisis
> 2.      Benson y Hedges o B&H
> 4.      Camel
> 5.      Chesterfield
> 7.      Delicados > 5
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 19.     Pall Mall
> 22.     Raleigh[021] > 15 
> * también está la marca q026, último consumo, pero se reporta menos
> */
. gen marca = .
(1,499 missing values generated)

. replace marca = 1 if q019 == 2
(164 real changes made)

. replace marca = 2 if q019 == 4
(64 real changes made)

. replace marca = 3 if q019 == 5
(37 real changes made)

. replace marca = 3 if q019 == 7 // Delicados por Chesterfield
(24 real changes made)

. replace marca = 4 if q019 == 15
(65 real changes made)

. replace marca = 4 if q019 == 22 // Raleigh a Lucky
(8 real changes made)

. replace marca = 5 if q019 == 16
(609 real changes made)

. replace marca = 6 if q019 == 17
(69 real changes made)

. replace marca = 7 if q019 == 19
(289 real changes made)

. recode marca . = 99
(marca: 170 changes made)

. 
. #delimit ;
delimiter now ;
. label define marca 1 "Benson y Hedges" 
>                                 2 "Camel"
>                                 3 "Chesterfield"
>                                 4 "Lucky Strike"
>                                 5 "Marlboro"
>                                 6 "Montana"
>                                 7 "Pall Mall"
>                                 99 "Otras"
>                 ;

. #delimit cr
delimiter now cr
. 
. label values marca marca

. 
. // tipo_marca
. gen tipo = 1 if marca == 1 | marca == 2 | marca == 5
(662 missing values generated)

. replace tipo = 2 if marca == 4 | marca == 7
(362 real changes made)

. replace tipo = 3 if marca == 3 | marca == 6
(130 real changes made)

. 
. label define tipo 1 "premium" 2 "medio" 3 "bajo"

. label values tipo tipo

. 
. // Juntar Chesterfield y Delicados
. // Raleigh : Lucky
. // ajustar manual q019r30oe.xls
. // 
. // wave 8
. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mart"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallman"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shot"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. 
. replace marca = 5 if q019r30oe =="Malboro rubi"
(1 real change made)

. replace marca = 5 if q019r30oe =="marlboro ice"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro Sandía"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(1 real change made)

. replace marca = 1 if q019r30oe =="Benson & Hedges Violeta"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson violeta"
(1 real change made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 5 if q019r30oe =="ICE EXPRESS DE MARLBORO"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="lucky strike"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(0 real changes made)

. replace marca = 3 if q019r30oe =="chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pollmol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pallmall"
(1 real change made)

. replace marca = 6 if q019r30oe =="Shots"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall Mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MAL"
(0 real changes made)

. replace marca = 3 if q019r30oe =="delicados sin filtro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(0 real changes made)

. replace marca = 5 if q019r30oe =="malvoro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo Mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="raleigt"
(0 real changes made)

. replace marca = 1 if q019r30oe =="BENSON DORADOS LIGHT"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucky strike"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson mentolado"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palmall doble clik"
(1 real change made)

. replace marca = 7 if q019r30oe =="paull mool"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Marlboro rubi"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pollman"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 2 if q019r30oe =="Camel mentolados"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo mall"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucy strigth"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mart"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Montana"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallman"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shot"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. // 
. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. /*
> [IF 018=1] ¿Qué marca es?
> [IF 018=2] ¿Qué marca estás fumando actualmente o fumaste más recientemente?
> 1.      Alas[023]
> 2.      Benson y Hedges o B&H
> 3.      Broadway[023]
> 4.      Camel
> 5.      Chesterfield
> 6.      Cohiba[021]
> 7.      Delicados
> 8.      Dunhill
> 9.      Faros
> 10.     Fiesta[021]
> 11.     Fortuna
> 12.     Garañon[021]
> 13.     Joe’s
> 14.     Kent
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 18.     Murattimar
> 19.     Pall Mall
> 20.     Popular 
> 21.     RGD
> 22.     Raleigh[021]
> 23.     Salem[021]
> 24.     Seneca
> 25.     Viceroy[021]
> 26.     West[021]
> 27.     Winston
> 28.     L & M Baronet 
> 29.     Link Ice Fusion 
> 30.     Otro [Especificar] ___________ [021]
> 99      No sé[021]
> */
. 
. 
end of do-file

. 
. keep id wave marca q019 q029

. 
. 
. gen cantidad_cigarros = .
(1,499 missing values generated)

. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 1
(0 real changes made)

. 
. // Benson
. *hist q029 if marca == 1
. 
. // SE MODIFICA LA CANTIDAD QUE DEFINE EL PUNTO DE CORTE 
. // PARA TENER PROMEDIOS entre min y max de cada categoria
. recode cantidad_cigarros . = 14 if marca == 1 & q029 <=51
(cantidad_cigarros: 20 changes made)

. recode cantidad_cigarros . = 20 if marca == 1 & q029 >51
(cantidad_cigarros: 145 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |         20       12.12       12.12
         20 |        145       87.88      100.00
------------+-----------------------------------
      Total |        165      100.00

. ta marca cantidad_, m

                |        cantidad_cigarros
          marca |        14         20          . |     Total
----------------+---------------------------------+----------
Benson y Hedges |        20        145          0 |       165 
          Camel |         0          0         64 |        64 
   Chesterfield |         0          0         61 |        61 
   Lucky Strike |         0          0         73 |        73 
       Marlboro |         0          0        610 |       610 
        Montana |         0          0         69 |        69 
      Pall Mall |         0          0        293 |       293 
          Otras |         0          0        164 |       164 
----------------+---------------------------------+----------
          Total |        20        145      1,334 |     1,499 


. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 3
(2 real changes made)

. 
. //Camel
. *hist q029 if marca == 2
. // SE MODIFICA LA CANTIDAD QUE DEFINE EL PUNTO DE CORTE 
. recode cantidad_cigarros . = 14 if marca == 2 & q029 <=50.5
(cantidad_cigarros: 12 changes made)

. recode cantidad_cigarros . = 20 if marca == 2 & q029 >50.5
(cantidad_cigarros: 52 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |         32       13.85       13.85
         20 |        199       86.15      100.00
------------+-----------------------------------
      Total |        231      100.00

. ta marca cantidad_, m

                |        cantidad_cigarros
          marca |        14         20          . |     Total
----------------+---------------------------------+----------
Benson y Hedges |        20        145          0 |       165 
          Camel |        12         52          0 |        64 
   Chesterfield |         0          0         61 |        61 
   Lucky Strike |         0          0         73 |        73 
       Marlboro |         0          0        610 |       610 
        Montana |         0          0         69 |        69 
      Pall Mall |         0          0        293 |       293 
          Otras |         0          2        162 |       164 
----------------+---------------------------------+----------
          Total |        32        199      1,268 |     1,499 


. 
. //Chesterfield
. *hist q029 if marca == 3
. // SE MODIFICA LA CANTIDAD QUE DEFINE EL PUNTO DE CORTE 
. recode cantidad_cigarros . = 14 if marca == 3 & q029 <=42.64
(cantidad_cigarros: 11 changes made)

. // recode cantidad_cigarros . = 18 if marca == 3 & q029 <=50.75
. // solo 3 categorias
. recode cantidad_cigarros . = 20 if marca == 3 & q029 <=55
(cantidad_cigarros: 27 changes made)

. // 18, 24 a 20
. //recode cantidad_cigarros . = 24 if marca == 3 & q029 <=55
. // solo 3 categorias
. recode cantidad_cigarros . = 25 if marca == 3 & q029 >55
(cantidad_cigarros: 23 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |         43       14.73       14.73
         20 |        226       77.40       92.12
         25 |         23        7.88      100.00
------------+-----------------------------------
      Total |        292      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         25          . |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        20        145          0          0 |       165 
          Camel |        12         52          0          0 |        64 
   Chesterfield |        11         27         23          0 |        61 
   Lucky Strike |         0          0          0         73 |        73 
       Marlboro |         0          0          0        610 |       610 
        Montana |         0          0          0         69 |        69 
      Pall Mall |         0          0          0        293 |       293 
          Otras |         0          2          0        162 |       164 
----------------+--------------------------------------------+----------
          Total |        43        226         23      1,207 |     1,499 


. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 6
(0 real changes made)

. 
. replace cantidad_cigarros = 20 if q019 == 8
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 9
(3 real changes made)

. replace cantidad_cigarros = 20 if q019 == 10
(0 real changes made)

. replace cantidad_cigarros = 20 if q019 == 11
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 12
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 13
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 14
(4 real changes made)

. 
. //Lucky Strike
. *hist q029 if marca == 4
. // SE MODIFICA LA CANTIDAD QUE DEFINE EL PUNTO DE CORTE 
. recode cantidad_cigarros . = 20 if marca == 4 & q029 <=56.618
(cantidad_cigarros: 32 changes made)

. recode cantidad_cigarros . = 25 if marca == 4 & q029 >56.618
(cantidad_cigarros: 41 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |         43       11.41       11.41
         20 |        270       71.62       83.02
         25 |         64       16.98      100.00
------------+-----------------------------------
      Total |        377      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         25          . |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        20        145          0          0 |       165 
          Camel |        12         52          0          0 |        64 
   Chesterfield |        11         27         23          0 |        61 
   Lucky Strike |         0         32         41          0 |        73 
       Marlboro |         0          0          0        610 |       610 
        Montana |         0          0          0         69 |        69 
      Pall Mall |         0          0          0        293 |       293 
          Otras |         0         14          0        150 |       164 
----------------+--------------------------------------------+----------
          Total |        43        270         64      1,122 |     1,499 


. 
. //Marlboro
. *hist q029 if marca == 5
. // SE MODIFICA LA CANTIDAD QUE DEFINE EL PUNTO DE CORTE 
. recode cantidad_cigarros . = 14 if marca == 5 & q029 <=54.25
(cantidad_cigarros: 107 changes made)

. recode cantidad_cigarros . = 20 if marca == 5 & q029 >54.25
(cantidad_cigarros: 503 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        150       15.20       15.20
         20 |        773       78.32       93.52
         25 |         64        6.48      100.00
------------+-----------------------------------
      Total |        987      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         25          . |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        20        145          0          0 |       165 
          Camel |        12         52          0          0 |        64 
   Chesterfield |        11         27         23          0 |        61 
   Lucky Strike |         0         32         41          0 |        73 
       Marlboro |       107        503          0          0 |       610 
        Montana |         0          0          0         69 |        69 
      Pall Mall |         0          0          0        293 |       293 
          Otras |         0         14          0        150 |       164 
----------------+--------------------------------------------+----------
          Total |       150        773         64        512 |     1,499 


. 
. //Montana
. *hist q029 if marca == 6
. // SE MODIFICA LA CANTIDAD QUE DEFINE EL PUNTO DE CORTE 
. recode cantidad_cigarros . = 14 if marca == 6 & q029 <=37
(cantidad_cigarros: 16 changes made)

. // recode cantidad_cigarros . = 15 if marca == 6 & q029 <=46
. recode cantidad_cigarros . = 20 if marca == 6 & q029 <=54
(cantidad_cigarros: 20 changes made)

. // solo 3 presentaciones se consideran
. recode cantidad_cigarros . = 25 if marca == 6 & q029 >54
(cantidad_cigarros: 33 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        166       15.72       15.72
         20 |        793       75.09       90.81
         25 |         97        9.19      100.00
------------+-----------------------------------
      Total |      1,056      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         25          . |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        20        145          0          0 |       165 
          Camel |        12         52          0          0 |        64 
   Chesterfield |        11         27         23          0 |        61 
   Lucky Strike |         0         32         41          0 |        73 
       Marlboro |       107        503          0          0 |       610 
        Montana |        16         20         33          0 |        69 
      Pall Mall |         0          0          0        293 |       293 
          Otras |         0         14          0        150 |       164 
----------------+--------------------------------------------+----------
          Total |       166        793         97        443 |     1,499 


. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 18
(2 real changes made)

. 
. //Pall Mall
. *hist q029 if marca == 7
. // SE MODIFICA LA CANTIDAD QUE DEFINE EL PUNTO DE CORTE 
. recode cantidad_cigarros . = 14 if marca == 7 & q029 <=47.5
(cantidad_cigarros: 22 changes made)

. recode cantidad_cigarros . = 20 if marca == 7 & q029 <=55.95
(cantidad_cigarros: 114 changes made)

. recode cantidad_cigarros . = 25 if marca == 7 & q029 >55.95
(cantidad_cigarros: 157 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        188       13.92       13.92
         20 |        909       67.28       81.20
         25 |        254       18.80      100.00
------------+-----------------------------------
      Total |      1,351      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         25          . |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        20        145          0          0 |       165 
          Camel |        12         52          0          0 |        64 
   Chesterfield |        11         27         23          0 |        61 
   Lucky Strike |         0         32         41          0 |        73 
       Marlboro |       107        503          0          0 |       610 
        Montana |        16         20         33          0 |        69 
      Pall Mall |        22        114        157          0 |       293 
          Otras |         0         16          0        148 |       164 
----------------+--------------------------------------------+----------
          Total |       188        909        254        148 |     1,499 


. 
. // OTROS IGUAL A 20
. replace cantidad_cigarros = 20 if q019 == 20
(0 real changes made)

. replace cantidad_cigarros = 20 if q019 == 21
(0 real changes made)

. 
. replace cantidad_cigarros = 20 if q019 == 23
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 24
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 25
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 26
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 27
(10 real changes made)

. replace cantidad_cigarros = 20 if q019 == 28
(19 real changes made)

. replace cantidad_cigarros = 20 if q019 == 29
(0 real changes made)

. 
. // SE CAMBIA q019 por marca PARA MANTENER LA CONSISTENCIA SOBRE LAS MARCAS EN etiquetas_marcas.do
. recode cantidad_cigarros . = 20 if marca == 99
(cantidad_cigarros: 117 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        188       12.54       12.54
         20 |      1,061       70.78       83.32
         25 |        250       16.68      100.00
------------+-----------------------------------
      Total |      1,499      100.00

. ta marca cantidad_, m

                |        cantidad_cigarros
          marca |        14         20         25 |     Total
----------------+---------------------------------+----------
Benson y Hedges |        20        145          0 |       165 
          Camel |        12         52          0 |        64 
   Chesterfield |        11         27         23 |        61 
   Lucky Strike |         0         32         41 |        73 
       Marlboro |       107        503          0 |       610 
        Montana |        16         20         33 |        69 
      Pall Mall |        22        118        153 |       293 
          Otras |         0        164          0 |       164 
----------------+---------------------------------+----------
          Total |       188      1,061        250 |     1,499 


. 
. save "$datos/cantidades_cigarros_w5.dta", replace
file datos/encuesta//cantidades_cigarros_w5.dta saved

. 
. // WAVE 4
. use "$datos/91224059_w01_w08_appended_merge_w1_w8_v1_06042021_ETIQUETA SEND_weights.dta", clear

. 
. keep if wave == 4
(10,504 observations deleted)

. 
. do "$codigo/etiquetas_marcas.do"

. /*
> etiquetas_marcas.do
> usado: recodificar.do
> Etiquetar e identificar las marcas más relevantes para el análisis
> 2.      Benson y Hedges o B&H
> 4.      Camel
> 5.      Chesterfield
> 7.      Delicados > 5
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 19.     Pall Mall
> 22.     Raleigh[021] > 15 
> * también está la marca q026, último consumo, pero se reporta menos
> */
. gen marca = .
(1,504 missing values generated)

. replace marca = 1 if q019 == 2
(179 real changes made)

. replace marca = 2 if q019 == 4
(74 real changes made)

. replace marca = 3 if q019 == 5
(38 real changes made)

. replace marca = 3 if q019 == 7 // Delicados por Chesterfield
(31 real changes made)

. replace marca = 4 if q019 == 15
(57 real changes made)

. replace marca = 4 if q019 == 22 // Raleigh a Lucky
(1 real change made)

. replace marca = 5 if q019 == 16
(628 real changes made)

. replace marca = 6 if q019 == 17
(72 real changes made)

. replace marca = 7 if q019 == 19
(265 real changes made)

. recode marca . = 99
(marca: 159 changes made)

. 
. #delimit ;
delimiter now ;
. label define marca 1 "Benson y Hedges" 
>                                 2 "Camel"
>                                 3 "Chesterfield"
>                                 4 "Lucky Strike"
>                                 5 "Marlboro"
>                                 6 "Montana"
>                                 7 "Pall Mall"
>                                 99 "Otras"
>                 ;

. #delimit cr
delimiter now cr
. 
. label values marca marca

. 
. // tipo_marca
. gen tipo = 1 if marca == 1 | marca == 2 | marca == 5
(623 missing values generated)

. replace tipo = 2 if marca == 4 | marca == 7
(323 real changes made)

. replace tipo = 3 if marca == 3 | marca == 6
(141 real changes made)

. 
. label define tipo 1 "premium" 2 "medio" 3 "bajo"

. label values tipo tipo

. 
. // Juntar Chesterfield y Delicados
. // Raleigh : Lucky
. // ajustar manual q019r30oe.xls
. // 
. // wave 8
. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mart"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallman"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shot"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. 
. replace marca = 5 if q019r30oe =="Malboro rubi"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro ice"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro Sandía"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(1 real change made)

. replace marca = 1 if q019r30oe =="Benson & Hedges Violeta"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson violeta"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson cristal"
(0 real changes made)

. replace marca = 5 if q019r30oe =="ICE EXPRESS DE MARLBORO"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="lucky strike"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(1 real change made)

. replace marca = 3 if q019r30oe =="chesterfield"
(1 real change made)

. replace marca = 7 if q019r30oe =="Pollmol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pallmall"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shots"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall Mall"
(1 real change made)

. replace marca = 7 if q019r30oe =="pall mol"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MAL"
(1 real change made)

. replace marca = 3 if q019r30oe =="delicados sin filtro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(1 real change made)

. replace marca = 5 if q019r30oe =="malvoro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo Mall"
(1 real change made)

. replace marca = 4 if q019r30oe =="raleigt"
(0 real changes made)

. replace marca = 1 if q019r30oe =="BENSON DORADOS LIGHT"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucky strike"
(0 real changes made)

. replace marca = 7 if q019r30oe =="PALL MALL"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Benson mentolado"
(0 real changes made)

. replace marca = 7 if q019r30oe =="pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palmall"
(1 real change made)

. replace marca = 7 if q019r30oe =="Palmall doble clik"
(0 real changes made)

. replace marca = 7 if q019r30oe =="paull mool"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 1 if q019r30oe =="Marlboro rubi"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pollman"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 2 if q019r30oe =="Camel mentolados"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallmall"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Palo mall"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mall"
(0 real changes made)

. replace marca = 4 if q019r30oe =="Lucy strigth"
(0 real changes made)

. replace marca = 3 if q019r30oe =="Chesterfield"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pall mart"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Montana"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Pallman"
(0 real changes made)

. replace marca = 5 if q019r30oe =="Marlboro"
(0 real changes made)

. replace marca = 6 if q019r30oe =="Shot"
(0 real changes made)

. replace marca = 5 if q019r30oe =="marlboro"
(0 real changes made)

. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. // 
. replace marca = 7 if q019r30oe =="Poll moll"
(0 real changes made)

. 
. /*
> [IF 018=1] ¿Qué marca es?
> [IF 018=2] ¿Qué marca estás fumando actualmente o fumaste más recientemente?
> 1.      Alas[023]
> 2.      Benson y Hedges o B&H
> 3.      Broadway[023]
> 4.      Camel
> 5.      Chesterfield
> 6.      Cohiba[021]
> 7.      Delicados
> 8.      Dunhill
> 9.      Faros
> 10.     Fiesta[021]
> 11.     Fortuna
> 12.     Garañon[021]
> 13.     Joe’s
> 14.     Kent
> 15.     Lucky Strike
> 16.     Marlboro
> 17.     Montana
> 18.     Murattimar
> 19.     Pall Mall
> 20.     Popular 
> 21.     RGD
> 22.     Raleigh[021]
> 23.     Salem[021]
> 24.     Seneca
> 25.     Viceroy[021]
> 26.     West[021]
> 27.     Winston
> 28.     L & M Baronet 
> 29.     Link Ice Fusion 
> 30.     Otro [Especificar] ___________ [021]
> 99      No sé[021]
> */
. 
. 
end of do-file

. 
. keep id wave marca q019 q029 

. 
. //----------------
. gen cantidad_cigarros = .
(1,504 missing values generated)

. // Benson a Pall Mall
. recode cantidad_cigarros . = 14 if marca == 1 & q029 <=48.5
(cantidad_cigarros: 22 changes made)

. recode cantidad_cigarros . = 20 if marca == 1 & q029 >48.5
(cantidad_cigarros: 157 changes made)

. 
. recode cantidad_cigarros . = 14 if marca == 2 & q029 <=46.05
(cantidad_cigarros: 7 changes made)

. recode cantidad_cigarros . = 20 if marca == 2 & q029 >46.05
(cantidad_cigarros: 67 changes made)

. 
. recode cantidad_cigarros . = 14 if marca == 3 & q029 <=30.5
(cantidad_cigarros: 2 changes made)

. // recode cantidad_cigarros . = 15 if marca == 3 & q029 <=38
. //recode cantidad_cigarros . = 18 if marca == 3 & q029 <=45.5
. // 15, 18, 24 a 20
. recode cantidad_cigarros . = 20 if marca == 3 & q029 <=49
(cantidad_cigarros: 35 changes made)

. // recode cantidad_cigarros . = 24 if marca == 3 & q029 <=49
. // solo 3 categorias
. recode cantidad_cigarros . = 25 if marca == 3 & q029 >49
(cantidad_cigarros: 33 changes made)

. 
. recode cantidad_cigarros . = 20 if marca == 4 & q029 <=57.5
(cantidad_cigarros: 38 changes made)

. recode cantidad_cigarros . = 25 if marca == 4 & q029 >57.5
(cantidad_cigarros: 20 changes made)

. 
. recode cantidad_cigarros . = 14 if marca == 5 & q029 <=55
(cantidad_cigarros: 246 changes made)

. recode cantidad_cigarros . = 20 if marca == 5 & q029 >55
(cantidad_cigarros: 382 changes made)

. 
. recode cantidad_cigarros . = 14 if marca == 6 & q029 <=32.5
(cantidad_cigarros: 17 changes made)

. // 15 a 20, solo 3 categorias
. // recode cantidad_cigarros . = 15 if marca == 6 & q029 <=40
. recode cantidad_cigarros . = 20 if marca == 6 & q029 <=49
(cantidad_cigarros: 35 changes made)

. // 24 a 20, solo 3 categorias
. // recode cantidad_cigarros . = 24 if marca == 6 & q029 <=49
. recode cantidad_cigarros . = 25 if marca == 6 & q029 >49
(cantidad_cigarros: 20 changes made)

. 
. recode cantidad_cigarros . = 14 if marca == 7 & q029 <=42
(cantidad_cigarros: 18 changes made)

. recode cantidad_cigarros . = 20 if marca == 7 & q029 <=53
(cantidad_cigarros: 150 changes made)

. recode cantidad_cigarros . = 25 if marca == 7 & q029 >53
(cantidad_cigarros: 104 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        312       23.06       23.06
         20 |        864       63.86       86.92
         25 |        177       13.08      100.00
------------+-----------------------------------
      Total |      1,353      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         25          . |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        22        157          0          0 |       179 
          Camel |         7         67          0          0 |        74 
   Chesterfield |         2         35         33          0 |        70 
   Lucky Strike |         0         38         20          0 |        58 
       Marlboro |       246        382          0          0 |       628 
        Montana |        17         35         20          0 |        72 
      Pall Mall |        18        150        104          0 |       272 
          Otras |         0          0          0        151 |       151 
----------------+--------------------------------------------+----------
          Total |       312        864        177        151 |     1,504 


. 
. /* OTROS */
. replace cantidad_cigarros = 20 if q019 == 1
(1 real change made)

. 
. replace cantidad_cigarros = 20 if q019 == 3
(2 real changes made)

. 
. replace cantidad_cigarros = 20 if q019 == 6
(2 real changes made)

. 
. replace cantidad_cigarros = 20 if q019 == 8
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 9
(3 real changes made)

. replace cantidad_cigarros = 20 if q019 == 10
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 11
(0 real changes made)

. replace cantidad_cigarros = 20 if q019 == 12
(6 real changes made)

. replace cantidad_cigarros = 20 if q019 == 13
(0 real changes made)

. replace cantidad_cigarros = 20 if q019 == 14
(0 real changes made)

. 
. replace cantidad_cigarros = 20 if q019 == 18
(1 real change made)

. 
. replace cantidad_cigarros = 20 if q019 == 20
(0 real changes made)

. replace cantidad_cigarros = 20 if q019 == 21
(1 real change made)

. 
. replace cantidad_cigarros = 20 if q019 == 23
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 24
(2 real changes made)

. replace cantidad_cigarros = 20 if q019 == 25
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 26
(1 real change made)

. replace cantidad_cigarros = 20 if q019 == 27
(13 real changes made)

. replace cantidad_cigarros = 20 if q019 == 28
(26 real changes made)

. replace cantidad_cigarros = 20 if q019 == 29
(0 real changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        311       22.01       22.01
         20 |        928       65.68       87.69
         25 |        174       12.31      100.00
------------+-----------------------------------
      Total |      1,413      100.00

. ta marca cantidad_, m

                |              cantidad_cigarros
          marca |        14         20         25          . |     Total
----------------+--------------------------------------------+----------
Benson y Hedges |        22        157          0          0 |       179 
          Camel |         7         67          0          0 |        74 
   Chesterfield |         2         35         33          0 |        70 
   Lucky Strike |         0         38         20          0 |        58 
       Marlboro |       246        382          0          0 |       628 
        Montana |        17         35         20          0 |        72 
      Pall Mall |        17        154        101          0 |       272 
          Otras |         0         60          0         91 |       151 
----------------+--------------------------------------------+----------
          Total |       311        928        174         91 |     1,504 


. 
. // SE CAMBIA q019 por marca PARA MANTENER LA CONSISTENCIA SOBRE LAS MARCAS EN etiquetas_marcas.do
. recode cantidad_cigarros . = 20 if marca == 99
(cantidad_cigarros: 91 changes made)

. 
. ta cantidad_

cantidad_ci |
     garros |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |        311       20.68       20.68
         20 |      1,019       67.75       88.43
         25 |        174       11.57      100.00
------------+-----------------------------------
      Total |      1,504      100.00

. ta marca cantidad_, m

                |        cantidad_cigarros
          marca |        14         20         25 |     Total
----------------+---------------------------------+----------
Benson y Hedges |        22        157          0 |       179 
          Camel |         7         67          0 |        74 
   Chesterfield |         2         35         33 |        70 
   Lucky Strike |         0         38         20 |        58 
       Marlboro |       246        382          0 |       628 
        Montana |        17         35         20 |        72 
      Pall Mall |        17        154        101 |       272 
          Otras |         0        151          0 |       151 
----------------+---------------------------------+----------
          Total |       311      1,019        174 |     1,504 


. 
. save "$datos/cantidades_cigarros_w4.dta", replace
file datos/encuesta//cantidades_cigarros_w4.dta saved

. 
. use "$datos/cantidades_cigarros_w4.dta", clear

. 
. append using "$datos/cantidades_cigarros_w5.dta"
(label marca already defined)

. 
. save "$datos/cant_cigarros_w4_w5.dta", replace
file datos/encuesta//cant_cigarros_w4_w5.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados/encuesta/para_precio_w4_w5_prom_minmax.log
  log type:  text
 closed on:   8 Sep 2021, 12:35:49
--------------------------------------------------------------------------------------------------------------------------------------------------------
