----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\encuesta\/mod
> elos_consumo3a.log
  log type:  text
 opened on:  21 Aug 2021, 09:53:06

. use "$datos/wave4_5unbalanced.dta", clear

. /***************************************************************************/
. // 1.3a MODELOS patron == 1 (diario)
. global v_x "sexo i.edad_gr2 i.educ_gr2 i.gr_ingr singles"

. global v_tax "tax2020"

. 
. foreach valor_patron of numlist 1 0 {
  2. *local valor_patron = 1
. // modelo
. regress consumo_semanal $v_tax $v_x  if patron == `valor_patron'
  3. outreg2 using resultados/encuesta/modelos1_3a`valor_patron', word excel replace
  4. 
. // estimación panel
. xtreg consumo_semanal $v_tax $v_x  if patron == `valor_patron', fe
  5. outreg2 using resultados/encuesta/modelos1_3a`valor_patron', word excel append
  6. 
. estimates store fixed
  7. *xttest2
. /*
> insufficient observations
> r(2001);
> 
> end of do-file
> */
. xtreg consumo_semanal $v_tax $v_x  if patron == `valor_patron', re
  8. outreg2 using resultados/encuesta/modelos1_3a`valor_patron', word excel append
  9. 
. estimates store random
 10. xttest0 
 11. * rechazo Pooled 
. * significance of random effects
. * Hausmann Test
. // hausman consistent efficient
. hausman fixed random , sigmamore
 12. /*
> 
>                  chi2(24) = (b-B)'[(V_b-V_B)^(-1)](b-B)
>                           =   -75.15    chi2<0 ==> model fitted on these
>                                         data fails to meet the asymptotic
>                                         assumptions of the Hausman test;
>                                         see suest for a generalized test
>  
> */
. 
. use "$datos/wave4_5balanc.dta", clear
 13. xtreg consumo_semanal $v_tax $v_x  if patron == `valor_patron', re
 14. outreg2 using resultados/encuesta/modelos1_3a`valor_patron', word excel append
 15. 
. *xttest2
. /*
> insufficient observations
> r(2001);
> 
> end of do-file
> */
. global v_x "sexo i.edad_gr2 i.educ_gr2 i.gr_ingr singles"
 16. global v_tax_int0 "tax2020 tax2020#i.sexo tax2020#i.singles"
 17. global v_tax_int1 "tax2020 tax2020#i.sexo "
 18. global v_tax_int2 "tax2020 tax2020#i.singles"
 19. 
. // modelo por ols
. regress consumo_semanal $v_tax_int0 $v_x  if patron == `valor_patron'
 20. outreg2 using resultados/encuesta/modelos1_3a_reg`valor_patron', word excel replace
 21. 
. regress consumo_semanal $v_tax_int1 $v_x  if patron == `valor_patron'
 22. outreg2 using resultados/encuesta/modelos1_3a_reg`valor_patron', word excel append
 23. 
. regress consumo_semanal $v_tax_int2 $v_x  if patron == `valor_patron'
 24. outreg2 using resultados/encuesta/modelos1_3a_reg`valor_patron', word excel append
 25. 
. // modelo por re
. xtreg consumo_semanal $v_tax_int0 $v_x  if patron == `valor_patron', re
 26. outreg2 using resultados/encuesta/modelos1_3a_xtreg`valor_patron', word excel replace
 27. 
. xtreg consumo_semanal $v_tax_int1 $v_x  if patron == `valor_patron',re
 28. outreg2 using resultados/encuesta/modelos1_3a_xtreg`valor_patron', word excel append
 29. 
. xtreg consumo_semanal $v_tax_int2 $v_x  if patron == `valor_patron'
 30. outreg2 using resultados/encuesta/modelos1_3a_xtreg`valor_patron', word excel append
 31. 
. *local valor_patron = 1
. 
. use "$datos/wave4_5balanc.dta", clear
 32. // modelo por re
. xtreg consumo_semanal $v_tax_int0 $v_x  if patron == `valor_patron', re
 33. outreg2 using resultados/encuesta/bal_mod1_3a_xtreg`valor_patron', word excel replace
 34. 
. xtreg consumo_semanal $v_tax_int1 $v_x  if patron == `valor_patron',re
 35. outreg2 using resultados/encuesta/bal_mod1_3a_xtreg`valor_patron', word excel append
 36. 
. xtreg consumo_semanal $v_tax_int2 $v_x  if patron == `valor_patron'
 37. outreg2 using resultados/encuesta/bal_mod1_3a_xtreg`valor_patron', word excel append
 38. 
. }

      Source |       SS           df       MS      Number of obs   =     1,341
-------------+----------------------------------   F(25, 1315)     =      5.45
       Model |  275387.239        25  11015.4896   Prob > F        =    0.0000
    Residual |  2660290.97     1,315  2023.03496   R-squared       =    0.0938
-------------+----------------------------------   Adj R-squared   =    0.0766
       Total |  2935678.21     1,340  2190.80463   Root MSE        =    44.978

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -4.706367   2.474102    -1.90   0.057    -9.559986     .147251
                    sexo |  -4.127548   2.554139    -1.62   0.106    -9.138181    .8830853
                         |
                edad_gr2 |
                  25-29  |  -1.871744   6.020619    -0.31   0.756    -13.68281    9.939323
                  30-34  |  -4.277198   5.845425    -0.73   0.464    -15.74457     7.19018
                  35-39  |   1.906631   5.937053     0.32   0.748    -9.740499    13.55376
                  40-44  |    6.03258   6.135276     0.98   0.326    -6.003417    18.06858
                  45-54  |   5.586124   5.699155     0.98   0.327    -5.594306    16.76655
                  55-64  |   15.53011   6.053558     2.57   0.010     3.654419    27.40579
                    65+  |   27.34045    10.6967     2.56   0.011     6.355979    48.32492
                         |
                educ_gr2 |
    Secundaria completa  |  -46.64713   14.16743    -3.29   0.001    -74.44036   -18.85391
                Técnica  |  -51.61693   14.16914    -3.64   0.000    -79.41353   -23.82034
           Preparatoria  |  -52.97915   13.96897    -3.79   0.000    -80.38305   -25.57524
Licenciatura incompleta  |  -52.38781   14.15927    -3.70   0.000    -80.16505   -24.61058
  Licenciatura completa  |  -48.59322   14.06248    -3.46   0.001    -76.18056   -21.00588
               Posgrado  |  -52.73657   15.21368    -3.47   0.001    -82.58231   -22.89083
                   Otro  |  -21.33581   21.03847    -1.01   0.311    -62.60845    19.93683
                         |
                 gr_ingr |
          3,001 a 5 mil  |   .6297318   8.380255     0.08   0.940     -15.8104    17.06986
          5,001 a 8 mil  |  -.2292227   7.676992    -0.03   0.976    -15.28971    14.83127
         8,001 a 10 mil  |   2.416407   7.506319     0.32   0.748    -12.30926    17.14208
        10,001 a 15 mil  |   .4715284   7.216239     0.07   0.948    -13.68507    14.62813
        15,001 a 20 mil  |   3.768079   7.307395     0.52   0.606    -10.56735     18.1035
        20,001 a 49,999  |   4.382764     7.2931     0.60   0.548    -9.924618    18.69015
                50 mil+  |   35.26481   8.819115     4.00   0.000     17.96374    52.56588
                  No sé  |  -8.397437   8.702364    -0.96   0.335    -25.46947    8.674597
                         |
                 singles |  -20.54939   4.667864    -4.40   0.000    -29.70666   -11.39211
                   _cons |   105.1948   15.31152     6.87   0.000     75.15716    135.2325
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a1.rtf
resultados/encuesta/modelos1_3a1.xml
dir : seeout
note: 9.educ_gr2 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,341
Group variable: id_num                          Number of groups  =        974

R-sq:                                           Obs per group:
     within  = 0.0877                                         min =          1
     between = 0.0167                                         avg =        1.4
     overall = 0.0175                                         max =          2

                                                F(24,343)         =       1.37
corr(u_i, Xb)  = -0.2301                        Prob > F          =     0.1158

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   -.545676   1.435945    -0.38   0.704    -3.370042     2.27869
                    sexo |   1.427475   11.07659     0.13   0.898    -20.35911    23.21406
                         |
                edad_gr2 |
                  25-29  |  -7.234397   13.45654    -0.54   0.591    -33.70213    19.23334
                  30-34  |   24.29199   20.35942     1.19   0.234    -15.75305    64.33703
                  35-39  |   29.70889    20.4995     1.45   0.148    -10.61166    70.02944
                  40-44  |    24.9275   26.07811     0.96   0.340    -26.36565    76.22066
                  45-54  |   31.30681   38.26568     0.82   0.414    -43.95813    106.5717
                  55-64  |   31.96935   40.72471     0.79   0.433    -48.13225    112.0709
                    65+  |   31.42367   48.48683     0.65   0.517    -63.94528    126.7926
                         |
                educ_gr2 |
    Secundaria completa  |  -1.504445   15.96634    -0.09   0.925    -32.90871    29.89982
                Técnica  |   -25.2526    18.7604    -1.35   0.179    -62.15251    11.64732
           Preparatoria  |  -8.635924   18.33495    -0.47   0.638    -44.69902    27.42717
Licenciatura incompleta  |  -16.70709   18.91156    -0.88   0.378    -53.90432    20.49014
  Licenciatura completa  |   -13.5868   19.02331    -0.71   0.476    -51.00383    23.83023
               Posgrado  |  -14.47664   23.57934    -0.61   0.540    -60.85495    31.90168
                   Otro  |          0  (omitted)
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -15.32664   11.18456    -1.37   0.171     -37.3256    6.672323
          5,001 a 8 mil  |   4.980271   10.40507     0.48   0.633     -15.4855    25.44604
         8,001 a 10 mil  |   11.01158   10.51365     1.05   0.296     -9.66776    31.69093
        10,001 a 15 mil  |   10.97122   10.40977     1.05   0.293    -9.503811    31.44624
        15,001 a 20 mil  |   17.79563   10.67883     1.67   0.097    -3.208606    38.79986
        20,001 a 49,999  |   16.57359   10.73412     1.54   0.124    -4.539393    37.68658
                50 mil+  |   22.19037   12.47223     1.78   0.076     -2.34132    46.72206
                  No sé  |   11.59677   11.86456     0.98   0.329    -11.73968    34.93322
                         |
                 singles |  -1.166373   6.629404    -0.18   0.860    -14.20578    11.87303
                   _cons |   35.25386   29.47308     1.20   0.232    -22.71686    93.22459
-------------------------+----------------------------------------------------------------
                 sigma_u |  46.257537
                 sigma_e |   18.80232
                     rho |  .85820837   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
F test that all u_i=0: F(973, 343) = 7.39                    Prob > F = 0.0000
resultados/encuesta/modelos1_3a1.rtf
resultados/encuesta/modelos1_3a1.xml
dir : seeout

Random-effects GLS regression                   Number of obs     =      1,341
Group variable: id_num                          Number of groups  =        974

R-sq:                                           Obs per group:
     within  = 0.0332                                         min =          1
     between = 0.0821                                         avg =        1.4
     overall = 0.0835                                         max =          2

                                                Wald chi2(25)     =      96.97
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   -1.50479   1.317247    -1.14   0.253    -4.086547    1.076968
                    sexo |  -2.635153   2.786209    -0.95   0.344    -8.096023    2.825716
                         |
                edad_gr2 |
                  25-29  |  -5.365202   5.891362    -0.91   0.362    -16.91206    6.181656
                  30-34  |  -2.855724   5.976821    -0.48   0.633    -14.57008    8.858629
                  35-39  |   1.132989    6.08295     0.19   0.852    -10.78937    13.05535
                  40-44  |   7.310763   6.429742     1.14   0.256    -5.291299    19.91283
                  45-54  |   5.674765   5.942173     0.95   0.340     -5.97168    17.32121
                  55-64  |   14.26583   6.403233     2.23   0.026     1.715728    26.81594
                    65+  |   22.89251   11.55062     1.98   0.047     .2537091    45.53132
                         |
                educ_gr2 |
    Secundaria completa  |  -48.83167   15.28134    -3.20   0.001    -78.78255   -18.88079
                Técnica  |  -59.35007   15.24869    -3.89   0.000    -89.23695   -29.46318
           Preparatoria  |  -54.90295   15.07368    -3.64   0.000    -84.44682   -25.35908
Licenciatura incompleta  |  -56.70879   15.24167    -3.72   0.000    -86.58192   -26.83566
  Licenciatura completa  |  -52.27854   15.14079    -3.45   0.001    -81.95394   -22.60314
               Posgrado  |  -54.96848   16.31175    -3.37   0.001    -86.93892   -22.99805
                   Otro  |  -32.96289   19.15001    -1.72   0.085    -70.49623    4.570444
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -3.927975   7.194882    -0.55   0.585    -18.02968    10.17374
          5,001 a 8 mil  |   2.010382    6.63381     0.30   0.762    -10.99165    15.01241
         8,001 a 10 mil  |   6.181403   6.599748     0.94   0.349    -6.753865    19.11667
        10,001 a 15 mil  |   4.748736   6.386034     0.74   0.457     -7.76766    17.26513
        15,001 a 20 mil  |   9.537406   6.514308     1.46   0.143    -3.230403    22.30521
        20,001 a 49,999  |    9.36149    6.51122     1.44   0.151    -3.400267    22.12325
                50 mil+  |   27.66942     7.8767     3.51   0.000     12.23137    43.10746
                  No sé  |    1.55131   7.621336     0.20   0.839    -13.38623    16.48885
                         |
                 singles |  -13.92875   4.053525    -3.44   0.001    -21.87352   -5.983991
                   _cons |   102.1007   16.09824     6.34   0.000     70.54871    133.6526
-------------------------+----------------------------------------------------------------
                 sigma_u |  40.020859
                 sigma_e |   18.80232
                     rho |  .81918582   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a1.rtf
resultados/encuesta/modelos1_3a1.xml
dir : seeout

Breusch and Pagan Lagrangian multiplier test for random effects

        consumo_semanal[id_num,t] = Xb + u[id_num] + e[id_num,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
               consumo~l |   2190.805       46.80603
                       e |   353.5272       18.80232
                       u |   1601.669       40.02086

        Test:   Var(u) = 0
                             chibar2(01) =   289.51
                          Prob > chibar2 =   0.0000

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        random       Difference          S.E.
-------------+----------------------------------------------------------------
     tax2020 |    -.545676     -1.50479        .9591135          .59744
        sexo |    1.427475    -2.635153        4.062628        10.80376
    edad_gr2 |
          2  |   -7.234397    -5.365202       -1.869195        12.20726
          3  |    24.29199    -2.855724        27.14771         19.6174
          4  |    29.70889     1.132989         28.5759        19.73245
          5  |     24.9275     7.310763        17.61674        25.46894
          6  |    31.30681     5.674765        25.63204        38.08353
          7  |    31.96935     14.26583        17.70351        40.51842
          8  |    31.42367     22.89251         8.53116        47.45439
    educ_gr2 |
          2  |   -1.504445    -48.83167        47.32723        5.013065
          3  |    -25.2526    -59.35007        34.09747        11.16129
          4  |   -8.635924    -54.90295        46.26703         10.6709
          5  |   -16.70709    -56.70879         40.0017        11.42655
          6  |    -13.5868    -52.27854        38.69174        11.74446
          7  |   -14.47664    -54.96848        40.49185        17.26381
     gr_ingr |
          2  |   -15.32664    -3.927975       -11.39867        8.669289
          3  |    4.980271     2.010382        2.969889        8.114215
          4  |    11.01158     6.181403        4.830182        8.282262
          5  |    10.97122     4.748736        6.222479          8.3166
          6  |    17.79563     9.537406        8.258223        8.559674
          7  |    16.57359      9.36149        7.212102        8.631887
          8  |    22.19037     27.66942       -5.479048         9.78713
         99  |    11.59677      1.55131        10.04546        9.205462
     singles |   -1.166373    -13.92875        12.76238         5.30663
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                 chi2(24) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =   -75.15    chi2<0 ==> model fitted on these
                                        data fails to meet the asymptotic
                                        assumptions of the Hausman test;
                                        see suest for a generalized test

Random-effects GLS regression                   Number of obs     =        840
Group variable: id_num                          Number of groups  =        473

R-sq:                                           Obs per group:
     within  = 0.0481                                         min =          1
     between = 0.0891                                         avg =        1.8
     overall = 0.0898                                         max =          2

                                                Wald chi2(25)     =      62.42
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.5497766   1.398085    -0.39   0.694    -3.289972    2.190419
                    sexo |  -.9399772   3.826078    -0.25   0.806    -8.438953    6.558998
                         |
                edad_gr2 |
                  25-29  |  -9.476806    8.83714    -1.07   0.284    -26.79728    7.843669
                  30-34  |  -6.706275   9.302569    -0.72   0.471    -24.93898    11.52643
                  35-39  |   .1132684   9.207761     0.01   0.990    -17.93361    18.16015
                  40-44  |  -5.176509   9.701217    -0.53   0.594    -24.19055    13.83753
                  45-54  |   3.028759   9.159245     0.33   0.741    -14.92303    20.98055
                  55-64  |   14.23987    9.50585     1.50   0.134    -4.391251      32.871
                    65+  |   28.71149   15.94743     1.80   0.072     -2.54489    59.96787
                         |
                educ_gr2 |
    Secundaria completa  |  -42.08626   30.57402    -1.38   0.169    -102.0102    17.83771
                Técnica  |  -57.18395   30.52467    -1.87   0.061    -117.0112    2.643304
           Preparatoria  |  -51.03809   30.37554    -1.68   0.093    -110.5731    8.496878
Licenciatura incompleta  |  -52.62085   30.53507    -1.72   0.085    -112.4685    7.226794
  Licenciatura completa  |  -49.94039   30.40739    -1.64   0.101    -109.5378    9.656998
               Posgrado  |  -46.78483   31.28427    -1.50   0.135    -108.1009    14.53122
                   Otro  |  -35.84251   34.03994    -1.05   0.292    -102.5596    30.87454
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -16.74722   9.370282    -1.79   0.074    -35.11263    1.618199
          5,001 a 8 mil  |  -5.311497   8.524116    -0.62   0.533    -22.01846    11.39546
         8,001 a 10 mil  |   1.316611   8.477319     0.16   0.877    -15.29863    17.93185
        10,001 a 15 mil  |  -1.649133   8.249618    -0.20   0.842    -17.81809    14.51982
        15,001 a 20 mil  |   4.337747   8.417619     0.52   0.606    -12.16048    20.83598
        20,001 a 49,999  |   2.254849   8.383372     0.27   0.788    -14.17626    18.68595
                50 mil+  |   24.36529   9.679725     2.52   0.012     5.393374     43.3372
                  No sé  |  -3.949031   9.507864    -0.42   0.678     -22.5841    14.68604
                         |
                 singles |  -9.122566   5.376441    -1.70   0.090     -19.6602    1.415065
                   _cons |   104.8795   32.31509     3.25   0.001     41.54304    168.2159
-------------------------+----------------------------------------------------------------
                 sigma_u |  39.957156
                 sigma_e |   18.80232
                     rho |  .81871343   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a1.rtf
resultados/encuesta/modelos1_3a1.xml
dir : seeout
note: 1.tax2020#0b.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity
note: 1.tax2020#0b.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       840
-------------+----------------------------------   F(27, 812)      =      3.73
       Model |  205631.001        27    7615.963   Prob > F        =    0.0000
    Residual |  1660092.07       812  2044.44836   R-squared       =    0.1102
-------------+----------------------------------   Adj R-squared   =    0.0806
       Total |  1865723.07       839  2223.74621   Root MSE        =    45.216

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -1.172496   4.295716    -0.27   0.785    -9.604513    7.259522
                         |
            tax2020#sexo |
             0#Femenino  |    1.25054     6.3256     0.20   0.843    -11.16591    13.66699
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
         tax2020#singles |
             0#sueltos   |  -2.472407   13.96878    -0.18   0.860    -29.89158    24.94677
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -4.827424   4.523295    -1.07   0.286    -13.70615    4.051305
                         |
                edad_gr2 |
                  25-29  |  -2.796341   9.225077    -0.30   0.762    -20.90415    15.31147
                  30-34  |  -8.424315   8.809541    -0.96   0.339    -25.71647    8.867843
                  35-39  |   1.967785   8.725293     0.23   0.822      -15.159    19.09457
                  40-44  |  -5.333114    8.92622    -0.60   0.550     -22.8543    12.18807
                  45-54  |   2.831652   8.481635     0.33   0.739    -13.81686    19.48017
                  55-64  |    13.9908   8.708344     1.61   0.109    -3.102716    31.08432
                    65+  |   32.34483   14.14783     2.29   0.022     4.574197    60.11545
                         |
                educ_gr2 |
    Secundaria completa  |  -42.46753    23.3912    -1.82   0.070    -88.38188    3.446816
                Técnica  |   -49.0873   23.35277    -2.10   0.036    -94.92622   -3.248375
           Preparatoria  |  -52.77357   23.09516    -2.29   0.023    -98.10683   -7.440316
Licenciatura incompleta  |  -49.25137   23.43079    -2.10   0.036    -95.24343   -3.259316
  Licenciatura completa  |  -49.11875   23.16926    -2.12   0.034    -94.59745   -3.640046
               Posgrado  |  -47.87352   24.14428    -1.98   0.048    -95.26608   -.4809502
                   Otro  |  -26.81603   35.35954    -0.76   0.448    -96.22291    42.59085
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -14.48946   12.62779    -1.15   0.252    -39.27642     10.2975
          5,001 a 8 mil  |  -15.85805   10.98056    -1.44   0.149    -37.41169    5.695588
         8,001 a 10 mil  |  -7.545214   10.64533    -0.71   0.479    -28.44081    13.35039
        10,001 a 15 mil  |  -14.87722   10.16774    -1.46   0.144    -34.83536    5.080933
        15,001 a 20 mil  |  -8.775689   10.28531    -0.85   0.394    -28.96461    11.41324
        20,001 a 49,999  |  -10.93417    10.2123    -1.07   0.285    -30.97979    9.111447
                50 mil+  |   28.85796    11.7421     2.46   0.014     5.809508    51.90642
                  No sé  |  -22.29611    11.7245    -1.90   0.058       -45.31    .7177916
                         |
                 singles |  -18.61555   10.15734    -1.83   0.067    -38.55328    1.322175
                   _cons |   118.0697   26.16129     4.51   0.000     66.71797    169.4214
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_reg1.rtf
resultados/encuesta/modelos1_3a_reg1.xml
dir : seeout
note: 1.tax2020#0b.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       840
-------------+----------------------------------   F(26, 813)      =      3.87
       Model |  205566.954        26  7906.42131   Prob > F        =    0.0000
    Residual |  1660156.11       813  2042.01244   R-squared       =    0.1102
-------------+----------------------------------   Adj R-squared   =    0.0817
       Total |  1865723.07       839  2223.74621   Root MSE        =    45.189

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -1.013177   4.197848    -0.24   0.809    -9.253074     7.22672
                         |
            tax2020#sexo |
             0#Femenino  |   1.318055   6.310325     0.21   0.835    -11.06839    13.70451
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
                    sexo |  -4.858281    4.51724    -1.08   0.282    -13.72511    4.008548
                         |
                edad_gr2 |
                  25-29  |  -2.867032   9.210935    -0.31   0.756    -20.94705    15.21299
                  30-34  |  -8.443402   8.803631    -0.96   0.338    -25.72393    8.837124
                  35-39  |   1.924408   8.716653     0.22   0.825    -15.18539     19.0342
                  40-44  |  -5.359206   8.919684    -0.60   0.548    -22.86753    12.14912
                  45-54  |   2.813338    8.47595     0.33   0.740    -13.82399    19.45066
                  55-64  |   13.95484   8.700785     1.60   0.109    -3.123812    31.03349
                    65+  |   32.23227   14.12511     2.28   0.023     4.506294    59.95825
                         |
                educ_gr2 |
    Secundaria completa  |  -42.38947   23.37311    -1.81   0.070    -88.26822    3.489274
                Técnica  |  -49.04483   23.33763    -2.10   0.036    -94.85393   -3.235725
           Preparatoria  |    -52.784   23.08132    -2.29   0.022    -98.09001   -7.477987
Licenciatura incompleta  |  -49.25306   23.41683    -2.10   0.036    -95.21762   -3.288495
  Licenciatura completa  |   -49.1012   23.15524    -2.12   0.034    -94.55231   -3.650104
               Posgrado  |  -47.84359    24.1293    -1.98   0.048    -95.20666   -.4805137
                   Otro  |  -27.16369    35.2839    -0.77   0.442    -96.42197     42.0946
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -14.52802   12.61839    -1.15   0.250    -39.29647    10.24044
          5,001 a 8 mil  |  -15.86984   10.97382    -1.45   0.149    -37.41019    5.670521
         8,001 a 10 mil  |  -7.511246   10.63725    -0.71   0.480    -28.39096    13.36847
        10,001 a 15 mil  |  -14.93061   10.15721    -1.47   0.142    -34.86804    5.006833
        15,001 a 20 mil  |  -8.800376   10.27823    -0.86   0.392    -28.97538    11.37463
        20,001 a 49,999  |  -10.95481   10.20555    -1.07   0.283    -30.98714    9.077525
                50 mil+  |   28.80579   11.73141     2.46   0.014      5.77837    51.83321
                  No sé  |  -22.40374   11.70174    -1.91   0.056    -45.37292    .5654382
                         |
                 singles |  -19.89078   7.155464    -2.78   0.006    -33.93614   -5.845415
                   _cons |   118.0293   26.14471     4.51   0.000     66.71024    169.3484
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_reg1.rtf
resultados/encuesta/modelos1_3a_reg1.xml
dir : seeout
note: 1.tax2020#0b.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       840
-------------+----------------------------------   F(26, 813)      =      3.87
       Model |  205551.097        26  7905.81143   Prob > F        =    0.0000
    Residual |  1660171.97       813  2042.03194   R-squared       =    0.1102
-------------+----------------------------------   Adj R-squared   =    0.0817
       Total |  1865723.07       839  2223.74621   Root MSE        =    45.189

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -1.734216   3.219884    -0.54   0.590    -8.054482     4.58605
                         |
         tax2020#singles |
             0#sueltos   |  -2.638937   13.93512    -0.19   0.850    -29.99198    24.71411
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -4.222502     3.3293    -1.27   0.205    -10.75754    2.312536
                         |
                edad_gr2 |
                  25-29  |   -2.81701   9.219031    -0.31   0.760    -20.91292     15.2789
                  30-34  |  -8.443125   8.803819    -0.96   0.338    -25.72402     8.83777
                  35-39  |   1.938312   8.718862     0.22   0.824    -15.17582    19.05245
                  40-44  |  -5.356682   8.920147    -0.60   0.548    -22.86592    12.15255
                  45-54  |   2.813216   8.476109     0.33   0.740    -13.82442    19.45085
                  55-64  |   13.96947   8.702528     1.61   0.109    -3.112604    31.05154
                    65+  |   32.34743   14.13946     2.29   0.022     4.593276    60.10158
                         |
                educ_gr2 |
    Secundaria completa  |  -42.46891   23.37737    -1.82   0.070    -88.35603    3.418206
                Técnica  |  -49.05423   23.33837    -2.10   0.036     -94.8648   -3.243665
           Preparatoria  |   -52.7655   23.08147    -2.29   0.023    -98.07181   -7.459199
Licenciatura incompleta  |  -49.25237   23.41694    -2.10   0.036    -95.21715   -3.287582
  Licenciatura completa  |   -49.0982   23.15533    -2.12   0.034    -94.54948   -3.646925
               Posgrado  |  -47.90347   24.12953    -1.99   0.047      -95.267   -.5399439
                   Otro  |   -26.4198   35.28182    -0.75   0.454      -95.674     42.8344
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -14.58108   12.61182    -1.16   0.248    -39.33665     10.1745
          5,001 a 8 mil  |  -15.91557   10.97022    -1.45   0.147    -37.44886    5.617728
         8,001 a 10 mil  |  -7.579749    10.6376    -0.71   0.476    -28.46015    13.30065
        10,001 a 15 mil  |  -14.91603   10.15983    -1.47   0.142    -34.85863    5.026562
        15,001 a 20 mil  |  -8.850034   10.27235    -0.86   0.389     -29.0135    11.31343
        20,001 a 49,999  |  -10.98895   10.20251    -1.08   0.282     -31.0153    9.037411
                50 mil+  |   28.81044    11.7327     2.46   0.014     5.780477     51.8404
                  No sé  |  -22.33922   11.71554    -1.91   0.057    -45.33549    .6570481
                         |
                 singles |  -18.54382   10.14485    -1.83   0.068      -38.457    1.369372
                   _cons |   118.4199   26.08583     4.54   0.000     67.21634    169.6234
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_reg1.rtf
resultados/encuesta/modelos1_3a_reg1.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        840
Group variable: id_num                          Number of groups  =        473

R-sq:                                           Obs per group:
     within  = 0.0496                                         min =          1
     between = 0.0888                                         avg =        1.8
     overall = 0.0897                                         max =          2

                                                Wald chi2(27)     =      62.74
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0001

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   .3147604    1.93041     0.16   0.870    -3.468774    4.098295
                         |
            tax2020#sexo |
             0#Femenino  |   1.904094   2.859725     0.67   0.506    -3.700865    7.509052
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
         tax2020#singles |
             0#sueltos   |    .470016   7.172126     0.07   0.948    -13.58709    14.52712
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -1.832606   4.058587    -0.45   0.652    -9.787291    6.122079
                         |
                edad_gr2 |
                  25-29  |  -9.057639   8.877574    -1.02   0.308    -26.45737    8.342086
                  30-34  |  -6.552894   9.314748    -0.70   0.482    -24.80946    11.70368
                  35-39  |   .5031938    9.23795     0.05   0.957    -17.60285    18.60924
                  40-44  |  -4.950073   9.720471    -0.51   0.611    -24.00185     14.1017
                  45-54  |   3.277827   9.175935     0.36   0.721    -14.70668    21.26233
                  55-64  |   14.53213   9.526748     1.53   0.127    -4.139957    33.20421
                    65+  |   28.71797   15.96491     1.80   0.072    -2.572685    60.00863
                         |
                educ_gr2 |
    Secundaria completa  |  -42.08478   30.60567    -1.38   0.169    -102.0708    17.90123
                Técnica  |  -57.28935   30.55682    -1.87   0.061    -117.1796    2.600914
           Preparatoria  |  -51.08162   30.40718    -1.68   0.093    -110.6786    8.515355
Licenciatura incompleta  |  -52.61808   30.56861    -1.72   0.085    -112.5315    7.295308
  Licenciatura completa  |  -50.05972   30.43941    -1.64   0.100    -109.7199    9.600441
               Posgrado  |   -46.5352   31.31884    -1.49   0.137     -107.919    14.84861
                   Otro  |  -36.84972   34.15028    -1.08   0.281     -103.783    30.08359
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -16.28519   9.404374    -1.73   0.083    -34.71742    2.147043
          5,001 a 8 mil  |  -4.934812   8.553514    -0.58   0.564    -21.69939    11.82977
         8,001 a 10 mil  |   1.632169   8.498335     0.19   0.848    -15.02426     18.2886
        10,001 a 15 mil  |  -1.306357   8.282483    -0.16   0.875    -17.53973    14.92701
        15,001 a 20 mil  |   4.775111   8.462131     0.56   0.573    -11.81036    21.36058
        20,001 a 49,999  |   2.691403   8.418044     0.32   0.749    -13.80766    19.19047
                50 mil+  |   24.66395   9.706683     2.54   0.011     5.639197     43.6887
                  No sé  |  -3.661197   9.535719    -0.38   0.701    -22.35086    15.02847
                         |
                 singles |   -9.28243   6.495152    -1.43   0.153    -22.01269    3.447834
                   _cons |    103.829   32.38769     3.21   0.001     40.35026    167.3077
-------------------------+----------------------------------------------------------------
                 sigma_u |  40.036897
                 sigma_e |  18.836013
                     rho |  .81877376   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_xtreg1.rtf
resultados/encuesta/modelos1_3a_xtreg1.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        840
Group variable: id_num                          Number of groups  =        473

R-sq:                                           Obs per group:
     within  = 0.0496                                         min =          1
     between = 0.0888                                         avg =        1.8
     overall = 0.0897                                         max =          2

                                                Wald chi2(26)     =      62.81
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0001

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |    .287567   1.882765     0.15   0.879    -3.402585    3.977719
                         |
            tax2020#sexo |
             0#Femenino  |   1.893853   2.852882     0.66   0.507    -3.697692    7.485398
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
                    sexo |  -1.827833   4.056103    -0.45   0.652     -9.77765    6.121984
                         |
                edad_gr2 |
                  25-29  |  -9.036852   8.865202    -1.02   0.308    -26.41233    8.338624
                  30-34  |  -6.547208   9.309468    -0.70   0.482    -24.79343    11.69901
                  35-39  |   .5158222   9.231383     0.06   0.955    -17.57736      18.609
                  40-44  |  -4.932788   9.712427    -0.51   0.612    -23.96879    14.10322
                  45-54  |    3.28008   9.170999     0.36   0.721    -14.69475    21.25491
                  55-64  |   14.54162   9.520888     1.53   0.127    -4.118977    33.20222
                    65+  |   28.73145   15.95464     1.80   0.072    -2.539073    60.00197
                         |
                educ_gr2 |
    Secundaria completa  |  -42.08308   30.59244    -1.38   0.169    -102.0432    17.87699
                Técnica  |  -57.29788    30.5435    -1.88   0.061     -117.162    2.566283
           Preparatoria  |  -51.08474   30.39402    -1.68   0.093    -110.6559    8.486441
Licenciatura incompleta  |  -52.59656   30.55346    -1.72   0.085    -112.4802    7.287122
  Licenciatura completa  |   -50.0582   30.42628    -1.65   0.100    -109.6926    9.576217
               Posgrado  |  -46.53556   31.30512    -1.49   0.137    -107.8925    14.82135
                   Otro  |  -36.73083   34.08306    -1.08   0.281    -103.5324    30.07075
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -16.28857   9.397365    -1.73   0.083    -34.70706    2.129931
          5,001 a 8 mil  |  -4.918641   8.545615    -0.58   0.565    -21.66774    11.83046
         8,001 a 10 mil  |   1.637386   8.492316     0.19   0.847    -15.00725    18.28202
        10,001 a 15 mil  |  -1.277876   8.269526    -0.15   0.877    -17.48585     14.9301
        15,001 a 20 mil  |   4.805953   8.447896     0.57   0.569    -11.75162    21.36352
        20,001 a 49,999  |   2.704784   8.411534     0.32   0.748    -13.78152    19.19109
                50 mil+  |   24.68517    9.69403     2.55   0.011      5.68522    43.68512
                  No sé  |  -3.628516   9.521344    -0.38   0.703    -22.29001    15.03298
                         |
                 singles |  -9.040475   5.378668    -1.68   0.093    -19.58247     1.50152
                   _cons |   103.8125   32.37277     3.21   0.001     40.36303     167.262
-------------------------+----------------------------------------------------------------
                 sigma_u |  40.003572
                 sigma_e |  18.811505
                     rho |  .81891298   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_xtreg1.rtf
resultados/encuesta/modelos1_3a_xtreg1.xml
dir : seeout
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        840
Group variable: id_num                          Number of groups  =        473

R-sq:                                           Obs per group:
     within  = 0.0481                                         min =          1
     between = 0.0891                                         avg =        1.8
     overall = 0.0898                                         max =          2

                                                Wald chi2(26)     =      62.35
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0001

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.5401492   1.441897    -0.37   0.708    -3.366216    2.285917
                         |
         tax2020#singles |
             0#sueltos   |   .2018829   7.160571     0.03   0.978    -13.83258    14.23634
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -.9409514   3.828077    -0.25   0.806    -8.443845    6.561942
                         |
                edad_gr2 |
                  25-29  |  -9.485244   8.851066    -1.07   0.284    -26.83301    7.862527
                  30-34  |  -6.710641   9.307914    -0.72   0.471    -24.95382    11.53254
                  35-39  |   .1060201   9.214976     0.01   0.991      -17.955    18.16704
                  40-44  |  -5.185472   9.709749    -0.53   0.593    -24.21623    13.84529
                  45-54  |   3.025989   9.164192     0.33   0.741     -14.9355    20.98748
                  55-64  |   14.23434   9.512048     1.50   0.135     -4.40893    32.87761
                    65+  |   28.70665    15.9577     1.80   0.072    -2.569872    59.98317
                         |
                educ_gr2 |
    Secundaria completa  |  -42.08745   30.58711    -1.38   0.169    -102.0371    17.86219
                Técnica  |   -57.1781   30.53788    -1.87   0.061    -117.0312    2.675037
           Preparatoria  |  -51.03746   30.38857    -1.68   0.093     -110.598    8.523043
Licenciatura incompleta  |  -52.62959    30.5501    -1.72   0.085    -112.5067    7.247512
  Licenciatura completa  |  -49.94064   30.42037    -1.64   0.101    -109.5635    9.682197
               Posgrado  |  -46.78497   31.29786    -1.49   0.135    -108.1277    14.55771
                   Otro  |  -35.89028   34.10297    -1.05   0.293    -102.7309    30.95032
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -16.74681   9.377179    -1.79   0.074    -35.12574    1.632126
          5,001 a 8 mil  |  -5.322033    8.53277    -0.62   0.533    -22.04595    11.40189
         8,001 a 10 mil  |   1.311133   8.483449     0.15   0.877    -15.31612    17.93839
        10,001 a 15 mil  |  -1.665599   8.263923    -0.20   0.840    -17.86259    14.53139
        15,001 a 20 mil  |   4.319869   8.433684     0.51   0.608    -12.20985    20.84959
        20,001 a 49,999  |   2.244385   8.390455     0.27   0.789    -14.20061    18.68937
                50 mil+  |   24.35614   9.693379     2.51   0.012     5.357469    43.35482
                  No sé  |  -3.968235   9.523344    -0.42   0.677    -22.63365    14.69718
                         |
                 singles |  -9.228889   6.493709    -1.42   0.155    -21.95633    3.498548
                   _cons |   104.8933   32.33034     3.24   0.001     41.52705    168.2596
-------------------------+----------------------------------------------------------------
                 sigma_u |  39.991041
                 sigma_e |  18.827377
                     rho |  .81856968   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_xtreg1.rtf
resultados/encuesta/modelos1_3a_xtreg1.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        840
Group variable: id_num                          Number of groups  =        473

R-sq:                                           Obs per group:
     within  = 0.0496                                         min =          1
     between = 0.0888                                         avg =        1.8
     overall = 0.0897                                         max =          2

                                                Wald chi2(27)     =      62.74
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0001

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   .3147604    1.93041     0.16   0.870    -3.468774    4.098295
                         |
            tax2020#sexo |
             0#Femenino  |   1.904094   2.859725     0.67   0.506    -3.700865    7.509052
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
         tax2020#singles |
             0#sueltos   |    .470016   7.172126     0.07   0.948    -13.58709    14.52712
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -1.832606   4.058587    -0.45   0.652    -9.787291    6.122079
                         |
                edad_gr2 |
                  25-29  |  -9.057639   8.877574    -1.02   0.308    -26.45737    8.342086
                  30-34  |  -6.552894   9.314748    -0.70   0.482    -24.80946    11.70368
                  35-39  |   .5031938    9.23795     0.05   0.957    -17.60285    18.60924
                  40-44  |  -4.950073   9.720471    -0.51   0.611    -24.00185     14.1017
                  45-54  |   3.277827   9.175935     0.36   0.721    -14.70668    21.26233
                  55-64  |   14.53213   9.526748     1.53   0.127    -4.139957    33.20421
                    65+  |   28.71797   15.96491     1.80   0.072    -2.572685    60.00863
                         |
                educ_gr2 |
    Secundaria completa  |  -42.08478   30.60567    -1.38   0.169    -102.0708    17.90123
                Técnica  |  -57.28935   30.55682    -1.87   0.061    -117.1796    2.600914
           Preparatoria  |  -51.08162   30.40718    -1.68   0.093    -110.6786    8.515355
Licenciatura incompleta  |  -52.61808   30.56861    -1.72   0.085    -112.5315    7.295308
  Licenciatura completa  |  -50.05972   30.43941    -1.64   0.100    -109.7199    9.600441
               Posgrado  |   -46.5352   31.31884    -1.49   0.137     -107.919    14.84861
                   Otro  |  -36.84972   34.15028    -1.08   0.281     -103.783    30.08359
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -16.28519   9.404374    -1.73   0.083    -34.71742    2.147043
          5,001 a 8 mil  |  -4.934812   8.553514    -0.58   0.564    -21.69939    11.82977
         8,001 a 10 mil  |   1.632169   8.498335     0.19   0.848    -15.02426     18.2886
        10,001 a 15 mil  |  -1.306357   8.282483    -0.16   0.875    -17.53973    14.92701
        15,001 a 20 mil  |   4.775111   8.462131     0.56   0.573    -11.81036    21.36058
        20,001 a 49,999  |   2.691403   8.418044     0.32   0.749    -13.80766    19.19047
                50 mil+  |   24.66395   9.706683     2.54   0.011     5.639197     43.6887
                  No sé  |  -3.661197   9.535719    -0.38   0.701    -22.35086    15.02847
                         |
                 singles |   -9.28243   6.495152    -1.43   0.153    -22.01269    3.447834
                   _cons |    103.829   32.38769     3.21   0.001     40.35026    167.3077
-------------------------+----------------------------------------------------------------
                 sigma_u |  40.036897
                 sigma_e |  18.836013
                     rho |  .81877376   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/bal_mod1_3a_xtreg1.rtf
resultados/encuesta/bal_mod1_3a_xtreg1.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        840
Group variable: id_num                          Number of groups  =        473

R-sq:                                           Obs per group:
     within  = 0.0496                                         min =          1
     between = 0.0888                                         avg =        1.8
     overall = 0.0897                                         max =          2

                                                Wald chi2(26)     =      62.81
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0001

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |    .287567   1.882765     0.15   0.879    -3.402585    3.977719
                         |
            tax2020#sexo |
             0#Femenino  |   1.893853   2.852882     0.66   0.507    -3.697692    7.485398
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
                    sexo |  -1.827833   4.056103    -0.45   0.652     -9.77765    6.121984
                         |
                edad_gr2 |
                  25-29  |  -9.036852   8.865202    -1.02   0.308    -26.41233    8.338624
                  30-34  |  -6.547208   9.309468    -0.70   0.482    -24.79343    11.69901
                  35-39  |   .5158222   9.231383     0.06   0.955    -17.57736      18.609
                  40-44  |  -4.932788   9.712427    -0.51   0.612    -23.96879    14.10322
                  45-54  |    3.28008   9.170999     0.36   0.721    -14.69475    21.25491
                  55-64  |   14.54162   9.520888     1.53   0.127    -4.118977    33.20222
                    65+  |   28.73145   15.95464     1.80   0.072    -2.539073    60.00197
                         |
                educ_gr2 |
    Secundaria completa  |  -42.08308   30.59244    -1.38   0.169    -102.0432    17.87699
                Técnica  |  -57.29788    30.5435    -1.88   0.061     -117.162    2.566283
           Preparatoria  |  -51.08474   30.39402    -1.68   0.093    -110.6559    8.486441
Licenciatura incompleta  |  -52.59656   30.55346    -1.72   0.085    -112.4802    7.287122
  Licenciatura completa  |   -50.0582   30.42628    -1.65   0.100    -109.6926    9.576217
               Posgrado  |  -46.53556   31.30512    -1.49   0.137    -107.8925    14.82135
                   Otro  |  -36.73083   34.08306    -1.08   0.281    -103.5324    30.07075
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -16.28857   9.397365    -1.73   0.083    -34.70706    2.129931
          5,001 a 8 mil  |  -4.918641   8.545615    -0.58   0.565    -21.66774    11.83046
         8,001 a 10 mil  |   1.637386   8.492316     0.19   0.847    -15.00725    18.28202
        10,001 a 15 mil  |  -1.277876   8.269526    -0.15   0.877    -17.48585     14.9301
        15,001 a 20 mil  |   4.805953   8.447896     0.57   0.569    -11.75162    21.36352
        20,001 a 49,999  |   2.704784   8.411534     0.32   0.748    -13.78152    19.19109
                50 mil+  |   24.68517    9.69403     2.55   0.011      5.68522    43.68512
                  No sé  |  -3.628516   9.521344    -0.38   0.703    -22.29001    15.03298
                         |
                 singles |  -9.040475   5.378668    -1.68   0.093    -19.58247     1.50152
                   _cons |   103.8125   32.37277     3.21   0.001     40.36303     167.262
-------------------------+----------------------------------------------------------------
                 sigma_u |  40.003572
                 sigma_e |  18.811505
                     rho |  .81891298   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/bal_mod1_3a_xtreg1.rtf
resultados/encuesta/bal_mod1_3a_xtreg1.xml
dir : seeout
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        840
Group variable: id_num                          Number of groups  =        473

R-sq:                                           Obs per group:
     within  = 0.0481                                         min =          1
     between = 0.0891                                         avg =        1.8
     overall = 0.0898                                         max =          2

                                                Wald chi2(26)     =      62.35
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0001

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.5401492   1.441897    -0.37   0.708    -3.366216    2.285917
                         |
         tax2020#singles |
             0#sueltos   |   .2018829   7.160571     0.03   0.978    -13.83258    14.23634
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -.9409514   3.828077    -0.25   0.806    -8.443845    6.561942
                         |
                edad_gr2 |
                  25-29  |  -9.485244   8.851066    -1.07   0.284    -26.83301    7.862527
                  30-34  |  -6.710641   9.307914    -0.72   0.471    -24.95382    11.53254
                  35-39  |   .1060201   9.214976     0.01   0.991      -17.955    18.16704
                  40-44  |  -5.185472   9.709749    -0.53   0.593    -24.21623    13.84529
                  45-54  |   3.025989   9.164192     0.33   0.741     -14.9355    20.98748
                  55-64  |   14.23434   9.512048     1.50   0.135     -4.40893    32.87761
                    65+  |   28.70665    15.9577     1.80   0.072    -2.569872    59.98317
                         |
                educ_gr2 |
    Secundaria completa  |  -42.08745   30.58711    -1.38   0.169    -102.0371    17.86219
                Técnica  |   -57.1781   30.53788    -1.87   0.061    -117.0312    2.675037
           Preparatoria  |  -51.03746   30.38857    -1.68   0.093     -110.598    8.523043
Licenciatura incompleta  |  -52.62959    30.5501    -1.72   0.085    -112.5067    7.247512
  Licenciatura completa  |  -49.94064   30.42037    -1.64   0.101    -109.5635    9.682197
               Posgrado  |  -46.78497   31.29786    -1.49   0.135    -108.1277    14.55771
                   Otro  |  -35.89028   34.10297    -1.05   0.293    -102.7309    30.95032
                         |
                 gr_ingr |
          3,001 a 5 mil  |  -16.74681   9.377179    -1.79   0.074    -35.12574    1.632126
          5,001 a 8 mil  |  -5.322033    8.53277    -0.62   0.533    -22.04595    11.40189
         8,001 a 10 mil  |   1.311133   8.483449     0.15   0.877    -15.31612    17.93839
        10,001 a 15 mil  |  -1.665599   8.263923    -0.20   0.840    -17.86259    14.53139
        15,001 a 20 mil  |   4.319869   8.433684     0.51   0.608    -12.20985    20.84959
        20,001 a 49,999  |   2.244385   8.390455     0.27   0.789    -14.20061    18.68937
                50 mil+  |   24.35614   9.693379     2.51   0.012     5.357469    43.35482
                  No sé  |  -3.968235   9.523344    -0.42   0.677    -22.63365    14.69718
                         |
                 singles |  -9.228889   6.493709    -1.42   0.155    -21.95633    3.498548
                   _cons |   104.8933   32.33034     3.24   0.001     41.52705    168.2596
-------------------------+----------------------------------------------------------------
                 sigma_u |  39.991041
                 sigma_e |  18.827377
                     rho |  .81856968   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/bal_mod1_3a_xtreg1.rtf
resultados/encuesta/bal_mod1_3a_xtreg1.xml
dir : seeout

      Source |       SS           df       MS      Number of obs   =       654
-------------+----------------------------------   F(25, 628)      =      6.26
       Model |  16031.3505        25  641.254019   Prob > F        =    0.0000
    Residual |  64375.1159       628  102.508146   R-squared       =    0.1994
-------------+----------------------------------   Adj R-squared   =    0.1675
       Total |  80406.4664       653  123.133945   Root MSE        =    10.125

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.4726885   .7974779    -0.59   0.554    -2.038735    1.093358
                    sexo |  -1.595146    .830065    -1.92   0.055    -3.225185    .0348927
                         |
                edad_gr2 |
                  25-29  |   1.737537     1.6112     1.08   0.281    -1.426455    4.901529
                  30-34  |   4.178043    1.61899     2.58   0.010     .9987548    7.357332
                  35-39  |   1.716246   1.613315     1.06   0.288      -1.4519    4.884391
                  40-44  |   .3579175   1.784299     0.20   0.841    -3.145996    3.861831
                  45-54  |   4.893375   1.593887     3.07   0.002     1.763381     8.02337
                  55-64  |   2.882528   1.978635     1.46   0.146    -1.003013    6.768069
                    65+  |   3.274889   5.354821     0.61   0.541    -7.240634    13.79041
                         |
                educ_gr2 |
    Secundaria completa  |   3.082527   5.411193     0.57   0.569    -7.543696    13.70875
                Técnica  |   .1486872   5.323172     0.03   0.978    -10.30468    10.60206
           Preparatoria  |   2.122897   5.283022     0.40   0.688     -8.25163    12.49742
Licenciatura incompleta  |   .9650052   5.328347     0.18   0.856     -9.49853    11.42854
  Licenciatura completa  |   5.598574   5.299764     1.06   0.291    -4.808831    16.00598
               Posgrado  |   9.765881   5.610843     1.74   0.082    -1.252404    20.78417
                   Otro  |  -1.834609    7.90672    -0.23   0.817    -17.36142     13.6922
                         |
                 gr_ingr |
          3,001 a 5 mil  |   8.410882   2.514559     3.34   0.001     3.472919    13.34884
          5,001 a 8 mil  |  -1.045896    2.28953    -0.46   0.648    -5.541957    3.450165
         8,001 a 10 mil  |  -1.530914   2.204678    -0.69   0.488    -5.860348     2.79852
        10,001 a 15 mil  |   1.603865   2.137702     0.75   0.453    -2.594043    5.801774
        15,001 a 20 mil  |   2.023112   2.159732     0.94   0.349    -2.218058    6.264282
        20,001 a 49,999  |   .6000186   2.178747     0.28   0.783    -3.678493     4.87853
                50 mil+  |   1.365943   2.899011     0.47   0.638    -4.326987    7.058873
                  No sé  |  -.9973484    2.58393    -0.39   0.700    -6.071538    4.076841
                         |
                 singles |  -6.492843   .9540013    -6.81   0.000    -8.366262   -4.619425
                   _cons |   6.860071   5.422441     1.27   0.206     -3.78824    17.50838
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a0.rtf
resultados/encuesta/modelos1_3a0.xml
dir : seeout
note: 9.educ_gr2 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0674                                         min =          1
     between = 0.0172                                         avg =        1.7
     overall = 0.0203                                         max =          2

                                                F(24,250)         =       0.75
corr(u_i, Xb)  = -0.1533                        Prob > F          =     0.7937

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   .2835515   .4996476     0.57   0.571    -.7005036    1.267607
                    sexo |  -.1926282   3.330298    -0.06   0.954    -6.751645    6.366388
                         |
                edad_gr2 |
                  25-29  |  -2.504382   3.117964    -0.80   0.423    -8.645207    3.636444
                  30-34  |  -.2356185   4.361038    -0.05   0.957    -8.824676    8.353439
                  35-39  |   3.173432   5.584409     0.57   0.570    -7.825053    14.17192
                  40-44  |  -2.554455   6.994934    -0.37   0.715    -16.33097    11.22206
                  45-54  |  -2.409158   7.193731    -0.33   0.738     -16.5772    11.75888
                  55-64  |  -5.469665   9.536142    -0.57   0.567    -24.25108    13.31175
                    65+  |   .5605887   9.526098     0.06   0.953    -18.20105    19.32222
                         |
                educ_gr2 |
    Secundaria completa  |   3.577474   6.620277     0.54   0.589    -9.461151     16.6161
                Técnica  |   2.107027    4.60618     0.46   0.648    -6.964838    11.17889
           Preparatoria  |   .7035823   4.839347     0.15   0.885    -8.827505    10.23467
Licenciatura incompleta  |   .5114029   5.580598     0.09   0.927    -10.47958    11.50238
  Licenciatura completa  |   2.694638   5.982045     0.45   0.653     -9.08699    14.47627
               Posgrado  |   2.549076   7.698599     0.33   0.741     -12.6133    17.71145
                   Otro  |          0  (omitted)
                         |
                 gr_ingr |
          3,001 a 5 mil  |   2.495936   2.433847     1.03   0.306    -2.297522    7.289395
          5,001 a 8 mil  |  -.9798476   2.367444    -0.41   0.679    -5.642525     3.68283
         8,001 a 10 mil  |   -.637948   2.500914    -0.26   0.799    -5.563493    4.287597
        10,001 a 15 mil  |  -.4402131   2.450338    -0.18   0.858    -5.266151    4.385724
        15,001 a 20 mil  |    .096076   2.634514     0.04   0.971    -5.092595    5.284748
        20,001 a 49,999  |  -.2958107   2.849047    -0.10   0.917    -5.907004    5.315383
                50 mil+  |   4.168947   3.813457     1.09   0.275    -3.341651    11.67955
                  No sé  |   4.944051   4.461986     1.11   0.269    -3.843823    13.73192
                         |
                 singles |  -2.221341   1.138491    -1.95   0.052    -4.463597    .0209154
                   _cons |   10.48171   7.053277     1.49   0.139    -3.409703    24.37313
-------------------------+----------------------------------------------------------------
                 sigma_u |   11.32061
                 sigma_e |  5.4720619
                     rho |   .8106039   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
F test that all u_i=0: F(379, 250) = 5.01                    Prob > F = 0.0000
resultados/encuesta/modelos1_3a0.rtf
resultados/encuesta/modelos1_3a0.xml
dir : seeout

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0335                                         min =          1
     between = 0.1968                                         avg =        1.7
     overall = 0.1819                                         max =          2

                                                Wald chi2(25)     =      86.05
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |    .021005   .4657602     0.05   0.964    -.8918681    .9338782
                    sexo |  -2.240266   1.034984    -2.16   0.030    -4.268798   -.2117349
                         |
                edad_gr2 |
                  25-29  |    .399914    1.81992     0.22   0.826    -3.167065    3.966892
                  30-34  |   2.878407   1.894341     1.52   0.129     -.834434    6.591248
                  35-39  |   2.067687   1.942916     1.06   0.287    -1.740359    5.875733
                  40-44  |   .3407434   2.148306     0.16   0.874    -3.869858    4.551345
                  45-54  |   4.100094   1.937801     2.12   0.034     .3020736    7.898114
                  55-64  |   1.865466    2.44075     0.76   0.445    -2.918315    6.649247
                    65+  |   5.060149   4.910498     1.03   0.303     -4.56425    14.68455
                         |
                educ_gr2 |
    Secundaria completa  |   2.122592    7.42972     0.29   0.775    -12.43939    16.68458
                Técnica  |  -.3226487   7.327636    -0.04   0.965    -14.68455    14.03925
           Preparatoria  |   .4726874   7.289212     0.06   0.948    -13.81391    14.75928
Licenciatura incompleta  |   .4885547   7.325128     0.07   0.947    -13.86843    14.84554
  Licenciatura completa  |    4.56848   7.300356     0.63   0.531    -9.739955    18.87692
               Posgrado  |    7.00675   7.616088     0.92   0.358    -7.920509    21.93401
                   Otro  |  -3.149279   8.348947    -0.38   0.706    -19.51291    13.21436
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.093562   2.043994     2.49   0.013     1.087408    9.099716
          5,001 a 8 mil  |  -1.709488   1.954056    -0.87   0.382    -5.539367     2.12039
         8,001 a 10 mil  |  -1.156643   1.937983    -0.60   0.551    -4.955019    2.641734
        10,001 a 15 mil  |   .1164643    1.88742     0.06   0.951     -3.58281    3.815739
        15,001 a 20 mil  |   .9906742   1.960415     0.51   0.613    -2.851669    4.833017
        20,001 a 49,999  |  -.2331888   2.022773    -0.12   0.908     -4.19775    3.731373
                50 mil+  |   2.275002   2.707943     0.84   0.401    -3.032468    7.582472
                  No sé  |   .0360571   2.649829     0.01   0.989    -5.157513    5.229627
                         |
                 singles |  -4.323309    .880844    -4.91   0.000    -6.049732   -2.596887
                   _cons |   9.304811   7.407658     1.26   0.209    -5.213931    23.82355
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2128144
                 sigma_e |  5.4720619
                     rho |  .73921255   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a0.rtf
resultados/encuesta/modelos1_3a0.xml
dir : seeout

Breusch and Pagan Lagrangian multiplier test for random effects

        consumo_semanal[id_num,t] = Xb + u[id_num] + e[id_num,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
               consumo~l |   123.1339       11.09657
                       e |   29.94346       5.472062
                       u |   84.87595       9.212814

        Test:   Var(u) = 0
                             chibar2(01) =    62.51
                          Prob > chibar2 =   0.0000

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        random       Difference          S.E.
-------------+----------------------------------------------------------------
     tax2020 |    .2835515      .021005        .2625465        .1878344
        sexo |   -.1926282    -2.240266        2.047638         3.18335
    edad_gr2 |
          2  |   -2.504382      .399914       -2.904296         2.55138
          3  |   -.2356185     2.878407       -3.114025         3.95293
          4  |    3.173432     2.067687        1.105745        5.266053
          5  |   -2.554455     .3407434       -2.895198        6.694544
          6  |   -2.409158     4.100094       -6.509252        6.966113
          7  |   -5.469665     1.865466       -7.335131         9.26907
          8  |    .5605887     5.060149        -4.49956        8.219885
    educ_gr2 |
          2  |    3.577474     2.122592        1.454882               .
          3  |    2.107027    -.3226487        2.429676               .
          4  |    .7035823     .4726874        .2308949               .
          5  |    .5114029     .4885547        .0228483               .
          6  |    2.694638      4.56848       -1.873843               .
          7  |    2.549076      7.00675       -4.457674        1.368562
     gr_ingr |
          2  |    2.495936     5.093562       -2.597625          1.3441
          3  |   -.9798476    -1.709488        .7296407         1.35797
          4  |    -.637948    -1.156643        .5186946        1.600967
          5  |   -.4402131     .1164643       -.5566774        1.582256
          6  |     .096076     .9906742       -.8945982        1.780111
          7  |   -.2958107    -.2331888       -.0626219        2.027045
          8  |    4.168947     2.275002        1.893945         2.71275
         99  |    4.944051     .0360571        4.907994        3.618343
     singles |   -2.221341    -4.323309        2.101969          .73048
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                 chi2(24) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =       39.14
                Prob>chi2 =      0.0264
                (V_b-V_B is not positive definite)

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0335                                         min =          1
     between = 0.1968                                         avg =        1.7
     overall = 0.1819                                         max =          2

                                                Wald chi2(25)     =      86.05
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |    .021005   .4657602     0.05   0.964    -.8918681    .9338782
                    sexo |  -2.240266   1.034984    -2.16   0.030    -4.268798   -.2117349
                         |
                edad_gr2 |
                  25-29  |    .399914    1.81992     0.22   0.826    -3.167065    3.966892
                  30-34  |   2.878407   1.894341     1.52   0.129     -.834434    6.591248
                  35-39  |   2.067687   1.942916     1.06   0.287    -1.740359    5.875733
                  40-44  |   .3407434   2.148306     0.16   0.874    -3.869858    4.551345
                  45-54  |   4.100094   1.937801     2.12   0.034     .3020736    7.898114
                  55-64  |   1.865466    2.44075     0.76   0.445    -2.918315    6.649247
                    65+  |   5.060149   4.910498     1.03   0.303     -4.56425    14.68455
                         |
                educ_gr2 |
    Secundaria completa  |   2.122592    7.42972     0.29   0.775    -12.43939    16.68458
                Técnica  |  -.3226487   7.327636    -0.04   0.965    -14.68455    14.03925
           Preparatoria  |   .4726874   7.289212     0.06   0.948    -13.81391    14.75928
Licenciatura incompleta  |   .4885547   7.325128     0.07   0.947    -13.86843    14.84554
  Licenciatura completa  |    4.56848   7.300356     0.63   0.531    -9.739955    18.87692
               Posgrado  |    7.00675   7.616088     0.92   0.358    -7.920509    21.93401
                   Otro  |  -3.149279   8.348947    -0.38   0.706    -19.51291    13.21436
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.093562   2.043994     2.49   0.013     1.087408    9.099716
          5,001 a 8 mil  |  -1.709488   1.954056    -0.87   0.382    -5.539367     2.12039
         8,001 a 10 mil  |  -1.156643   1.937983    -0.60   0.551    -4.955019    2.641734
        10,001 a 15 mil  |   .1164643    1.88742     0.06   0.951     -3.58281    3.815739
        15,001 a 20 mil  |   .9906742   1.960415     0.51   0.613    -2.851669    4.833017
        20,001 a 49,999  |  -.2331888   2.022773    -0.12   0.908     -4.19775    3.731373
                50 mil+  |   2.275002   2.707943     0.84   0.401    -3.032468    7.582472
                  No sé  |   .0360571   2.649829     0.01   0.989    -5.157513    5.229627
                         |
                 singles |  -4.323309    .880844    -4.91   0.000    -6.049732   -2.596887
                   _cons |   9.304811   7.407658     1.26   0.209    -5.213931    23.82355
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2128144
                 sigma_e |  5.4720619
                     rho |  .73921255   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a0.rtf
resultados/encuesta/modelos1_3a0.xml
dir : seeout
note: 1.tax2020#0b.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity
note: 1.tax2020#0b.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       654
-------------+----------------------------------   F(27, 626)      =      5.79
       Model |  16071.2771        27  595.232486   Prob > F        =    0.0000
    Residual |  64335.1892       626  102.771868   R-squared       =    0.1999
-------------+----------------------------------   Adj R-squared   =    0.1654
       Total |  80406.4664       653  123.133945   Root MSE        =    10.138

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.7133346   1.239214    -0.58   0.565    -3.146854    1.720185
                         |
            tax2020#sexo |
             0#Femenino  |  -.8001079   1.599085    -0.50   0.617    -3.940329    2.340113
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
         tax2020#singles |
             0#sueltos   |   .6420138   1.839952     0.35   0.727    -2.971213     4.25524
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -1.186718    1.15683    -1.03   0.305    -3.458455    1.085018
                         |
                edad_gr2 |
                  25-29  |   1.736086   1.613295     1.08   0.282     -1.43204    4.904212
                  30-34  |   4.177803   1.621113     2.58   0.010      .994324    7.361281
                  35-39  |   1.720291   1.615899     1.06   0.287    -1.452948     4.89353
                  40-44  |   .3697402   1.787365     0.21   0.836    -3.140216    3.879697
                  45-54  |   4.903389   1.596076     3.07   0.002     1.769078      8.0377
                  55-64  |   2.895937   1.981325     1.46   0.144    -.9949123    6.786786
                    65+  |   3.089584   5.370612     0.58   0.565    -7.457014    13.63618
                         |
                educ_gr2 |
    Secundaria completa  |   3.097833   5.418418     0.57   0.568    -7.542645    13.73831
                Técnica  |   .1826578   5.330514     0.03   0.973     -10.2852    10.65051
           Preparatoria  |   2.139824   5.289885     0.40   0.686    -8.248246    12.52789
Licenciatura incompleta  |   .9788605   5.335258     0.18   0.854    -9.498309    11.45603
  Licenciatura completa  |   5.632242   5.307003     1.06   0.289    -4.789443    16.05393
               Posgrado  |   9.839402   5.619389     1.75   0.080    -1.195734    20.87454
                   Otro  |  -1.853805   7.919931    -0.23   0.815    -17.40666    13.69905
                         |
                 gr_ingr |
          3,001 a 5 mil  |   8.342237   2.521872     3.31   0.001     3.389884    13.29459
          5,001 a 8 mil  |  -1.104238   2.295311    -0.48   0.631     -5.61168    3.403204
         8,001 a 10 mil  |  -1.562744   2.208659    -0.71   0.479    -5.900022    2.774533
        10,001 a 15 mil  |   1.552535   2.145101     0.72   0.469    -2.659931       5.765
        15,001 a 20 mil  |    1.95332   2.167523     0.90   0.368    -2.303177    6.209817
        20,001 a 49,999  |   .5367985   2.184691     0.25   0.806    -3.753411    4.827008
                50 mil+  |   1.307487   2.908355     0.45   0.653    -4.403827      7.0188
                  No sé  |  -1.049014   2.588719    -0.41   0.685    -6.132638     4.03461
                         |
                 singles |   -6.81134   1.315656    -5.18   0.000    -9.394974   -4.227706
                   _cons |    6.99992   5.456444     1.28   0.200     -3.71523    17.71507
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_reg0.rtf
resultados/encuesta/modelos1_3a_reg0.xml
dir : seeout
note: 1.tax2020#0b.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       654
-------------+----------------------------------   F(26, 627)      =      6.02
       Model |  16058.7645        26  617.644787   Prob > F        =    0.0000
    Residual |  64347.7019       627  102.627914   R-squared       =    0.1997
-------------+----------------------------------   Adj R-squared   =    0.1665
       Total |  80406.4664       653  123.133945   Root MSE        =    10.131

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.8881417   1.132638    -0.78   0.433    -3.112366    1.336082
                         |
            tax2020#sexo |
             0#Femenino  |  -.8250607   1.596366    -0.52   0.605    -3.959932    2.309811
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
                    sexo |  -1.179691   1.155844    -1.02   0.308    -3.449485    1.090103
                         |
                edad_gr2 |
                  25-29  |   1.734093   1.612155     1.08   0.283    -1.431783     4.89997
                  30-34  |   4.181271   1.619947     2.58   0.010     1.000092     7.36245
                  35-39  |   1.707437   1.614347     1.06   0.291    -1.462746    4.877619
                  40-44  |   .3518704   1.785379     0.20   0.844    -3.154176    3.857917
                  45-54  |   4.896298   1.594828     3.07   0.002     1.764446     8.02815
                  55-64  |   2.888568   1.979825     1.46   0.145    -.9993223    6.776458
                    65+  |   3.172209    5.36163     0.59   0.554    -7.356718    13.70114
                         |
                educ_gr2 |
    Secundaria completa  |   3.079119   5.414357     0.57   0.570     -7.55335    13.71159
                Técnica  |   .1860041    5.32677     0.03   0.972    -10.27447    10.64647
           Preparatoria  |   2.135938   5.286168     0.40   0.686    -8.244799    12.51667
Licenciatura incompleta  |   .9780735   5.331519     0.18   0.855    -9.491723    11.44787
  Licenciatura completa  |   5.633258   5.303284     1.06   0.289    -4.781091    16.04761
               Posgrado  |   9.825813   5.615317     1.75   0.081    -1.201292    20.85292
                   Otro  |  -1.784906   7.911922    -0.23   0.822    -17.32198    13.75217
                         |
                 gr_ingr |
          3,001 a 5 mil  |     8.3372   2.520064     3.31   0.001     3.388414    13.28599
          5,001 a 8 mil  |  -1.104824   2.293703    -0.48   0.630    -5.609094    3.399445
         8,001 a 10 mil  |  -1.567094   2.207076    -0.71   0.478     -5.90125    2.767063
        10,001 a 15 mil  |   1.535463   2.143041     0.72   0.474    -2.672944    5.743869
        15,001 a 20 mil  |   1.947494    2.16594     0.90   0.369    -2.305882    6.200869
        20,001 a 49,999  |   .5396681   2.183144     0.25   0.805    -3.747492    4.826828
                50 mil+  |   1.281159   2.905339     0.44   0.659    -4.424214    6.986533
                  No sé  |  -1.025058   2.585995    -0.40   0.692    -6.103318    4.053203
                         |
                 singles |  -6.495668   .9545741    -6.80   0.000    -8.370217   -4.621118
                   _cons |   7.098891   5.445249     1.30   0.193    -3.594243    17.79202
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_reg0.rtf
resultados/encuesta/modelos1_3a_reg0.xml
dir : seeout
note: 1.tax2020#0b.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       654
-------------+----------------------------------   F(26, 627)      =      6.01
       Model |  16045.5478        26  617.136455   Prob > F        =    0.0000
    Residual |  64360.9185       627  102.648993   R-squared       =    0.1996
-------------+----------------------------------   Adj R-squared   =    0.1664
       Total |  80406.4664       653  123.133945   Root MSE        =    10.132

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   -.300042   .9232297    -0.32   0.745    -2.113039    1.512955
                         |
         tax2020#singles |
             0#sueltos   |   .6831849   1.837012     0.37   0.710    -2.924257    4.290627
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -1.589253   .8307862    -1.91   0.056    -3.220714    .0422069
                         |
                edad_gr2 |
                  25-29  |   1.739547   1.612316     1.08   0.281    -1.426646    4.905739
                  30-34  |   4.174457    1.62013     2.58   0.010     .9929186    7.355995
                  35-39  |   1.729641   1.614825     1.07   0.285    -1.441479    4.900761
                  40-44  |   .3767387   1.786241     0.21   0.833    -3.131001    3.884478
                  45-54  |   4.901015   1.595114     3.07   0.002     1.768602    8.033428
                  55-64  |   2.890564   1.980112     1.46   0.145    -.9978895    6.779017
                    65+  |   3.183661   5.364111     0.59   0.553    -7.350136    13.71746
                         |
                educ_gr2 |
    Secundaria completa  |   3.102331   5.415171     0.57   0.567    -7.531737     13.7364
                Técnica  |   .1463273   5.326832     0.03   0.978    -10.31426    10.60692
           Preparatoria  |   2.127452   5.286664     0.40   0.688     -8.25426    12.50916
Licenciatura incompleta  |   .9662632   5.332008     0.18   0.856    -9.504492    11.43702
  Licenciatura completa  |   5.598609   5.303404     1.06   0.292    -4.815976    16.01319
               Posgrado  |    9.78227   5.614869     1.74   0.082    -1.243956     20.8085
                   Otro  |  -1.906327     7.9145    -0.24   0.810    -17.44846    13.63581
                         |
                 gr_ingr |
          3,001 a 5 mil  |    8.41387   2.516299     3.34   0.001     3.472475    13.35526
          5,001 a 8 mil  |  -1.047169   2.291105    -0.46   0.648    -5.546336    3.451999
         8,001 a 10 mil  |   -1.52745   2.206212    -0.69   0.489    -5.859909    2.805009
        10,001 a 15 mil  |   1.619831     2.1396     0.76   0.449    -2.581819    5.821481
        15,001 a 20 mil  |   2.026878   2.161239     0.94   0.349    -2.217264    6.271021
        20,001 a 49,999  |   .5950226   2.180285     0.27   0.785    -3.686522    4.876567
                50 mil+  |   1.391229   2.901799     0.48   0.632    -4.307192    7.089651
                  No sé  |  -1.023733   2.586678    -0.40   0.692    -6.103334    4.055868
                         |
                 singles |   -6.82885   1.314404    -5.20   0.000    -9.410018   -4.247683
                   _cons |    6.76244   5.432512     1.24   0.214    -3.905681    17.43056
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_reg0.rtf
resultados/encuesta/modelos1_3a_reg0.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0351                                         min =          1
     between = 0.1973                                         avg =        1.7
     overall = 0.1824                                         max =          2

                                                Wald chi2(27)     =      86.67
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   .1510151   .7611585     0.20   0.843    -1.340828    1.642858
                         |
            tax2020#sexo |
             0#Femenino  |  -.2295407   .9468033    -0.24   0.808    -2.085241     1.62616
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
         tax2020#singles |
             0#sueltos   |   .9164309   1.166031     0.79   0.432    -1.368948     3.20181
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -2.131202   1.137914    -1.87   0.061    -4.361472    .0990683
                         |
                edad_gr2 |
                  25-29  |   .3702556   1.822541     0.20   0.839     -3.20186    3.942371
                  30-34  |   2.869513   1.897612     1.51   0.130    -.8497379    6.588764
                  35-39  |   2.056407   1.944315     1.06   0.290    -1.754381    5.867194
                  40-44  |   .3972111   2.150906     0.18   0.853    -3.818487    4.612909
                  45-54  |   4.100946   1.939477     2.11   0.034     .2996408    7.902251
                  55-64  |   1.844186   2.443017     0.75   0.450    -2.944039    6.632412
                    65+  |   4.659022   4.941571     0.94   0.346     -5.02628    14.34432
                         |
                educ_gr2 |
    Secundaria completa  |   2.114998   7.432917     0.28   0.776    -12.45325    16.68325
                Técnica  |  -.2973877   7.331561    -0.04   0.968    -14.66698    14.07221
           Preparatoria  |   .4836093   7.292216     0.07   0.947    -13.80887    14.77609
Licenciatura incompleta  |   .4687613   7.328328     0.06   0.949     -13.8945    14.83202
  Licenciatura completa  |   4.600788   7.303589     0.63   0.529    -9.713983    18.91556
               Posgrado  |   7.074122   7.621395     0.93   0.353    -7.863538    22.01178
                   Otro  |  -3.407116    8.36515    -0.41   0.684    -19.80251    12.98828
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.125462   2.053354     2.50   0.013     1.100961    9.149962
          5,001 a 8 mil  |  -1.707185   1.957965    -0.87   0.383    -5.544726    2.130356
         8,001 a 10 mil  |    -1.1567   1.940897    -0.60   0.551    -4.960788    2.647388
        10,001 a 15 mil  |   .1471414    1.89579     0.08   0.938    -3.568538    3.862821
        15,001 a 20 mil  |   .9775178   1.967602     0.50   0.619    -2.878912    4.833947
        20,001 a 49,999  |  -.2825477   2.027017    -0.14   0.889    -4.255429    3.690333
                50 mil+  |   2.208891   2.718167     0.81   0.416    -3.118618    7.536399
                  No sé  |   .0329094   2.652495     0.01   0.990    -5.165885    5.231703
                         |
                 singles |    -4.7822   1.053853    -4.54   0.000    -6.847714   -2.716685
                   _cons |   9.247292   7.417522     1.25   0.213    -5.290783    23.78537
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2238019
                 sigma_e |  5.4877587
                     rho |  .73856719   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_xtreg0.rtf
resultados/encuesta/modelos1_3a_xtreg0.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0335                                         min =          1
     between = 0.1973                                         avg =        1.7
     overall = 0.1822                                         max =          2

                                                Wald chi2(26)     =      86.13
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.1232039   .6764542    -0.18   0.855     -1.44903    1.202622
                         |
            tax2020#sexo |
             0#Femenino  |  -.2770647   .9447183    -0.29   0.769    -2.128679    1.574549
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
                    sexo |  -2.102214   1.136917    -1.85   0.064    -4.330531    .1261028
                         |
                edad_gr2 |
                  25-29  |   .4116271   1.821202     0.23   0.821    -3.157864    3.981118
                  30-34  |   2.902925   1.896478     1.53   0.126    -.8141037    6.619954
                  35-39  |   2.064858   1.943561     1.06   0.288    -1.744452    5.874168
                  40-44  |    .343407   2.149008     0.16   0.873    -3.868572    4.555386
                  45-54  |   4.113112   1.938691     2.12   0.034     .3133479    7.912877
                  55-64  |   1.879661    2.44168     0.77   0.441    -2.905944    6.665267
                    65+  |    4.97235   4.924159     1.01   0.313    -4.678824    14.62352
                         |
                educ_gr2 |
    Secundaria completa  |   2.113938   7.429736     0.28   0.776    -12.44808    16.67595
                Técnica  |  -.2877734   7.328411    -0.04   0.969    -14.65119    14.07565
           Preparatoria  |   .4739772   7.289076     0.07   0.948    -13.81235     14.7603
Licenciatura incompleta  |   .4990737   7.325095     0.07   0.946    -13.85785      14.856
  Licenciatura completa  |   4.588523    7.30044     0.63   0.530    -9.720076    18.89712
               Posgrado  |   7.063228   7.618162     0.93   0.354    -7.868095    21.99455
                   Otro  |  -3.103417   8.353132    -0.37   0.710    -19.47525    13.26842
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.059396   2.051118     2.47   0.014     1.039278    9.079514
          5,001 a 8 mil  |  -1.728458   1.957317    -0.88   0.377     -5.56473    2.107813
         8,001 a 10 mil  |   -1.16783   1.940365    -0.60   0.547    -4.970875    2.635216
        10,001 a 15 mil  |   .0816179   1.893469     0.04   0.966    -3.629512    3.792748
        15,001 a 20 mil  |   .9532895   1.966846     0.48   0.628    -2.901657    4.808236
        20,001 a 49,999  |  -.2558581    2.02619    -0.13   0.900    -4.227117      3.7154
                50 mil+  |   2.214108   2.717425     0.81   0.415    -3.111947    7.540163
                  No sé  |    .032989   2.651671     0.01   0.990     -5.16419    5.230168
                         |
                 singles |  -4.329607   .8817717    -4.91   0.000    -6.057848   -2.601366
                   _cons |   9.378253   7.412465     1.27   0.206    -5.149912    23.90642
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2127994
                 sigma_e |  5.4830384
                     rho |  .73843857   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_xtreg0.rtf
resultados/encuesta/modelos1_3a_xtreg0.xml
dir : seeout
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0351                                         min =          1
     between = 0.1969                                         avg =        1.7
     overall = 0.1821                                         max =          2

                                                Wald chi2(26)     =      86.64
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   .2754863   .5631055     0.49   0.625    -.8281801    1.379153
                         |
         tax2020#singles |
             0#sueltos   |   .9344738   1.161929     0.80   0.421    -1.342864    3.211812
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |   -2.24575   1.035361    -2.17   0.030     -4.27502   -.2164802
                         |
                edad_gr2 |
                  25-29  |   .3592552   1.821151     0.20   0.844    -3.210135    3.928645
                  30-34  |   2.848113   1.895305     1.50   0.133    -.8666156    6.562842
                  35-39  |   2.058552   1.943588     1.06   0.290    -1.750809    5.867914
                  40-44  |   .3960176   2.150115     0.18   0.854     -3.81813    4.610166
                  45-54  |   4.089555   1.938483     2.11   0.035     .2901977    7.888912
                  55-64  |   1.831195   2.441931     0.75   0.453    -2.954901    6.617291
                    65+  |   4.725172   4.929369     0.96   0.338    -4.936214    14.38656
                         |
                educ_gr2 |
    Secundaria completa  |   2.121685   7.432447     0.29   0.775    -12.44564    16.68901
                Técnica  |  -.3265294    7.33033    -0.04   0.964    -14.69371    14.04065
           Preparatoria  |   .4821753   7.291904     0.07   0.947    -13.80969    14.77404
Licenciatura incompleta  |   .4590807   7.327906     0.06   0.950    -13.90335    14.82151
  Licenciatura completa  |   4.584051   7.303067     0.63   0.530    -9.729698     18.8978
               Posgrado  |   7.026905   7.618899     0.92   0.356    -7.905862    21.95967
                   Otro  |  -3.451243   8.360109    -0.41   0.680    -19.83675    12.93427
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.154298   2.045882     2.52   0.012     1.144444    9.164152
          5,001 a 8 mil  |  -1.691053   1.954645    -0.87   0.387    -5.522087    2.139981
         8,001 a 10 mil  |  -1.147126   1.938487    -0.59   0.554     -4.94649    2.652238
        10,001 a 15 mil  |   .1770473   1.889389     0.09   0.925    -3.526088    3.880182
        15,001 a 20 mil  |    1.00867   1.961035     0.51   0.607    -2.834887    4.852227
        20,001 a 49,999  |  -.2644863   2.023664    -0.13   0.896    -4.230795    3.701823
                50 mil+  |   2.259371    2.70871     0.83   0.404    -3.049603    7.568345
                  No sé  |   .0359273   2.650585     0.01   0.989    -5.159124    5.230979
                         |
                 singles |  -4.785389    1.05219    -4.55   0.000    -6.847644   -2.723133
                   _cons |   9.184856   7.411887     1.24   0.215    -5.342175    23.71189
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2229086
                 sigma_e |  5.4767881
                     rho |  .73930189   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/modelos1_3a_xtreg0.rtf
resultados/encuesta/modelos1_3a_xtreg0.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0351                                         min =          1
     between = 0.1973                                         avg =        1.7
     overall = 0.1824                                         max =          2

                                                Wald chi2(27)     =      86.67
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   .1510151   .7611585     0.20   0.843    -1.340828    1.642858
                         |
            tax2020#sexo |
             0#Femenino  |  -.2295407   .9468033    -0.24   0.808    -2.085241     1.62616
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
         tax2020#singles |
             0#sueltos   |   .9164309   1.166031     0.79   0.432    -1.368948     3.20181
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |  -2.131202   1.137914    -1.87   0.061    -4.361472    .0990683
                         |
                edad_gr2 |
                  25-29  |   .3702556   1.822541     0.20   0.839     -3.20186    3.942371
                  30-34  |   2.869513   1.897612     1.51   0.130    -.8497379    6.588764
                  35-39  |   2.056407   1.944315     1.06   0.290    -1.754381    5.867194
                  40-44  |   .3972111   2.150906     0.18   0.853    -3.818487    4.612909
                  45-54  |   4.100946   1.939477     2.11   0.034     .2996408    7.902251
                  55-64  |   1.844186   2.443017     0.75   0.450    -2.944039    6.632412
                    65+  |   4.659022   4.941571     0.94   0.346     -5.02628    14.34432
                         |
                educ_gr2 |
    Secundaria completa  |   2.114998   7.432917     0.28   0.776    -12.45325    16.68325
                Técnica  |  -.2973877   7.331561    -0.04   0.968    -14.66698    14.07221
           Preparatoria  |   .4836093   7.292216     0.07   0.947    -13.80887    14.77609
Licenciatura incompleta  |   .4687613   7.328328     0.06   0.949     -13.8945    14.83202
  Licenciatura completa  |   4.600788   7.303589     0.63   0.529    -9.713983    18.91556
               Posgrado  |   7.074122   7.621395     0.93   0.353    -7.863538    22.01178
                   Otro  |  -3.407116    8.36515    -0.41   0.684    -19.80251    12.98828
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.125462   2.053354     2.50   0.013     1.100961    9.149962
          5,001 a 8 mil  |  -1.707185   1.957965    -0.87   0.383    -5.544726    2.130356
         8,001 a 10 mil  |    -1.1567   1.940897    -0.60   0.551    -4.960788    2.647388
        10,001 a 15 mil  |   .1471414    1.89579     0.08   0.938    -3.568538    3.862821
        15,001 a 20 mil  |   .9775178   1.967602     0.50   0.619    -2.878912    4.833947
        20,001 a 49,999  |  -.2825477   2.027017    -0.14   0.889    -4.255429    3.690333
                50 mil+  |   2.208891   2.718167     0.81   0.416    -3.118618    7.536399
                  No sé  |   .0329094   2.652495     0.01   0.990    -5.165885    5.231703
                         |
                 singles |    -4.7822   1.053853    -4.54   0.000    -6.847714   -2.716685
                   _cons |   9.247292   7.417522     1.25   0.213    -5.290783    23.78537
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2238019
                 sigma_e |  5.4877587
                     rho |  .73856719   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/bal_mod1_3a_xtreg0.rtf
resultados/encuesta/bal_mod1_3a_xtreg0.xml
dir : seeout
note: 1.tax2020#0.sexo omitted because of collinearity
note: 1.tax2020#1.sexo omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0335                                         min =          1
     between = 0.1973                                         avg =        1.7
     overall = 0.1822                                         max =          2

                                                Wald chi2(26)     =      86.13
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.1232039   .6764542    -0.18   0.855     -1.44903    1.202622
                         |
            tax2020#sexo |
             0#Femenino  |  -.2770647   .9447183    -0.29   0.769    -2.128679    1.574549
            1#Masculino  |          0  (omitted)
             1#Femenino  |          0  (omitted)
                         |
                    sexo |  -2.102214   1.136917    -1.85   0.064    -4.330531    .1261028
                         |
                edad_gr2 |
                  25-29  |   .4116271   1.821202     0.23   0.821    -3.157864    3.981118
                  30-34  |   2.902925   1.896478     1.53   0.126    -.8141037    6.619954
                  35-39  |   2.064858   1.943561     1.06   0.288    -1.744452    5.874168
                  40-44  |    .343407   2.149008     0.16   0.873    -3.868572    4.555386
                  45-54  |   4.113112   1.938691     2.12   0.034     .3133479    7.912877
                  55-64  |   1.879661    2.44168     0.77   0.441    -2.905944    6.665267
                    65+  |    4.97235   4.924159     1.01   0.313    -4.678824    14.62352
                         |
                educ_gr2 |
    Secundaria completa  |   2.113938   7.429736     0.28   0.776    -12.44808    16.67595
                Técnica  |  -.2877734   7.328411    -0.04   0.969    -14.65119    14.07565
           Preparatoria  |   .4739772   7.289076     0.07   0.948    -13.81235     14.7603
Licenciatura incompleta  |   .4990737   7.325095     0.07   0.946    -13.85785      14.856
  Licenciatura completa  |   4.588523    7.30044     0.63   0.530    -9.720076    18.89712
               Posgrado  |   7.063228   7.618162     0.93   0.354    -7.868095    21.99455
                   Otro  |  -3.103417   8.353132    -0.37   0.710    -19.47525    13.26842
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.059396   2.051118     2.47   0.014     1.039278    9.079514
          5,001 a 8 mil  |  -1.728458   1.957317    -0.88   0.377     -5.56473    2.107813
         8,001 a 10 mil  |   -1.16783   1.940365    -0.60   0.547    -4.970875    2.635216
        10,001 a 15 mil  |   .0816179   1.893469     0.04   0.966    -3.629512    3.792748
        15,001 a 20 mil  |   .9532895   1.966846     0.48   0.628    -2.901657    4.808236
        20,001 a 49,999  |  -.2558581    2.02619    -0.13   0.900    -4.227117      3.7154
                50 mil+  |   2.214108   2.717425     0.81   0.415    -3.111947    7.540163
                  No sé  |    .032989   2.651671     0.01   0.990     -5.16419    5.230168
                         |
                 singles |  -4.329607   .8817717    -4.91   0.000    -6.057848   -2.601366
                   _cons |   9.378253   7.412465     1.27   0.206    -5.149912    23.90642
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2127994
                 sigma_e |  5.4830384
                     rho |  .73843857   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/bal_mod1_3a_xtreg0.rtf
resultados/encuesta/bal_mod1_3a_xtreg0.xml
dir : seeout
note: 1.tax2020#0.singles omitted because of collinearity
note: 1.tax2020#1.singles omitted because of collinearity

Random-effects GLS regression                   Number of obs     =        654
Group variable: id_num                          Number of groups  =        380

R-sq:                                           Obs per group:
     within  = 0.0351                                         min =          1
     between = 0.1969                                         avg =        1.7
     overall = 0.1821                                         max =          2

                                                Wald chi2(26)     =      86.64
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
         consumo_semanal |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |   .2754863   .5631055     0.49   0.625    -.8281801    1.379153
                         |
         tax2020#singles |
             0#sueltos   |   .9344738   1.161929     0.80   0.421    -1.342864    3.211812
            1#cajetilla  |          0  (omitted)
             1#sueltos   |          0  (omitted)
                         |
                    sexo |   -2.24575   1.035361    -2.17   0.030     -4.27502   -.2164802
                         |
                edad_gr2 |
                  25-29  |   .3592552   1.821151     0.20   0.844    -3.210135    3.928645
                  30-34  |   2.848113   1.895305     1.50   0.133    -.8666156    6.562842
                  35-39  |   2.058552   1.943588     1.06   0.290    -1.750809    5.867914
                  40-44  |   .3960176   2.150115     0.18   0.854     -3.81813    4.610166
                  45-54  |   4.089555   1.938483     2.11   0.035     .2901977    7.888912
                  55-64  |   1.831195   2.441931     0.75   0.453    -2.954901    6.617291
                    65+  |   4.725172   4.929369     0.96   0.338    -4.936214    14.38656
                         |
                educ_gr2 |
    Secundaria completa  |   2.121685   7.432447     0.29   0.775    -12.44564    16.68901
                Técnica  |  -.3265294    7.33033    -0.04   0.964    -14.69371    14.04065
           Preparatoria  |   .4821753   7.291904     0.07   0.947    -13.80969    14.77404
Licenciatura incompleta  |   .4590807   7.327906     0.06   0.950    -13.90335    14.82151
  Licenciatura completa  |   4.584051   7.303067     0.63   0.530    -9.729698     18.8978
               Posgrado  |   7.026905   7.618899     0.92   0.356    -7.905862    21.95967
                   Otro  |  -3.451243   8.360109    -0.41   0.680    -19.83675    12.93427
                         |
                 gr_ingr |
          3,001 a 5 mil  |   5.154298   2.045882     2.52   0.012     1.144444    9.164152
          5,001 a 8 mil  |  -1.691053   1.954645    -0.87   0.387    -5.522087    2.139981
         8,001 a 10 mil  |  -1.147126   1.938487    -0.59   0.554     -4.94649    2.652238
        10,001 a 15 mil  |   .1770473   1.889389     0.09   0.925    -3.526088    3.880182
        15,001 a 20 mil  |    1.00867   1.961035     0.51   0.607    -2.834887    4.852227
        20,001 a 49,999  |  -.2644863   2.023664    -0.13   0.896    -4.230795    3.701823
                50 mil+  |   2.259371    2.70871     0.83   0.404    -3.049603    7.568345
                  No sé  |   .0359273   2.650585     0.01   0.989    -5.159124    5.230979
                         |
                 singles |  -4.785389    1.05219    -4.55   0.000    -6.847644   -2.723133
                   _cons |   9.184856   7.411887     1.24   0.215    -5.342175    23.71189
-------------------------+----------------------------------------------------------------
                 sigma_u |  9.2229086
                 sigma_e |  5.4767881
                     rho |  .73930189   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
resultados/encuesta/bal_mod1_3a_xtreg0.rtf
resultados/encuesta/bal_mod1_3a_xtreg0.xml
dir : seeout

. log close
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\encuesta\/mod
> elos_consumo3a.log
  log type:  text
 closed on:  21 Aug 2021, 09:53:20
----------------------------------------------------------------------------------------------
