----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\encuesta\/mod
> elos_cons1_log.log
  log type:  text
 opened on:  20 Aug 2021, 00:30:59

. 
. use "$datos/wave4_5unbalanced.dta", clear

. /***************************************************************************/
. // 1.1 MODELOS
. global vars_reg "sexo i.gr_edad i.gr_educ i.ingreso_hogar i.tipo_cons"

. 
. // modelo
. regress $depvar tax2020 $vars_reg if has_fumado_1mes

      Source |       SS           df       MS      Number of obs   =     2,741
-------------+----------------------------------   F(21, 2719)     =    200.57
       Model |  2712.36284        21  129.160135   Prob > F        =    0.0000
    Residual |  1750.97584     2,719  .643977873   R-squared       =    0.6077
-------------+----------------------------------   Adj R-squared   =    0.6047
       Total |  4463.33867     2,740  1.62895572   Root MSE        =    .80248

------------------------------------------------------------------------------------------
            log_cons_sem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.0572301   .0307676    -1.86   0.063    -.1175604    .0031002
                    sexo |  -.1993903    .031231    -6.38   0.000    -.2606291   -.1381515
                         |
                 gr_edad |
                  25-44  |   .1150617    .048534     2.37   0.018     .0198944     .210229
                  45-64  |     .24909   .0541588     4.60   0.000     .1428934    .3552866
                    65+  |   .4871551   .1522064     3.20   0.001     .1887033    .7856069
                         |
                 gr_educ |
    Secundaria completa  |  -.1269647   .1829502    -0.69   0.488    -.4857002    .2317708
 Técnica o Preparatoria  |  -.2131122   .1784525    -1.19   0.232    -.5630285     .136804
Universidad o posterior  |  -.1610509   .1790249    -0.90   0.368    -.5120894    .1899877
                   Otro  |  -.0032405   .2675708    -0.01   0.990    -.5279031    .5214221
                         |
           ingreso_hogar |
     De $1,501 a $3,000  |   .1383619   .1424911     0.97   0.332    -.1410398    .4177636
    De $3,001 a $5,000   |   .3071322   .1308328     2.35   0.019     .0505903     .563674
    De $5,001 a $8,000   |   .1979813   .1255683     1.58   0.115    -.0482376    .4442002
   De $8,001 a $10,000   |   .2491877   .1238286     2.01   0.044       .00638    .4919955
   De $10,001 a $15,000  |   .2967101   .1222757     2.43   0.015     .0569474    .5364727
   De $15,001 a $20,000  |   .3168112   .1225597     2.58   0.010     .0764916    .5571308
   De $20,001 a $49,999  |   .2973321   .1221985     2.43   0.015     .0577208    .5369434
          $50,000 o más  |   .6051405   .1383503     4.37   0.000     .3338583    .8764228
                  No se  |   .0760108   .1348658     0.56   0.573     -.188439    .3404605
                         |
               tipo_cons |
          diario-suelto  |  -.4067518   .0815631    -4.99   0.000    -.5666837     -.24682
   esporádico-cajetilla  |  -1.665729    .035148   -47.39   0.000    -1.734648   -1.596809
      esporádico-suelto  |  -2.318786   .0473029   -49.02   0.000    -2.411539   -2.226032
                         |
                   _cons |   3.664715   .2132123    17.19   0.000      3.24664    4.082789
------------------------------------------------------------------------------------------

. outreg2 using resultados/encuesta/modelos1_1$mod, word excel replace
resultados/encuesta/modelos1_1_log.rtf
resultados/encuesta/modelos1_1_log.xml
dir : seeout

. 
. // estimación panel
. xtreg $depvar tax2020 $vars_reg if has_fumado_1mes, fe
note: 5.gr_educ omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      2,741
Group variable: id_num                          Number of groups  =      1,994

R-sq:                                           Obs per group:
     within  = 0.2513                                         min =          1
     between = 0.5287                                         avg =        1.4
     overall = 0.5202                                         max =          2

                                                F(20,727)         =      12.20
corr(u_i, Xb)  = 0.4901                         Prob > F          =     0.0000

------------------------------------------------------------------------------------------
            log_cons_sem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |    .003617   .0209257     0.17   0.863     -.037465     .044699
                    sexo |    .001625   .1567904     0.01   0.992    -.3061911    .3094411
                         |
                 gr_edad |
                  25-44  |  -.1723794   .1638313    -1.05   0.293    -.4940184    .1492596
                  45-64  |  -.2624902   .3020355    -0.87   0.385    -.8554562    .3304758
                    65+  |  -.2612845   .4424252    -0.59   0.555    -1.129868    .6072989
                         |
                 gr_educ |
    Secundaria completa  |  -.0517802   .2410809    -0.21   0.830     -.525078    .4215176
 Técnica o Preparatoria  |  -.0269239   .2421062    -0.11   0.911    -.5022347    .4483869
Universidad o posterior  |   .0307481   .2594889     0.12   0.906     -.478689    .5401852
                   Otro  |          0  (omitted)
                         |
           ingreso_hogar |
     De $1,501 a $3,000  |   .4489411   .1837893     2.44   0.015       .08812    .8097623
    De $3,001 a $5,000   |    .569715   .1960091     2.91   0.004     .1849035    .9545265
    De $5,001 a $8,000   |   .7378712   .1879527     3.93   0.000     .3688764    1.106866
   De $8,001 a $10,000   |   .7766926   .1857862     4.18   0.000     .4119512    1.141434
   De $10,001 a $15,000  |   .7787868   .1850552     4.21   0.000     .4154804    1.142093
   De $15,001 a $20,000  |   .8122603   .1884254     4.31   0.000     .4423375    1.182183
   De $20,001 a $49,999  |   .8173316   .1903044     4.29   0.000     .4437198    1.190943
          $50,000 o más  |   .8999666    .211112     4.26   0.000     .4855048    1.314428
                  No se  |   .8855735   .2114475     4.19   0.000     .4704529    1.300694
                         |
               tipo_cons |
          diario-suelto  |  -.0133053   .1133757    -0.12   0.907    -.2358882    .2092776
   esporádico-cajetilla  |   -.738646    .055857   -13.22   0.000    -.8483062   -.6289858
      esporádico-suelto  |  -1.000324   .0877101   -11.40   0.000     -1.17252   -.8281291
                         |
                   _cons |   2.652382   .3436093     7.72   0.000     1.977797    3.326967
-------------------------+----------------------------------------------------------------
                 sigma_u |  1.0017432
                 sigma_e |   .3966271
                     rho |  .86447906   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
F test that all u_i=0: F(1993, 727) = 5.22                   Prob > F = 0.0000

. outreg2 using resultados/encuesta/modelos1_1$mod, word excel append
resultados/encuesta/modelos1_1_log.rtf
resultados/encuesta/modelos1_1_log.xml
dir : seeout

. 
. estimates store fixed

. *xttest2
. /*
> insufficient observations
> r(2001);
> 
> end of do-file
> */
. 
. xtreg $depvar tax2020 $vars_reg if has_fumado_1mes, re

Random-effects GLS regression                   Number of obs     =      2,741
Group variable: id_num                          Number of groups  =      1,994

R-sq:                                           Obs per group:
     within  = 0.2286                                         min =          1
     between = 0.6153                                         avg =        1.4
     overall = 0.6046                                         max =          2

                                                Wald chi2(21)     =    2916.36
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
            log_cons_sem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |  -.0295885   .0196626    -1.50   0.132    -.0681264    .0089495
                    sexo |  -.2168439   .0364637    -5.95   0.000    -.2883114   -.1453764
                         |
                 gr_edad |
                  25-44  |   .1347371   .0525682     2.56   0.010     .0317054    .2377688
                  45-64  |    .307409   .0605476     5.08   0.000     .1887378    .4260802
                    65+  |   .4727934    .166994     2.83   0.005     .1454912    .8000957
                         |
                 gr_educ |
    Secundaria completa  |  -.1239797   .2090835    -0.59   0.553    -.5337757    .2858164
 Técnica o Preparatoria  |  -.1996699   .2041894    -0.98   0.328    -.5998738    .2005341
Universidad o posterior  |  -.1376236   .2046706    -0.67   0.501    -.5387706    .2635235
                   Otro  |  -.0508015   .2654922    -0.19   0.848    -.5711566    .4695537
                         |
           ingreso_hogar |
     De $1,501 a $3,000  |   .2184658   .1274626     1.71   0.087    -.0313563    .4682878
    De $3,001 a $5,000   |   .3535721   .1236271     2.86   0.004     .1112675    .5958768
    De $5,001 a $8,000   |   .3675949   .1184873     3.10   0.002     .1353641    .5998258
   De $8,001 a $10,000   |   .4074336   .1163565     3.50   0.000     .1793791    .6354881
   De $10,001 a $15,000  |   .4235866   .1154047     3.67   0.000     .1973975    .6497758
   De $15,001 a $20,000  |   .4559869   .1163438     3.92   0.000     .2279573    .6840164
   De $20,001 a $49,999  |   .4462039   .1165426     3.83   0.000     .2177846    .6746233
          $50,000 o más  |   .6516237   .1325724     4.92   0.000     .3917865    .9114609
                  No se  |   .3130386   .1299494     2.41   0.016     .0583426    .5677347
                         |
               tipo_cons |
          diario-suelto  |  -.2576516   .0759459    -3.39   0.001    -.4065028   -.1088003
   esporádico-cajetilla  |  -1.417086   .0347425   -40.79   0.000     -1.48518   -1.348992
      esporádico-suelto  |  -2.014623   .0482013   -41.80   0.000    -2.109096    -1.92015
                         |
                   _cons |   3.330369    .231732    14.37   0.000     2.876183    3.784555
-------------------------+----------------------------------------------------------------
                 sigma_u |  .70011666
                 sigma_e |   .3966271
                     rho |  .75703662   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------

. outreg2 using resultados/encuesta/modelos1_1$mod, word excel append
resultados/encuesta/modelos1_1_log.rtf
resultados/encuesta/modelos1_1_log.xml
dir : seeout

. 
. estimates store random

. xttest0 

Breusch and Pagan Lagrangian multiplier test for random effects

        log_cons_sem[id_num,t] = Xb + u[id_num] + e[id_num,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
               log_con~m |   1.628956       1.276305
                       e |   .1573131       .3966271
                       u |   .4901633       .7001167

        Test:   Var(u) = 0
                             chibar2(01) =   240.33
                          Prob > chibar2 =   0.0000

. * rechazo Pooled 
. * significance of random effects
. * Hausmann Test
. // hausman consistent efficient
. hausman fixed random , sigmamore

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        random       Difference          S.E.
-------------+----------------------------------------------------------------
     tax2020 |     .003617    -.0295885        .0332055        .0096017
        sexo |     .001625    -.2168439        .2184689        .1598474
     gr_edad |
          2  |   -.1723794     .1347371       -.3071166        .1630516
          3  |   -.2624902      .307409       -.5698992        .3099764
          4  |   -.2612845     .4727934       -.7340779        .4314474
     gr_educ |
          2  |   -.0517802    -.1239797        .0721994        .1408402
          3  |   -.0269239    -.1996699        .1727459        .1496672
          4  |    .0307481    -.1376236        .1683717        .1781502
ingreso_ho~r |
          2  |    .4489411     .2184658        .2304754        .1438358
          3  |     .569715     .3535721        .2161429        .1634827
          4  |    .7378712     .3675949        .3702763        .1568074
          5  |    .7766926     .4074336         .369259         .155575
          6  |    .7787868     .4235866        .3552002        .1553311
          7  |    .8122603     .4559869        .3562734        .1590171
          8  |    .8173316     .4462039        .3711277        .1613019
          9  |    .8999666     .6516237        .2483429        .1765167
         99  |    .8855735     .3130386        .5725349        .1788905
   tipo_cons |
          2  |   -.0133053    -.2576516        .2443463        .0910363
          3  |    -.738646    -1.417086          .67844        .0469527
          4  |   -1.000324    -2.014623        1.014298          .07803
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                 chi2(20) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =      265.08
                Prob>chi2 =      0.0000

. // Rechazo Efectos aleatorios
. 
. use "$datos/wave4_5balanc.dta", clear

. xtreg $depvar tax2020 $vars_reg if has_fumado_1mes, fe
note: 5.gr_educ omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,494
Group variable: id_num                          Number of groups  =        747

R-sq:                                           Obs per group:
     within  = 0.2513                                         min =          2
     between = 0.5682                                         avg =        2.0
     overall = 0.5235                                         max =          2

                                                F(20,727)         =      12.20
corr(u_i, Xb)  = 0.5020                         Prob > F          =     0.0000

------------------------------------------------------------------------------------------
            log_cons_sem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
                 tax2020 |    .003617   .0209257     0.17   0.863     -.037465     .044699
                    sexo |    .001625   .1567904     0.01   0.992    -.3061911    .3094411
                         |
                 gr_edad |
                  25-44  |  -.1723794   .1638313    -1.05   0.293    -.4940184    .1492596
                  45-64  |  -.2624902   .3020355    -0.87   0.385    -.8554562    .3304758
                    65+  |  -.2612845   .4424252    -0.59   0.555    -1.129868    .6072989
                         |
                 gr_educ |
    Secundaria completa  |  -.0517802   .2410809    -0.21   0.830     -.525078    .4215176
 Técnica o Preparatoria  |  -.0269239   .2421062    -0.11   0.911    -.5022347    .4483869
Universidad o posterior  |   .0307481   .2594889     0.12   0.906     -.478689    .5401852
                   Otro  |          0  (omitted)
                         |
           ingreso_hogar |
     De $1,501 a $3,000  |   .4489411   .1837893     2.44   0.015       .08812    .8097623
    De $3,001 a $5,000   |    .569715   .1960091     2.91   0.004     .1849035    .9545265
    De $5,001 a $8,000   |   .7378712   .1879527     3.93   0.000     .3688764    1.106866
   De $8,001 a $10,000   |   .7766926   .1857862     4.18   0.000     .4119512    1.141434
   De $10,001 a $15,000  |   .7787868   .1850552     4.21   0.000     .4154804    1.142093
   De $15,001 a $20,000  |   .8122603   .1884254     4.31   0.000     .4423375    1.182183
   De $20,001 a $49,999  |   .8173316   .1903044     4.29   0.000     .4437198    1.190943
          $50,000 o más  |   .8999666    .211112     4.26   0.000     .4855048    1.314428
                  No se  |   .8855735   .2114475     4.19   0.000     .4704529    1.300694
                         |
               tipo_cons |
          diario-suelto  |  -.0133053   .1133757    -0.12   0.907    -.2358882    .2092776
   esporádico-cajetilla  |   -.738646    .055857   -13.22   0.000    -.8483062   -.6289858
      esporádico-suelto  |  -1.000324   .0877101   -11.40   0.000     -1.17252   -.8281291
                         |
                   _cons |   2.772474    .353105     7.85   0.000     2.079246    3.465701
-------------------------+----------------------------------------------------------------
                 sigma_u |  .93592313
                 sigma_e |   .3966271
                     rho |  .84775152   (fraction of variance due to u_i)
------------------------------------------------------------------------------------------
F test that all u_i=0: F(746, 727) = 6.49                    Prob > F = 0.0000

. outreg2 using resultados/encuesta/modelos1_1$mod, word excel append
resultados/encuesta/modelos1_1_log.rtf
resultados/encuesta/modelos1_1_log.xml
dir : seeout

. 
. capture log close
