---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados/est_xtreg_pooled_f
> e_re.log
  log type:  text
 opened on:  22 Jul 2021, 13:43:56

. 
. global varsRegStatic "m1_20 m1_21 m1 ym"

. putexcel set "resultados\doc\f_tests_xtreg_pooled_fe_re.xlsx", sheet(xtreg, replace) modify

. putexcel (C1) = "gl Denominator"
file resultados\doc\f_tests_xtreg_pooled_fe_re.xlsx saved

. putexcel (E1) = "gl Numerator/gl_chi"
file resultados\doc\f_tests_xtreg_pooled_fe_re.xlsx saved

. putexcel (D1) = "F/chi2"
file resultados\doc\f_tests_xtreg_pooled_fe_re.xlsx saved

. putexcel (F1) = "prob > F/ Prob > chi2"
file resultados\doc\f_tests_xtreg_pooled_fe_re.xlsx saved

. 
. use datos/prelim/de_inpc/panel_marca_ciudad.dta, clear

. 
. // *******************************************************
. // por marca
. // *******************************************************
. // Benson
. xtreg ppu $varsRegStatic if marca == 1, fe

Fixed-effects (within) regression               Number of obs     =      4,650
Group variable: gr_marca_c~d                    Number of groups  =         44

R-sq:                                           Obs per group:
     within  = 0.9212                                         min =         32
     between = 0.8936                                         avg =      105.7
     overall = 0.9091                                         max =        124

                                                F(4,4602)         =   13458.09
corr(u_i, Xb)  = -0.0251                        Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |    .192923    .017783    10.85   0.000     .1580598    .2277862
       m1_21 |   .2306976   .0180817    12.76   0.000     .1952489    .2661464
          m1 |  -.0132262   .0057617    -2.30   0.022     -.024522   -.0019304
          ym |   .0101402   .0000453   223.61   0.000     .0100513    .0102291
       _cons |  -4.394058   .0305693  -143.74   0.000    -4.453989   -4.334128
-------------+----------------------------------------------------------------
     sigma_u |  .05749365
     sigma_e |  .10159413
         rho |  .24257341   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(43, 4602) = 30.55                   Prob > F = 0.0000

. estimates store fixed1

. // xttest2 : Error: too few common observations across panel.
. // cannot decide over
. xtreg ppu $varsRegStatic if marca == 1, re

Random-effects GLS regression                   Number of obs     =      4,650
Group variable: gr_marca_c~d                    Number of groups  =         44

R-sq:                                           Obs per group:
     within  = 0.9212                                         min =         32
     between = 0.8936                                         avg =      105.7
     overall = 0.9091                                         max =        124

                                                Wald chi2(4)      =   54073.41
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1934574   .0178318    10.85   0.000     .1585077    .2284072
       m1_21 |   .2312877   .0181314    12.76   0.000     .1957508    .2668247
          m1 |  -.0132908   .0057777    -2.30   0.021    -.0246149   -.0019668
          ym |     .01014   .0000453   224.03   0.000     .0100513    .0102287
       _cons |  -4.391213   .0312837  -140.37   0.000    -4.452528   -4.329898
-------------+----------------------------------------------------------------
     sigma_u |  .04412974
     sigma_e |  .10159413
         rho |  .15873059   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. estimates store random1

. xttest0 

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .1445307        .380172
                       e |   .0103214       .1015941
                       u |   .0019474       .0441297

        Test:   Var(u) = 0
                             chibar2(01) =  9643.04
                          Prob > chibar2 =   0.0000

. // rechazar OLS
. * significance of random effects
. * Hausmann Test
. hausman fixed1 random1 

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed1      random1       Difference          S.E.
-------------+----------------------------------------------------------------
       m1_20 |     .192923     .1934574       -.0005345               .
       m1_21 |    .2306976     .2312877       -.0005901               .
          m1 |   -.0132262    -.0132908        .0000646               .
          ym |    .0101402       .01014        2.04e-07        2.81e-06
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =    -0.32    chi2<0 ==> model fitted on these
                                        data fails to meet the asymptotic
                                        assumptions of the Hausman test;
                                        see suest for a generalized test

. /*
> chi2<0 ==> model fitted on these
>                                         data fails to meet the asymptotic
>                                         assumptions of the Hausman test;
>                                         see suest for a generalized test
>                                                                                 
> :  too small sample or mis-specification of the model                                            
>                                
> */
. // Hausman test becomes undefined.
. // suest fixed1 random1, noomitted
. // xtreg is not supported by suest
. // r(322);
. // https://stats.stackexchange.com/questions/65650/hausman-test-for-panel-data-fe-and-re-error-in
> -the-estimation-what-to-do-sta
. // ssc install xtoverid 
. xtoverid 

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  29.712  Chi-sq(4)    P-value = 0.0000

. /*
> Test of overidentifying restrictions: fixed vs random effects
> Cross-section time-series model: xtreg re   
> Sargan-Hansen statistic  29.712  Chi-sq(4)    P-value = 0.0000
> */
. // Rechazo efectos aleatorios
. xtreg ppu $varsRegStatic if marca == 1, re cluster(gr_marca_ciudad)

Random-effects GLS regression                   Number of obs     =      4,650
Group variable: gr_marca_c~d                    Number of groups  =         44

R-sq:                                           Obs per group:
     within  = 0.9212                                         min =         32
     between = 0.8936                                         avg =      105.7
     overall = 0.9091                                         max =        124

                                                Wald chi2(4)      =    5000.02
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                       (Std. Err. adjusted for 44 clusters in gr_marca_ciudad)
------------------------------------------------------------------------------
             |               Robust
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1934574    .018603    10.40   0.000     .1569962    .2299186
       m1_21 |   .2312877   .0149491    15.47   0.000      .201988    .2605874
          m1 |  -.0132908   .0021925    -6.06   0.000     -.017588   -.0089937
          ym |     .01014   .0001685    60.18   0.000     .0098097    .0104702
       _cons |  -4.391213   .1159443   -37.87   0.000     -4.61846   -4.163967
-------------+----------------------------------------------------------------
     sigma_u |  .04412974
     sigma_e |  .10159413
         rho |  .15873059   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtoverid 

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re  robust cluster(gr_marca_ciudad)
Sargan-Hansen statistic  30.123  Chi-sq(4)    P-value = 0.0000

. /*
> Test of overidentifying restrictions: fixed vs random effects
> Cross-section time-series model: xtreg re  robust cluster(gr_marca_ciudad)
> Sargan-Hansen statistic  30.123  Chi-sq(4)    P-value = 0.0000
> */
. // Rechazo efectos aleatorios
. // favorece efectos individuales fijos
. 
. // unitroot tests
. xtreg ppu $varsRegStatic if marca == 1, fe

Fixed-effects (within) regression               Number of obs     =      4,650
Group variable: gr_marca_c~d                    Number of groups  =         44

R-sq:                                           Obs per group:
     within  = 0.9212                                         min =         32
     between = 0.8936                                         avg =      105.7
     overall = 0.9091                                         max =        124

                                                F(4,4602)         =   13458.09
corr(u_i, Xb)  = -0.0251                        Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |    .192923    .017783    10.85   0.000     .1580598    .2277862
       m1_21 |   .2306976   .0180817    12.76   0.000     .1952489    .2661464
          m1 |  -.0132262   .0057617    -2.30   0.022     -.024522   -.0019304
          ym |   .0101402   .0000453   223.61   0.000     .0100513    .0102291
       _cons |  -4.394058   .0305693  -143.74   0.000    -4.453989   -4.334128
-------------+----------------------------------------------------------------
     sigma_u |  .05749365
     sigma_e |  .10159413
         rho |  .24257341   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(43, 4602) = 30.55                   Prob > F = 0.0000

. predict error_ppu_ym_fe1, e
(19,276 missing values generated)

. 
. //xtreg ppu $varsRegStatic if marca == 1, re
. 
. xtunitroot fisher error_ppu_ym_fe1, dfuller lags(4)
(19,276 missing values generated)

Fisher-type unit-root test for error_ppu_ym_fe1
Based on augmented Dickey-Fuller tests
-----------------------------------------------
Ho: All panels contain unit roots           Number of panels       =     44
Ha: At least one panel is stationary        Avg. number of periods = 105.68

AR parameter: Panel-specific                Asymptotics: T -> Infinity
Panel means:  Included
Time trend:   Not included
Drift term:   Not included                  ADF regressions: 4 lags
------------------------------------------------------------------------------
                                  Statistic      p-value
------------------------------------------------------------------------------
 Inverse chi-squared(88)   P        51.5938       0.9993
 Inverse normal            Z         3.5338       0.9998
 Inverse logit t(224)      L*        3.2771       0.9994
 Modified inv. chi-squared Pm       -2.7442       0.9970
------------------------------------------------------------------------------
 P statistic requires number of panels to be finite.
 Other statistics are suitable for finite or infinite number of panels.
------------------------------------------------------------------------------

. xtunitroot fisher error_ppu_ym_fe1, dfuller lags(4) trend
(19,276 missing values generated)

Fisher-type unit-root test for error_ppu_ym_fe1
Based on augmented Dickey-Fuller tests
-----------------------------------------------
Ho: All panels contain unit roots           Number of panels       =     44
Ha: At least one panel is stationary        Avg. number of periods = 105.68

AR parameter: Panel-specific                Asymptotics: T -> Infinity
Panel means:  Included
Time trend:   Included
Drift term:   Not included                  ADF regressions: 4 lags
------------------------------------------------------------------------------
                                  Statistic      p-value
------------------------------------------------------------------------------
 Inverse chi-squared(88)   P        36.9601       1.0000
 Inverse normal            Z         6.8443       1.0000
 Inverse logit t(224)      L*        6.9721       1.0000
 Modified inv. chi-squared Pm       -3.8473       0.9999
------------------------------------------------------------------------------
 P statistic requires number of panels to be finite.
 Other statistics are suitable for finite or infinite number of panels.
------------------------------------------------------------------------------

. xtunitroot fisher error_ppu_ym_fe1, dfuller lags(4) drift
(19,276 missing values generated)

Fisher-type unit-root test for error_ppu_ym_fe1
Based on augmented Dickey-Fuller tests
-----------------------------------------------
Ho: All panels contain unit roots           Number of panels       =     44
Ha: At least one panel is stationary        Avg. number of periods = 105.68

AR parameter: Panel-specific                Asymptotics: T -> Infinity
Panel means:  Included
Time trend:   Not included
Drift term:   Included                      ADF regressions: 4 lags
------------------------------------------------------------------------------
                                  Statistic      p-value
------------------------------------------------------------------------------
 Inverse chi-squared(88)   P       192.0422       0.0000
 Inverse normal            Z        -7.1579       0.0000
 Inverse logit t(224)      L*       -7.1636       0.0000
 Modified inv. chi-squared Pm        7.8425       0.0000
------------------------------------------------------------------------------
 P statistic requires number of panels to be finite.
 Other statistics are suitable for finite or infinite number of panels.
------------------------------------------------------------------------------

. // se rechaza raiz unitaria en todos los paneles solo con drift
. 
. outreg2 using resultados/doc/est_xt_marcas ///
>                         , keep($varsRegStatic) bdec(3) nocons  tex(fragment) replace
resultados/doc/est_xt_marcas.tex
dir : seeout

. // *******************************************************
. // Camel
. xtreg ppu $varsRegStatic if marca == 2, fe

Fixed-effects (within) regression               Number of obs     =      3,207
Group variable: gr_marca_c~d                    Number of groups  =         36

R-sq:                                           Obs per group:
     within  = 0.8961                                         min =          1
     between = 0.9433                                         avg =       89.1
     overall = 0.8966                                         max =        124

                                                F(4,3167)         =    6824.91
corr(u_i, Xb)  = 0.1388                         Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .2194243   .0265174     8.27   0.000     .1674314    .2714173
       m1_21 |   .2242836   .0253712     8.84   0.000     .1745379    .2740294
          m1 |  -.0313217   .0069876    -4.48   0.000    -.0450224   -.0176209
          ym |   .0096396   .0000601   160.34   0.000     .0095218    .0097575
       _cons |  -4.071334   .0402278  -101.21   0.000    -4.150209   -3.992459
-------------+----------------------------------------------------------------
     sigma_u |  .06936554
     sigma_e |   .1047199
         rho |  .30495807   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(35, 3167) = 17.34                   Prob > F = 0.0000

. estimates store fixed2

. // xttest2 // : Error: too few common observations across panel.
. // cannot decide over
. //F test that all u_i=0: F(35, 3167) = 17.34                   Prob > F = 0.0000
. 
. xtreg ppu $varsRegStatic if marca == 2, re

Random-effects GLS regression                   Number of obs     =      3,207
Group variable: gr_marca_c~d                    Number of groups  =         36

R-sq:                                           Obs per group:
     within  = 0.8960                                         min =          1
     between = 0.9436                                         avg =       89.1
     overall = 0.8966                                         max =        124

                                                Wald chi2(4)      =   27724.89
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .2187006   .0266778     8.20   0.000     .1664131     .270988
       m1_21 |   .2332942   .0254826     9.16   0.000     .1833492    .2832392
          m1 |  -.0315594   .0070306    -4.49   0.000    -.0453391   -.0177796
          ym |    .009672   .0000599   161.34   0.000     .0095545    .0097895
       _cons |  -4.089519   .0406989  -100.48   0.000    -4.169287   -4.009751
-------------+----------------------------------------------------------------
     sigma_u |  .03812521
     sigma_e |   .1047199
         rho |  .11703354   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. estimates store random2

. xttest0 

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .1248839       .3533892
                       e |   .0109663       .1047199
                       u |   .0014535       .0381252

        Test:   Var(u) = 0
                             chibar2(01) =  2739.99
                          Prob > chibar2 =   0.0000

. // rechazar OLS
. * significance of random effects
. * Hausmann Test
. hausman fixed2 random2 

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed2      random2       Difference          S.E.
-------------+----------------------------------------------------------------
       m1_20 |    .2194243     .2187006        .0007238               .
       m1_21 |    .2242836     .2332942       -.0090106               .
          m1 |   -.0313217    -.0315594        .0002377               .
          ym |    .0096396      .009672       -.0000324        4.54e-06
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =       45.15
                Prob>chi2 =      0.0000
                (V_b-V_B is not positive definite)

. * significance of random effects
. * Hausmann Test
. // hausman consistent efficient
. // (V_b-V_B is not positive definite)
. // Hausman test becomes undefined.
. xtoverid 

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  37.351  Chi-sq(4)    P-value = 0.0000

. 
. // Rechazo efectos aleatorios
. // favorece efectos individuales fijos
. 
. // unitroot tests
. xtreg ppu $varsRegStatic if marca == 2, fe

Fixed-effects (within) regression               Number of obs     =      3,207
Group variable: gr_marca_c~d                    Number of groups  =         36

R-sq:                                           Obs per group:
     within  = 0.8961                                         min =          1
     between = 0.9433                                         avg =       89.1
     overall = 0.8966                                         max =        124

                                                F(4,3167)         =    6824.91
corr(u_i, Xb)  = 0.1388                         Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .2194243   .0265174     8.27   0.000     .1674314    .2714173
       m1_21 |   .2242836   .0253712     8.84   0.000     .1745379    .2740294
          m1 |  -.0313217   .0069876    -4.48   0.000    -.0450224   -.0176209
          ym |   .0096396   .0000601   160.34   0.000     .0095218    .0097575
       _cons |  -4.071334   .0402278  -101.21   0.000    -4.150209   -3.992459
-------------+----------------------------------------------------------------
     sigma_u |  .06936554
     sigma_e |   .1047199
         rho |  .30495807   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(35, 3167) = 17.34                   Prob > F = 0.0000

. predict error_ppu_ym_fe2, e
(20,719 missing values generated)

. 
. //xtreg ppu $varsRegStatic if marca == 1, re
. xtunitroot fisher error_ppu_ym_fe2, dfuller lags(4)
(20,719 missing values generated)
could not compute test for panel 22
could not compute test for panel 24

Fisher-type unit-root test for error_ppu_ym_fe2
Based on augmented Dickey-Fuller tests
-----------------------------------------------
Ho: All panels contain unit roots           Number of panels       =     36
Ha: At least one panel is stationary        Avg. number of periods =  89.08

AR parameter: Panel-specific                Asymptotics: T -> Infinity
Panel means:  Included
Time trend:   Not included
Drift term:   Not included                  ADF regressions: 4 lags
------------------------------------------------------------------------------
                                  Statistic      p-value
------------------------------------------------------------------------------
 Inverse chi-squared(68)   P        64.8947       0.5843
 Inverse normal            Z        -0.0742       0.4704
 Inverse logit t(174)      L*       -0.0393       0.4844
 Modified inv. chi-squared Pm       -0.2663       0.6050
------------------------------------------------------------------------------
 P statistic requires number of panels to be finite.
 Other statistics are suitable for finite or infinite number of panels.
------------------------------------------------------------------------------

. xtunitroot fisher error_ppu_ym_fe2, dfuller lags(4) trend
(20,719 missing values generated)
could not compute test for panel 22
could not compute test for panel 24

Fisher-type unit-root test for error_ppu_ym_fe2
Based on augmented Dickey-Fuller tests
-----------------------------------------------
Ho: All panels contain unit roots           Number of panels       =     36
Ha: At least one panel is stationary        Avg. number of periods =  89.08

AR parameter: Panel-specific                Asymptotics: T -> Infinity
Panel means:  Included
Time trend:   Included
Drift term:   Not included                  ADF regressions: 4 lags
------------------------------------------------------------------------------
                                  Statistic      p-value
------------------------------------------------------------------------------
 Inverse chi-squared(68)   P        62.2972       0.6721
 Inverse normal            Z         0.9147       0.8198
 Inverse logit t(174)      L*        1.0342       0.8488
 Modified inv. chi-squared Pm       -0.4890       0.6876
------------------------------------------------------------------------------
 P statistic requires number of panels to be finite.
 Other statistics are suitable for finite or infinite number of panels.
------------------------------------------------------------------------------

. xtunitroot fisher error_ppu_ym_fe2, dfuller lags(4) drift
(20,719 missing values generated)
could not compute test for panel 22
could not compute test for panel 24

Fisher-type unit-root test for error_ppu_ym_fe2
Based on augmented Dickey-Fuller tests
-----------------------------------------------
Ho: All panels contain unit roots           Number of panels       =     36
Ha: At least one panel is stationary        Avg. number of periods =  89.08

AR parameter: Panel-specific                Asymptotics: T -> Infinity
Panel means:  Included
Time trend:   Not included
Drift term:   Included                      ADF regressions: 4 lags
------------------------------------------------------------------------------
                                  Statistic      p-value
------------------------------------------------------------------------------
 Inverse chi-squared(68)   P       201.7424       0.0000
 Inverse normal            Z        -8.8526       0.0000
 Inverse logit t(174)      L*       -9.1315       0.0000
 Modified inv. chi-squared Pm       11.4683       0.0000
------------------------------------------------------------------------------
 P statistic requires number of panels to be finite.
 Other statistics are suitable for finite or infinite number of panels.
------------------------------------------------------------------------------

. // se rechaza raiz unitaria en todos los paneles solo con drift
. 
. // hausman favorece efectos individuales fijos
. xtreg ppu i.marca $varsRegStatic, fe
note: 2.marca omitted because of collinearity
note: 3.marca omitted because of collinearity
note: 4.marca omitted because of collinearity
note: 5.marca omitted because of collinearity
note: 6.marca omitted because of collinearity
note: 7.marca omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     23,926
Group variable: gr_marca_c~d                    Number of groups  =        263

R-sq:                                           Obs per group:
     within  = 0.8653                                         min =          1
     between = 0.3912                                         avg =       91.0
     overall = 0.6102                                         max =        124

                                                F(4,23659)        =   37986.77
corr(u_i, Xb)  = 0.0168                         Prob > F          =     0.0000

-------------------------------------------------------------------------------
          ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        marca |
       CAMEL  |          0  (omitted)
CHESTERFIELD  |          0  (omitted)
LUCKY STRIKE  |          0  (omitted)
    MARLBORO  |          0  (omitted)
     MONTANA  |          0  (omitted)
   PALL MALL  |          0  (omitted)
              |
        m1_20 |   .2016609   .0100701    20.03   0.000     .1819228    .2213989
        m1_21 |    .231927   .0101027    22.96   0.000      .212125     .251729
           m1 |  -.0227308   .0031237    -7.28   0.000    -.0288535   -.0166081
           ym |   .0094764   .0000252   375.86   0.000      .009427    .0095258
        _cons |  -4.138067   .0169615  -243.97   0.000    -4.171313   -4.104821
--------------+----------------------------------------------------------------
      sigma_u |  .26149618
      sigma_e |  .12569969
          rho |  .81230355   (fraction of variance due to u_i)
-------------------------------------------------------------------------------
F test that all u_i=0: F(262, 23659) = 347.90                Prob > F = 0.0000

. 
. outreg2 using resultados/doc/est_xt_marcas ///
>                         , keep($varsRegStatic) bdec(3) nocons  tex(fragment) append
resultados/doc/est_xt_marcas.tex
dir : seeout

. 
. 
. *xtunitroot fisher ppu, dfuller lags(4)
. 
. foreach number of numlist 3/7 {
  2.         di "`number'"
  3. 
. //      xtset cve_ciudad ym 
.         // gen dif_ppu = d.ppu
. 
.         //xtreg ppu m1_20 m1 ym, fe
.         xtreg ppu $varsRegStatic if marca == `number', fe
  4.         estimates store fixed`number'
  5. 
.         xtreg ppu $varsRegStatic if marca == `number', re
  6.         estimates store random`number'
  7.         xttest0 
  8.         * significance of random effects
.         * Hausmann Test
.         hausman fixed`number' random`number' 
  9.         xtoverid 
 10. }
3

Fixed-effects (within) regression               Number of obs     =      2,700
Group variable: gr_marca_c~d                    Number of groups  =         35

R-sq:                                           Obs per group:
     within  = 0.7168                                         min =          2
     between = 0.6827                                         avg =       77.1
     overall = 0.6964                                         max =        124

                                                F(4,2661)         =    1683.94
corr(u_i, Xb)  = 0.0454                         Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1916979   .0403999     4.75   0.000     .1124795    .2709163
       m1_21 |   .2695834   .0433001     6.23   0.000     .1846782    .3544886
          m1 |  -.0068015   .0107965    -0.63   0.529    -.0279718    .0143688
          ym |   .0074961   .0000948    79.11   0.000     .0073103    .0076819
       _cons |  -3.225041   .0632043   -51.03   0.000    -3.348976   -3.101107
-------------+----------------------------------------------------------------
     sigma_u |  .11906036
     sigma_e |  .14945555
         rho |  .38823512   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(34, 2661) = 31.64                   Prob > F = 0.0000

Random-effects GLS regression                   Number of obs     =      2,700
Group variable: gr_marca_c~d                    Number of groups  =         35

R-sq:                                           Obs per group:
     within  = 0.7168                                         min =          2
     between = 0.6828                                         avg =       77.1
     overall = 0.6964                                         max =        124

                                                Wald chi2(4)      =    6811.66
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |    .192009   .0403917     4.75   0.000     .1128427    .2711753
       m1_21 |   .2700436   .0432914     6.24   0.000     .1851941    .3548932
          m1 |  -.0065406   .0107913    -0.61   0.544    -.0276912      .01461
          ym |   .0074975   .0000943    79.54   0.000     .0073127    .0076822
       _cons |  -3.236431   .0656754   -49.28   0.000    -3.365152   -3.107709
-------------+----------------------------------------------------------------
     sigma_u |   .1151632
     sigma_e |  .14945555
         rho |  .37254887   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .1018784        .319184
                       e |    .022337       .1494555
                       u |   .0132626       .1151632

        Test:   Var(u) = 0
                             chibar2(01) =  6862.21
                          Prob > chibar2 =   0.0000

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed3      random3       Difference          S.E.
-------------+----------------------------------------------------------------
       m1_20 |    .1916979      .192009       -.0003111         .000815
       m1_21 |    .2695834     .2700436       -.0004603        .0008678
          m1 |   -.0068015    -.0065406       -.0002609        .0003328
          ym |    .0074961     .0074975       -1.36e-06        9.66e-06
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        1.82
                Prob>chi2 =      0.7688

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic   3.194  Chi-sq(4)    P-value = 0.5259
4

Fixed-effects (within) regression               Number of obs     =      3,213
Group variable: gr_marca_c~d                    Number of groups  =         38

R-sq:                                           Obs per group:
     within  = 0.7924                                         min =          3
     between = 0.7944                                         avg =       84.6
     overall = 0.7709                                         max =        124

                                                F(4,3171)         =    3025.56
corr(u_i, Xb)  = -0.0545                        Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |    .168581   .0304852     5.53   0.000     .1088083    .2283536
       m1_21 |   .2381791     .03004     7.93   0.000     .1792794    .2970789
          m1 |  -.0326064   .0089597    -3.64   0.000    -.0501738    -.015039
          ym |   .0080752   .0000761   106.05   0.000     .0079259    .0082245
       _cons |  -3.273626   .0511481   -64.00   0.000    -3.373912   -3.173339
-------------+----------------------------------------------------------------
     sigma_u |  .09637067
     sigma_e |  .13258868
         rho |  .34567626   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(37, 3171) = 32.60                   Prob > F = 0.0000

Random-effects GLS regression                   Number of obs     =      3,213
Group variable: gr_marca_c~d                    Number of groups  =         38

R-sq:                                           Obs per group:
     within  = 0.7924                                         min =          3
     between = 0.7945                                         avg =       84.6
     overall = 0.7709                                         max =        124

                                                Wald chi2(4)      =   12238.31
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1686574   .0305837     5.51   0.000     .1087144    .2286004
       m1_21 |   .2415191   .0301206     8.02   0.000     .1824837    .3005544
          m1 |  -.0328373    .008989    -3.65   0.000    -.0504554   -.0152193
          ym |   .0080715   .0000757   106.57   0.000      .007923    .0082199
       _cons |  -3.271524   .0522805   -62.58   0.000    -3.373992   -3.169056
-------------+----------------------------------------------------------------
     sigma_u |   .0696719
     sigma_e |  .13258868
         rho |  .21637641   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .1045925       .3234076
                       e |   .0175798       .1325887
                       u |   .0048542       .0696719

        Test:   Var(u) = 0
                             chibar2(01) = 12340.26
                          Prob > chibar2 =   0.0000

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed4      random4       Difference          S.E.
-------------+----------------------------------------------------------------
       m1_20 |     .168581     .1686574       -.0000764               .
       m1_21 |    .2381791     .2415191       -.0033399               .
          m1 |   -.0326064    -.0328373        .0002309               .
          ym |    .0080752     .0080715        3.70e-06        7.90e-06
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =    -2.33    chi2<0 ==> model fitted on these
                                        data fails to meet the asymptotic
                                        assumptions of the Hausman test;
                                        see suest for a generalized test

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  23.561  Chi-sq(4)    P-value = 0.0001
5

Fixed-effects (within) regression               Number of obs     =      5,539
Group variable: gr_marca_c~d                    Number of groups  =         46

R-sq:                                           Obs per group:
     within  = 0.9221                                         min =         60
     between = 0.6532                                         avg =      120.4
     overall = 0.9118                                         max =        124

                                                F(4,5489)         =   16232.96
corr(u_i, Xb)  = 0.0008                         Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .2320508    .017645    13.15   0.000     .1974596     .266642
       m1_21 |   .2370061   .0177253    13.37   0.000     .2022575    .2717547
          m1 |  -.0132276   .0057153    -2.31   0.021    -.0244318   -.0020233
          ym |    .010446   .0000427   244.78   0.000     .0103623    .0105296
       _cons |  -4.591275   .0287795  -159.53   0.000    -4.647694   -4.534855
-------------+----------------------------------------------------------------
     sigma_u |  .04457261
     sigma_e |  .10998329
         rho |  .14107163   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(45, 5489) = 19.89                   Prob > F = 0.0000

Random-effects GLS regression                   Number of obs     =      5,539
Group variable: gr_marca_c~d                    Number of groups  =         46

R-sq:                                           Obs per group:
     within  = 0.9221                                         min =         60
     between = 0.6532                                         avg =      120.4
     overall = 0.9118                                         max =        124

                                                Wald chi2(4)      =   65023.77
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .2320905   .0176434    13.15   0.000     .1975101    .2666709
       m1_21 |   .2370506   .0177237    13.37   0.000     .2023128    .2717883
          m1 |  -.0132319   .0057148    -2.32   0.021    -.0244326   -.0020311
          ym |   .0104456   .0000426   244.95   0.000      .010362    .0105291
       _cons |  -4.591977   .0294865  -155.73   0.000    -4.649769   -4.534184
-------------+----------------------------------------------------------------
     sigma_u |  .04393658
     sigma_e |  .10998329
         rho |  .13762441   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .1580871       .3976017
                       e |   .0120963       .1099833
                       u |   .0019304       .0439366

        Test:   Var(u) = 0
                             chibar2(01) =  5983.19
                          Prob > chibar2 =   0.0000

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed5      random5       Difference          S.E.
-------------+----------------------------------------------------------------
       m1_20 |    .2320508     .2320905       -.0000397        .0002398
       m1_21 |    .2370061     .2370506       -.0000445        .0002405
          m1 |   -.0132276    -.0132319        4.29e-06        .0000771
          ym |     .010446     .0104456        4.02e-07        1.61e-06
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        0.11
                Prob>chi2 =      0.9985

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic 174.922  Chi-sq(4)    P-value = 0.0000
6

Fixed-effects (within) regression               Number of obs     =      1,210
Group variable: gr_marca_c~d                    Number of groups  =         22

R-sq:                                           Obs per group:
     within  = 0.7520                                         min =          5
     between = 0.2221                                         avg =       55.0
     overall = 0.5991                                         max =        124

                                                F(4,1184)         =     897.61
corr(u_i, Xb)  = -0.1591                        Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1817536   .0478076     3.80   0.000     .0879566    .2755507
       m1_21 |   .1134725   .0480029     2.36   0.018     .0192923    .2076528
          m1 |  -.0231726   .0117926    -1.97   0.050    -.0463093   -.0000358
          ym |   .0062869   .0001086    57.87   0.000     .0060737       .0065
       _cons |  -2.358205   .0720377   -32.74   0.000     -2.49954   -2.216869
-------------+----------------------------------------------------------------
     sigma_u |   .1344163
     sigma_e |  .11241947
         rho |  .58841312   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(21, 1184) = 62.67                   Prob > F = 0.0000

Random-effects GLS regression                   Number of obs     =      1,210
Group variable: gr_marca_c~d                    Number of groups  =         22

R-sq:                                           Obs per group:
     within  = 0.7520                                         min =          5
     between = 0.2222                                         avg =       55.0
     overall = 0.5992                                         max =        124

                                                Wald chi2(4)      =    3526.66
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |    .183003   .0481751     3.80   0.000     .0885815    .2774245
       m1_21 |   .1170943   .0483708     2.42   0.015     .0222892    .2118994
          m1 |  -.0233693   .0118834    -1.97   0.049    -.0466603   -.0000782
          ym |    .006239   .0001088    57.33   0.000     .0060257    .0064523
       _cons |  -2.317601    .074473   -31.12   0.000    -2.463565   -2.171636
-------------+----------------------------------------------------------------
     sigma_u |  .09354005
     sigma_e |  .11241947
         rho |  .40909814   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .0652908       .2555207
                       e |   .0126381       .1124195
                       u |   .0087497         .09354

        Test:   Var(u) = 0
                             chibar2(01) = 12598.63
                          Prob > chibar2 =   0.0000

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed6      random6       Difference          S.E.
-------------+----------------------------------------------------------------
       m1_20 |    .1817536      .183003       -.0012494               .
       m1_21 |    .1134725     .1170943       -.0036217               .
          m1 |   -.0231726    -.0233693        .0001967               .
          ym |    .0062869      .006239        .0000479               .
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =   -60.47    chi2<0 ==> model fitted on these
                                        data fails to meet the asymptotic
                                        assumptions of the Hausman test;
                                        see suest for a generalized test

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  22.563  Chi-sq(4)    P-value = 0.0002
7

Fixed-effects (within) regression               Number of obs     =      3,407
Group variable: gr_marca_c~d                    Number of groups  =         42

R-sq:                                           Obs per group:
     within  = 0.8744                                         min =          2
     between = 0.7100                                         avg =       81.1
     overall = 0.8274                                         max =        124

                                                F(4,3361)         =    5851.28
corr(u_i, Xb)  = 0.0990                         Prob > F          =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1765415   .0237242     7.44   0.000     .1300262    .2230568
       m1_21 |   .2183845   .0236569     9.23   0.000     .1720011    .2647679
          m1 |  -.0451651   .0088763    -5.09   0.000    -.0625687   -.0277615
          ym |   .0101123   .0000685   147.55   0.000     .0099779    .0102467
       _cons |  -4.809371   .0466401  -103.12   0.000    -4.900817   -4.717925
-------------+----------------------------------------------------------------
     sigma_u |  .16230864
     sigma_e |  .12920808
         rho |  .61210072   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(41, 3361) = 68.29                   Prob > F = 0.0000

Random-effects GLS regression                   Number of obs     =      3,407
Group variable: gr_marca_c~d                    Number of groups  =         42

R-sq:                                           Obs per group:
     within  = 0.8744                                         min =          2
     between = 0.7101                                         avg =       81.1
     overall = 0.8274                                         max =        124

                                                Wald chi2(4)      =   23474.81
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1766807   .0237535     7.44   0.000     .1301247    .2232366
       m1_21 |   .2161707   .0236725     9.13   0.000     .1697735    .2625679
          m1 |  -.0448663   .0088857    -5.05   0.000    -.0622819   -.0274507
          ym |   .0101154   .0000685   147.74   0.000     .0099812    .0102496
       _cons |  -4.805295   .0517952   -92.77   0.000    -4.906812   -4.703778
-------------+----------------------------------------------------------------
     sigma_u |   .1392356
     sigma_e |  .12920808
         rho |  .53730223   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .1750033        .418334
                       e |   .0166947       .1292081
                       u |   .0193866       .1392356

        Test:   Var(u) = 0
                             chibar2(01) = 36450.63
                          Prob > chibar2 =   0.0000

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed7      random7       Difference          S.E.
-------------+----------------------------------------------------------------
       m1_20 |    .1765415     .1766807       -.0001392               .
       m1_21 |    .2183845     .2161707        .0022138               .
          m1 |   -.0451651    -.0448663       -.0002988               .
          ym |    .0101123     .0101154       -3.10e-06        2.99e-06
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =    -6.44    chi2<0 ==> model fitted on these
                                        data fails to meet the asymptotic
                                        assumptions of the Hausman test;
                                        see suest for a generalized test

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  14.155  Chi-sq(4)    P-value = 0.0068

. // F 
. // 3> F test that all u_i=0: F(34, 2661) = 31.64                   Prob > F = 0.0000
. // 4> F test that all u_i=0: F(37, 3171) = 32.60                   Prob > F = 0.0000
. // 5> F test that all u_i=0: F(45, 5489) = 19.89                   Prob > F = 0.0000
. // 6> F test that all u_i=0: F(21, 1184) = 62.67                   Prob > F = 0.0000
. // 7> F test that all u_i=0: F(41, 3361) = 68.29                   Prob > F = 0.0000
. 
. /* BP-LM
> // 3> chibar2(01) =  6862.21 
>         // Prob > chibar2 =   0.0000
> // 4>     chibar2(01) = 12340.26
>         // Prob > chibar2 =   0.0000
> // 5> chibar2(01) =  5983.19
>                           Prob > chibar2 =   0.0000
> // 6> chibar2(01) = 12598.63
>                           Prob > chibar2 =   0.0000
> // 7>  chibar2(01) = 36450.63
>                           Prob > chibar2 =   0.0000
> */
. 
. // Hausman
. // 3> chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
.     //                    =        1.82
.     //            Prob>chi2 =      0.7688
. /* 
> Test of overidentifying restrictions: fixed vs random effects
> Cross-section time-series model: xtreg re   
> Sargan-Hansen statistic   3.194  Chi-sq(4)    P-value = 0.5259
> */
.         
. // 4>      =    -2.33  
. /*  chi2<0 ==> model fitted on these
>                                         data fails to meet the asymptotic
>                                         assumptions of the Hausman test;
>                                         see suest for a generalized test*/
. 
. // 5> chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
.         //      =        0.11
.     //  Prob>chi2 =      0.9985
. /*
> Test of overidentifying restrictions: fixed vs random effects
> Cross-section time-series model: xtreg re   
> Sargan-Hansen statistic 174.922  Chi-sq(4)    P-value = 0.0000
> */
. 
. // 6>  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
. /*                          =   -60.47    chi2<0 ==> model fitted on these
>                                         data fails to meet the asymptotic
>                                         assumptions of the Hausman test;
>                                         see suest for a generalized test*/
. 
. // 7>  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
. /*                          =    -6.44    chi2<0 ==> model fitted on these
>                                         data fails to meet the asymptotic
>                                         assumptions of the Hausman test;
>                                         see suest for a generalized test */
. foreach number of numlist 4 6 7 {
  2.         di "`number'"
  3. 
.         xtreg ppu $varsRegStatic if marca == `number', re
  4.         xtoverid 
  5. 
. }
4

Random-effects GLS regression                   Number of obs     =      3,213
Group variable: gr_marca_c~d                    Number of groups  =         38

R-sq:                                           Obs per group:
     within  = 0.7924                                         min =          3
     between = 0.7945                                         avg =       84.6
     overall = 0.7709                                         max =        124

                                                Wald chi2(4)      =   12238.31
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1686574   .0305837     5.51   0.000     .1087144    .2286004
       m1_21 |   .2415191   .0301206     8.02   0.000     .1824837    .3005544
          m1 |  -.0328373    .008989    -3.65   0.000    -.0504554   -.0152193
          ym |   .0080715   .0000757   106.57   0.000      .007923    .0082199
       _cons |  -3.271524   .0522805   -62.58   0.000    -3.373992   -3.169056
-------------+----------------------------------------------------------------
     sigma_u |   .0696719
     sigma_e |  .13258868
         rho |  .21637641   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  23.561  Chi-sq(4)    P-value = 0.0001
6

Random-effects GLS regression                   Number of obs     =      1,210
Group variable: gr_marca_c~d                    Number of groups  =         22

R-sq:                                           Obs per group:
     within  = 0.7520                                         min =          5
     between = 0.2222                                         avg =       55.0
     overall = 0.5992                                         max =        124

                                                Wald chi2(4)      =    3526.66
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |    .183003   .0481751     3.80   0.000     .0885815    .2774245
       m1_21 |   .1170943   .0483708     2.42   0.015     .0222892    .2118994
          m1 |  -.0233693   .0118834    -1.97   0.049    -.0466603   -.0000782
          ym |    .006239   .0001088    57.33   0.000     .0060257    .0064523
       _cons |  -2.317601    .074473   -31.12   0.000    -2.463565   -2.171636
-------------+----------------------------------------------------------------
     sigma_u |  .09354005
     sigma_e |  .11241947
         rho |  .40909814   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  22.563  Chi-sq(4)    P-value = 0.0002
7

Random-effects GLS regression                   Number of obs     =      3,407
Group variable: gr_marca_c~d                    Number of groups  =         42

R-sq:                                           Obs per group:
     within  = 0.8744                                         min =          2
     between = 0.7101                                         avg =       81.1
     overall = 0.8274                                         max =        124

                                                Wald chi2(4)      =   23474.81
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .1766807   .0237535     7.44   0.000     .1301247    .2232366
       m1_21 |   .2161707   .0236725     9.13   0.000     .1697735    .2625679
          m1 |  -.0448663   .0088857    -5.05   0.000    -.0622819   -.0274507
          ym |   .0101154   .0000685   147.74   0.000     .0099812    .0102496
       _cons |  -4.805295   .0517952   -92.77   0.000    -4.906812   -4.703778
-------------+----------------------------------------------------------------
     sigma_u |   .1392356
     sigma_e |  .12920808
         rho |  .53730223   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re   
Sargan-Hansen statistic  14.155  Chi-sq(4)    P-value = 0.0068

. /* 4: 
> Test of overidentifying restrictions: fixed vs random effects
> Cross-section time-series model: xtreg re   
> Sargan-Hansen statistic  23.561  Chi-sq(4)    P-value = 0.0001
> : Fijos
> 6:
> Sargan-Hansen statistic  22.563  Chi-sq(4)    P-value = 0.0002
> : Fijos
> 7:
> Sargan-Hansen statistic  14.155  Chi-sq(4)    P-value = 0.0068
> : Fijos
> */
. foreach number of numlist 5 {
  2.         di "`number'"
  3. 
.         xtreg ppu $varsRegStatic if marca == `number', fe cluster(gr_marca_ciudad)
  4.         estimates store fixed`number'
  5. 
. 
.         xtreg ppu $varsRegStatic if marca == `number', re cluster(gr_marca_ciudad)
  6.         estimates store random`number'
  7.         xttest0 
  8. 
.         xtoverid 
  9. }
5

Fixed-effects (within) regression               Number of obs     =      5,539
Group variable: gr_marca_c~d                    Number of groups  =         46

R-sq:                                           Obs per group:
     within  = 0.9221                                         min =         60
     between = 0.6532                                         avg =      120.4
     overall = 0.9118                                         max =        124

                                                F(4,45)           =    3290.39
corr(u_i, Xb)  = 0.0008                         Prob > F          =     0.0000

                       (Std. Err. adjusted for 46 clusters in gr_marca_ciudad)
------------------------------------------------------------------------------
             |               Robust
         ppu |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .2320508   .0124817    18.59   0.000     .2069113    .2571903
       m1_21 |   .2370061   .0089223    26.56   0.000     .2190356    .2549765
          m1 |  -.0132276   .0019488    -6.79   0.000    -.0171527   -.0093025
          ym |    .010446   .0001188    87.93   0.000     .0102067    .0106852
       _cons |  -4.591275   .0799755   -57.41   0.000    -4.752354   -4.430196
-------------+----------------------------------------------------------------
     sigma_u |  .04457261
     sigma_e |  .10998329
         rho |  .14107163   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Random-effects GLS regression                   Number of obs     =      5,539
Group variable: gr_marca_c~d                    Number of groups  =         46

R-sq:                                           Obs per group:
     within  = 0.9221                                         min =         60
     between = 0.6532                                         avg =      120.4
     overall = 0.9118                                         max =        124

                                                Wald chi2(4)      =   13301.29
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                       (Std. Err. adjusted for 46 clusters in gr_marca_ciudad)
------------------------------------------------------------------------------
             |               Robust
         ppu |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       m1_20 |   .2320905   .0124835    18.59   0.000     .2076233    .2565578
       m1_21 |   .2370506    .008929    26.55   0.000     .2195502     .254551
          m1 |  -.0132319   .0019487    -6.79   0.000    -.0170512   -.0094125
          ym |   .0104456   .0001183    88.27   0.000     .0102136    .0106775
       _cons |  -4.591977   .0766965   -59.87   0.000    -4.742299   -4.441654
-------------+----------------------------------------------------------------
     sigma_u |  .04393658
     sigma_e |  .10998329
         rho |  .13762441   (fraction of variance due to u_i)
------------------------------------------------------------------------------

Breusch and Pagan Lagrangian multiplier test for random effects

        ppu[gr_marca_ciudad,t] = Xb + u[gr_marca_ciudad] + e[gr_marca_ciudad,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                     ppu |   .1580871       .3976017
                       e |   .0120963       .1099833
                       u |   .0019304       .0439366

        Test:   Var(u) = 0
                             chibar2(01) =  5983.19
                          Prob > chibar2 =   0.0000

Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re  robust cluster(gr_marca_ciudad)
Sargan-Hansen statistic 356.141  Chi-sq(4)    P-value = 0.0000

.                                 
. log close
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados/est_xtreg_pooled_f
> e_re.log
  log type:  text
 closed on:  22 Jul 2021, 13:44:20
---------------------------------------------------------------------------------------------------
