---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados/est_xtreg_means_ma
> rcas_ciudades.log
  log type:  text
 opened on:   8 Jul 2021, 00:41:10

. 
. // "ym L.ppu"
. global varsRegConsistent "dm_m1_20_cm dm_m1_21_cm dm_m1_cm "

. 
. use datos/prelim/de_inpc/panel_marca_ciudad.dta, clear

. 
. // means by "spell": combinations of worker and firm, over time
. // (they do not coincide in time)
. // here combinations of brand and city, over time
. // mean_var_
. egen m_ppu_cm = mean(ppu), by(cve_ marca)

. gen dm_ppu_cm = ppu - m_ppu_cm

. 
. foreach var of varlist m1_20 m1 ym m1_21 {
  2.         egen m_`var'_cm = mean(`var'), by(cve_ marca)
  3.         gen dm_`var'_cm = `var' - m_`var'_cm
  4. }

. 
. // the city and brand effects are not considered 
. // simple time dummies
. xtreg dm_ppu_cm $varsRegConsistent i.ym, fe
note: 720.ym omitted because of collinearity
note: 732.ym omitted because of collinearity
note: 735.ym omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     23,926
Group variable: gr_marca_c~d                    Number of groups  =        263

R-sq:                                           Obs per group:
     within  = 0.9355                                         min =          1
     between = 0.0064                                         avg =       91.0
     overall = 0.8294                                         max =        124

                                                F(123,23540)      =    2777.61
corr(u_i, Xb)  = -0.3369                        Prob > F          =     0.0000

------------------------------------------------------------------------------
   dm_ppu_cm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 dm_m1_20_cm |   1.109592   .0090818   122.18   0.000     1.091791    1.127393
 dm_m1_21_cm |   1.257874   .0090775   138.57   0.000     1.240081    1.275666
    dm_m1_cm |  -1.315639   .0091891  -143.17   0.000     -1.33365   -1.297628
             |
          ym |
        613  |  -1.303107   .0091891  -141.81   0.000    -1.321118   -1.285095
        614  |  -1.299536   .0091783  -141.59   0.000    -1.317526   -1.281546
        615  |  -1.300755   .0091678  -141.88   0.000    -1.318724   -1.282785
        616  |   -1.30004   .0091678  -141.81   0.000    -1.318009    -1.28207
        617  |  -1.298999   .0091571  -141.86   0.000    -1.316947    -1.28105
        618  |  -1.297818   .0091658  -141.59   0.000    -1.315784   -1.279853
        619  |  -1.298158   .0091658  -141.63   0.000    -1.316124   -1.280193
        620  |  -1.298273   .0091551  -141.81   0.000    -1.316218   -1.280329
        621  |  -1.297848   .0091552  -141.76   0.000    -1.315793   -1.279904
        622  |  -1.300558   .0091538  -142.08   0.000      -1.3185   -1.282616
        623  |  -1.300628   .0091645  -141.92   0.000    -1.318591   -1.282665
        624  |   .0257802   .0087657     2.94   0.003     .0085988    .0429616
        625  |  -1.213785   .0091645  -132.44   0.000    -1.231748   -1.195822
        626  |  -1.206994   .0091645  -131.70   0.000    -1.224957   -1.189031
        627  |  -1.208298    .009164  -131.85   0.000     -1.22626   -1.190336
        628  |  -1.208578    .009164  -131.88   0.000     -1.22654   -1.190616
        629  |  -1.210741   .0091645  -132.11   0.000    -1.228704   -1.192778
        630  |  -1.214034   .0091539  -132.63   0.000    -1.231977   -1.196092
        631  |  -1.214486   .0091539  -132.67   0.000    -1.232428   -1.196544
        632  |  -1.215061   .0091433  -132.89   0.000    -1.232982   -1.197139
        633  |  -1.214124   .0091433  -132.79   0.000    -1.232045   -1.196202
        634  |  -1.214994   .0091433  -132.88   0.000    -1.232916   -1.197073
        635  |   -1.21528   .0091433  -132.91   0.000    -1.233202   -1.197359
        636  |   .1159103   .0087455    13.25   0.000     .0987686     .133052
        637  |  -1.137957   .0091433  -124.46   0.000    -1.155878   -1.120035
        638  |  -1.131201   .0091534  -123.58   0.000    -1.149143    -1.11326
        639  |  -1.130965   .0091527  -123.57   0.000    -1.148905   -1.113025
        640  |  -1.131326   .0091527  -123.61   0.000    -1.149266   -1.113386
        641  |  -1.131311   .0091527  -123.60   0.000    -1.149251   -1.113371
        642  |  -1.132893   .0091525  -123.78   0.000    -1.150833   -1.114954
        643  |  -1.132467   .0091525  -123.73   0.000    -1.150406   -1.114527
        644  |   -1.13255   .0091422  -123.88   0.000    -1.150469   -1.114631
        645  |  -1.134557   .0091422  -124.10   0.000    -1.152476   -1.116638
        646  |  -1.132756   .0091422  -123.90   0.000    -1.150675   -1.114836
        647  |  -1.128517   .0091422  -123.44   0.000    -1.146436   -1.110597
        648  |   .2689492   .0087489    30.74   0.000     .2518009    .2860976
        649  |   -1.01788   .0090838  -112.05   0.000    -1.035685   -1.000075
        650  |  -1.015388   .0090857  -111.76   0.000    -1.033196   -.9975792
        651  |  -1.012332   .0090852  -111.43   0.000     -1.03014   -.9945244
        652  |  -1.010559   .0090852  -111.23   0.000    -1.028367   -.9927515
        653  |  -1.009909   .0090853  -111.16   0.000    -1.027717   -.9921012
        654  |  -1.010475   .0090871  -111.20   0.000    -1.028286   -.9926632
        655  |  -1.007763   .0090869  -110.90   0.000    -1.025574   -.9899519
        656  |  -1.008892   .0090966  -110.91   0.000    -1.026722   -.9910623
        657  |  -1.007653   .0091051  -110.67   0.000      -1.0255   -.9898064
        658  |  -1.007961   .0091051  -110.70   0.000    -1.025807   -.9901142
        659  |  -1.007293   .0091231  -110.41   0.000    -1.025175   -.9894112
        660  |    .344721   .0087309    39.48   0.000     .3276078    .3618342
        661  |  -.9307424   .0091318  -101.92   0.000    -.9486414   -.9128434
        662  |  -.9217887   .0091509  -100.73   0.000     -.939725   -.9038523
        663  |  -.9262547   .0091503  -101.23   0.000    -.9441899   -.9083195
        664  |  -.9226848   .0091408  -100.94   0.000    -.9406013   -.9047682
        665  |   -.921491   .0091511  -100.70   0.000    -.9394277   -.9035543
        666  |  -.9204104   .0091399  -100.70   0.000    -.9383253   -.9024955
        667  |  -.9200373   .0091399  -100.66   0.000    -.9379521   -.9021224
        668  |  -.9192054   .0091301  -100.68   0.000    -.9371009   -.9013098
        669  |  -.9181897   .0091301  -100.57   0.000    -.9360852   -.9002942
        670  |  -.9185023   .0091197  -100.72   0.000    -.9363775   -.9006271
        671  |    -.91672     .00915  -100.19   0.000    -.9346545   -.8987854
        672  |   .3984357   .0087641    45.46   0.000     .3812574    .4156139
        673  |  -.9147639   .0091602   -99.86   0.000    -.9327186   -.8968093
        674  |  -.9130483   .0091495   -99.79   0.000     -.930982   -.8951146
        675  |  -.9156487   .0091389  -100.19   0.000    -.9335616   -.8977358
        676  |  -.9132381   .0091485   -99.82   0.000    -.9311697   -.8953065
        677  |  -.9134256   .0091485   -99.84   0.000    -.9313572    -.895494
        678  |  -.9136495   .0091591   -99.75   0.000    -.9316019   -.8956971
        679  |   -.896698   .0091591   -97.90   0.000    -.9146505   -.8787456
        680  |  -.8635922   .0091591   -94.29   0.000    -.8815447   -.8456398
        681  |   -.861903   .0091803   -93.89   0.000     -.879897    -.843909
        682  |   -.859474   .0091909   -93.51   0.000    -.8774888   -.8414593
        683  |  -.8581936   .0092019   -93.26   0.000      -.87623   -.8401573
        684  |   .4797193   .0088206    54.39   0.000     .4624303    .4970083
        685  |  -.8179813   .0091914   -88.99   0.000    -.8359971   -.7999655
        686  |  -.8146878   .0091799   -88.75   0.000     -.832681   -.7966947
        687  |  -.8119929    .009191   -88.35   0.000    -.8300079    -.793978
        688  |  -.8092818   .0091914   -88.05   0.000    -.8272975   -.7912661
        689  |  -.8097119   .0091924   -88.09   0.000    -.8277295   -.7916943
        690  |  -.7899888   .0091814   -86.04   0.000     -.807985   -.7719926
        691  |  -.7670996   .0091924   -83.45   0.000    -.7851173   -.7490819
        692  |  -.7625979   .0091924   -82.96   0.000    -.7806156   -.7445802
        693  |  -.7631749   .0091828   -83.11   0.000    -.7811737   -.7451761
        694  |  -.7602566   .0091828   -82.79   0.000    -.7782554   -.7422578
        695  |  -.7601273   .0092044   -82.58   0.000    -.7781686   -.7420861
        696  |   .6025685   .0088232    68.29   0.000     .5852744    .6198626
        697  |  -.6806078   .0092258   -73.77   0.000    -.6986909   -.6625247
        698  |  -.6741061   .0092258   -73.07   0.000    -.6921892    -.656023
        699  |  -.6701602   .0092371   -72.55   0.000    -.6882655   -.6520549
        700  |  -.6708637   .0092292   -72.69   0.000    -.6889536   -.6527738
        701  |  -.6521455   .0092292   -70.66   0.000    -.6702354   -.6340556
        702  |  -.6317508   .0092403   -68.37   0.000    -.6498623   -.6136392
        703  |   -.625493   .0095135   -65.75   0.000      -.64414   -.6068459
        704  |  -.6321862   .0094851   -66.65   0.000    -.6507776   -.6135948
        705  |  -.6286927   .0094576   -66.47   0.000    -.6472303   -.6101552
        706  |  -.6164985   .0094431   -65.29   0.000    -.6350075   -.5979895
        707  |  -.6149252   .0094164   -65.30   0.000     -.633382   -.5964685
        708  |   .7315007    .009066    80.69   0.000     .7137307    .7492707
        709  |  -.5495272   .0094294   -58.28   0.000    -.5680094    -.531045
        710  |  -.5346421    .009415   -56.79   0.000    -.5530961   -.5161881
        711  |  -.5253929    .009415   -55.80   0.000    -.5438468   -.5069389
        712  |  -.5257032    .009415   -55.84   0.000    -.5441572   -.5072493
        713  |  -.5247803    .009415   -55.74   0.000    -.5432343   -.5063263
        714  |  -.4824664    .009415   -51.24   0.000    -.5009203   -.4640124
        715  |  -.4426732   .0094149   -47.02   0.000     -.461127   -.4242193
        716  |  -.4306641   .0094146   -45.74   0.000    -.4491174   -.4122108
        717  |  -.4243969   .0094276   -45.02   0.000    -.4428756   -.4059182
        718  |  -.4244001   .0094404   -44.96   0.000    -.4429039   -.4058963
        719  |   -.421301    .009427   -44.69   0.000    -.4397785   -.4028234
        720  |          0  (omitted)
        721  |  -.1555846   .0094135   -16.53   0.000    -.1740357   -.1371334
        722  |  -.1437121   .0094262   -15.25   0.000     -.162188   -.1252362
        723  |  -.1416632   .0094129   -15.05   0.000    -.1601131   -.1232133
        724  |  -.1412361   .0094129   -15.00   0.000     -.159686   -.1227862
        725  |  -.1396177   .0094129   -14.83   0.000    -.1580676   -.1211678
        726  |  -.1374168   .0094129   -14.60   0.000    -.1558667   -.1189669
        727  |  -.1353284   .0094259   -14.36   0.000    -.1538038   -.1168531
        728  |  -.1324928    .009437   -14.04   0.000    -.1509899   -.1139956
        729  |  -.1312547   .0094252   -13.93   0.000    -.1497287   -.1127807
        730  |  -.1275187   .0094091   -13.55   0.000    -.1459611   -.1090763
        731  |  -.1296463   .0094221   -13.76   0.000    -.1481142   -.1111783
        732  |          0  (omitted)
        733  |   -.015128   .0094854    -1.59   0.111      -.03372     .003464
        734  |  -.0042251   .0094993    -0.44   0.656    -.0228443    .0143941
        735  |          0  (omitted)
             |
       _cons |   .7491578   .0061703   121.41   0.000     .7370636    .7612519
-------------+----------------------------------------------------------------
     sigma_u |  .18792192
     sigma_e |  .08716594
         rho |  .82294454   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(262, 23540) = 142.87                Prob > F = 0.0000

. // R: fixed effects (city with brand)
. // meaning of the coefficient for m1_20 (1.12)?
. 
. // single time trend (mean-diff)
. xtreg dm_ppu_cm $varsRegConsistent dm_ym_cm, fe

Fixed-effects (within) regression               Number of obs     =     23,926
Group variable: gr_marca_c~d                    Number of groups  =        263

R-sq:                                           Obs per group:
     within  = 0.8653                                         min =          1
     between = 0.0004                                         avg =       91.0
     overall = 0.8653                                         max =        124

                                                F(4,23659)        =   37986.77
corr(u_i, Xb)  = -0.0000                        Prob > F          =     0.0000

------------------------------------------------------------------------------
   dm_ppu_cm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 dm_m1_20_cm |   .2016609   .0100701    20.03   0.000     .1819228    .2213989
 dm_m1_21_cm |    .231927   .0101027    22.96   0.000      .212125     .251729
    dm_m1_cm |  -.0227308   .0031237    -7.28   0.000    -.0288535   -.0166081
    dm_ym_cm |   .0094764   .0000252   375.86   0.000      .009427    .0095258
       _cons |   3.18e-09   .0008126     0.00   1.000    -.0015928    .0015928
-------------+----------------------------------------------------------------
     sigma_u |  8.984e-08
     sigma_e |  .12569969
         rho |  5.108e-13   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(262, 23659) = 0.00                  Prob > F = 1.0000

. // R: fixed effects are NOT relevant
. // the coefficient for m1_20 
. 
. // single time trend (no mean-diff)
. xtreg dm_ppu_cm $varsRegConsistent ym, fe

Fixed-effects (within) regression               Number of obs     =     23,926
Group variable: gr_marca_c~d                    Number of groups  =        263

R-sq:                                           Obs per group:
     within  = 0.8653                                         min =          1
     between = 0.0037                                         avg =       91.0
     overall = 0.7528                                         max =        124

                                                F(4,23659)        =   37986.77
corr(u_i, Xb)  = -0.3606                        Prob > F          =     0.0000

------------------------------------------------------------------------------
   dm_ppu_cm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 dm_m1_20_cm |   .2016609   .0100701    20.03   0.000     .1819228    .2213989
 dm_m1_21_cm |    .231927   .0101027    22.96   0.000      .212125     .251729
    dm_m1_cm |  -.0227308   .0031237    -7.28   0.000    -.0288535   -.0166081
          ym |   .0094764   .0000252   375.86   0.000      .009427    .0095258
       _cons |  -6.365952   .0169564  -375.43   0.000    -6.399187   -6.332716
-------------+----------------------------------------------------------------
     sigma_u |   .1973808
     sigma_e |  .12569969
         rho |  .71145855   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(262, 23659) = 74.68                 Prob > F = 0.0000

. // R: fixed effects are relevant
. // the coefficient for m1_20 in the same range as previous estimation
. // outreg
. outreg2 using resultados/doc/est_xt_dm ///
>                         , keep($varsRegConsistent  ym) bdec(3) nocons  tex(fragment) replace
resultados/doc/est_xt_dm.tex
dir : seeout

. 
. // por marca
. xtreg dm_ppu_cm dm_m1_cm i.marca##c.dm_m1_20_cm i.marca##c.dm_m1_21_cm ym, fe
note: 2.marca omitted because of collinearity
note: 3.marca omitted because of collinearity
note: 4.marca omitted because of collinearity
note: 5.marca omitted because of collinearity
note: 6.marca omitted because of collinearity
note: 7.marca omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     23,926
Group variable: gr_marca_c~d                    Number of groups  =        263

R-sq:                                           Obs per group:
     within  = 0.8659                                         min =          1
     between = 0.0037                                         avg =       91.0
     overall = 0.7534                                         max =        124

                                                F(16,23647)       =    9546.61
corr(u_i, Xb)  = -0.3604                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
          dm_ppu_cm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           dm_m1_cm |  -.0227221   .0031168    -7.29   0.000    -.0288312   -.0166131
                    |
              marca |
             CAMEL  |          0  (omitted)
      CHESTERFIELD  |          0  (omitted)
      LUCKY STRIKE  |          0  (omitted)
          MARLBORO  |          0  (omitted)
           MONTANA  |          0  (omitted)
         PALL MALL  |          0  (omitted)
                    |
        dm_m1_20_cm |   .2298712   .0209702    10.96   0.000     .1887683    .2709741
                    |
marca#c.dm_m1_20_cm |
             CAMEL  |  -.0114617   .0369437    -0.31   0.756    -.0838736    .0609503
      CHESTERFIELD  |  -.1078418    .038624    -2.79   0.005    -.1835473   -.0321363
      LUCKY STRIKE  |  -.1244611   .0344573    -3.61   0.000    -.1919997   -.0569225
          MARLBORO  |   .0562942   .0281105     2.00   0.045     .0011959    .1113925
           MONTANA  |  -.1906121   .0555605    -3.43   0.001    -.2995144   -.0817099
         PALL MALL  |  -.0530029   .0297661    -1.78   0.075    -.1113464    .0053405
                    |
        dm_m1_21_cm |    .275461   .0212739    12.95   0.000     .2337628    .3171591
                    |
marca#c.dm_m1_21_cm |
             CAMEL  |  -.0507821   .0358608    -1.42   0.157    -.1210716    .0195074
      CHESTERFIELD  |   -.101087   .0408095    -2.48   0.013    -.1810763   -.0210978
      LUCKY STRIKE  |   -.117571   .0341781    -3.44   0.001    -.1845623   -.0505797
          MARLBORO  |   .0273098   .0283224     0.96   0.335    -.0282038    .0828234
           MONTANA  |  -.3641026   .0555765    -6.55   0.000     -.473036   -.2551691
         PALL MALL  |  -.0507938    .029838    -1.70   0.089    -.1092781    .0076906
                    |
                 ym |   .0094751   .0000252   376.58   0.000     .0094258    .0095244
              _cons |  -6.365094   .0169217  -376.15   0.000    -6.398261   -6.331926
--------------------+----------------------------------------------------------------
            sigma_u |   .1973542
            sigma_e |  .12541906
                rho |   .7123201   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(262, 23647) = 74.99                 Prob > F = 0.0000

. outreg2 using resultados/doc/est_xt_dm ///
>                         , keep($varsRegConsistent  ym) bdec(3) nocons  tex(fragment) append
resultados/doc/est_xt_dm.tex
dir : seeout

. // includes dm_m1_20 
. testparm i.marca##c.dm_m1_20 

 ( 1)  dm_m1_20_cm = 0
 ( 2)  2.marca#c.dm_m1_20_cm = 0
 ( 3)  3.marca#c.dm_m1_20_cm = 0
 ( 4)  4.marca#c.dm_m1_20_cm = 0
 ( 5)  5.marca#c.dm_m1_20_cm = 0
 ( 6)  6.marca#c.dm_m1_20_cm = 0
 ( 7)  7.marca#c.dm_m1_20_cm = 0

       F(  7, 23647) =   64.89
            Prob > F =    0.0000

. testparm i.marca##c.dm_m1_21 

 ( 1)  dm_m1_21_cm = 0
 ( 2)  2.marca#c.dm_m1_21_cm = 0
 ( 3)  3.marca#c.dm_m1_21_cm = 0
 ( 4)  4.marca#c.dm_m1_21_cm = 0
 ( 5)  5.marca#c.dm_m1_21_cm = 0
 ( 6)  6.marca#c.dm_m1_21_cm = 0
 ( 7)  7.marca#c.dm_m1_21_cm = 0

       F(  7, 23647) =   85.28
            Prob > F =    0.0000

. // exclude dm_m1_20 
. testparm i.marca#c.dm_m1_20 

 ( 1)  2.marca#c.dm_m1_20_cm = 0
 ( 2)  3.marca#c.dm_m1_20_cm = 0
 ( 3)  4.marca#c.dm_m1_20_cm = 0
 ( 4)  5.marca#c.dm_m1_20_cm = 0
 ( 5)  6.marca#c.dm_m1_20_cm = 0
 ( 6)  7.marca#c.dm_m1_20_cm = 0

       F(  6, 23647) =    8.57
            Prob > F =    0.0000

. testparm i.marca#c.dm_m1_21

 ( 1)  2.marca#c.dm_m1_21_cm = 0
 ( 2)  3.marca#c.dm_m1_21_cm = 0
 ( 3)  4.marca#c.dm_m1_21_cm = 0
 ( 4)  5.marca#c.dm_m1_21_cm = 0
 ( 5)  6.marca#c.dm_m1_21_cm = 0
 ( 6)  7.marca#c.dm_m1_21_cm = 0

       F(  6, 23647) =   11.24
            Prob > F =    0.0000

. testparm i.marca#c.dm_m1_20 i.marca#c.dm_m1_21

 ( 1)  2.marca#c.dm_m1_20_cm = 0
 ( 2)  3.marca#c.dm_m1_20_cm = 0
 ( 3)  4.marca#c.dm_m1_20_cm = 0
 ( 4)  5.marca#c.dm_m1_20_cm = 0
 ( 5)  6.marca#c.dm_m1_20_cm = 0
 ( 6)  7.marca#c.dm_m1_20_cm = 0
 ( 7)  2.marca#c.dm_m1_21_cm = 0
 ( 8)  3.marca#c.dm_m1_21_cm = 0
 ( 9)  4.marca#c.dm_m1_21_cm = 0
 (10)  5.marca#c.dm_m1_21_cm = 0
 (11)  6.marca#c.dm_m1_21_cm = 0
 (12)  7.marca#c.dm_m1_21_cm = 0

       F( 12, 23647) =    9.83
            Prob > F =    0.0000

. 
. // premium 
. testparm 2.marca#c.dm_m1_20 5.marca#c.dm_m1_20

 ( 1)  2.marca#c.dm_m1_20_cm = 0
 ( 2)  5.marca#c.dm_m1_20_cm = 0

       F(  2, 23647) =    2.79
            Prob > F =    0.0616

. testparm 2.marca#c.dm_m1_21 5.marca#c.dm_m1_21

 ( 1)  2.marca#c.dm_m1_21_cm = 0
 ( 2)  5.marca#c.dm_m1_21_cm = 0

       F(  2, 23647) =    2.54
            Prob > F =    0.0787

. 
. // separar las estimaciones por marca
. xtreg dm_ppu_cm dm_m1_cm i.marca#c.dm_m1_20_cm i.marca#c.dm_m1_21_cm ym, fe

Fixed-effects (within) regression               Number of obs     =     23,926
Group variable: gr_marca_c~d                    Number of groups  =        263

R-sq:                                           Obs per group:
     within  = 0.8659                                         min =          1
     between = 0.0037                                         avg =       91.0
     overall = 0.7534                                         max =        124

                                                F(16,23647)       =    9546.61
corr(u_i, Xb)  = -0.3604                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
          dm_ppu_cm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           dm_m1_cm |  -.0227221   .0031168    -7.29   0.000    -.0288312   -.0166131
                    |
marca#c.dm_m1_20_cm |
   BENSON & HEDGES  |   .2298712   .0209702    10.96   0.000     .1887683    .2709741
             CAMEL  |   .2184096   .0307456     7.10   0.000     .1581462    .2786729
      CHESTERFIELD  |   .1220295   .0327459     3.73   0.000     .0578455    .1862134
      LUCKY STRIKE  |   .1054101   .0277045     3.80   0.000     .0511075    .1597127
          MARLBORO  |   .2861654   .0192572    14.86   0.000       .24842    .3239108
           MONTANA  |   .0392591   .0516475     0.76   0.447    -.0619733    .1404915
         PALL MALL  |   .1768683   .0215873     8.19   0.000     .1345557    .2191809
                    |
marca#c.dm_m1_21_cm |
   BENSON & HEDGES  |    .275461   .0212739    12.95   0.000     .2337628    .3171591
             CAMEL  |   .2246789   .0292439     7.68   0.000      .167359    .2819987
      CHESTERFIELD  |    .174374   .0351411     4.96   0.000     .1054951    .2432528
      LUCKY STRIKE  |     .15789   .0271532     5.81   0.000      .104668     .211112
          MARLBORO  |   .3027708    .019282    15.70   0.000     .2649768    .3405647
           MONTANA  |  -.0886416   .0515629    -1.72   0.086    -.1897082     .012425
         PALL MALL  |   .2246672   .0214232    10.49   0.000     .1826764     .266658
                    |
                 ym |   .0094751   .0000252   376.58   0.000     .0094258    .0095244
              _cons |  -6.365094   .0169217  -376.15   0.000    -6.398261   -6.331926
--------------------+----------------------------------------------------------------
            sigma_u |   .1973542
            sigma_e |  .12541906
                rho |   .7123201   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(262, 23647) = 74.99                 Prob > F = 0.0000

. // premium 
. testparm 1.marca#c.dm_m1_20 2.marca#c.dm_m1_20 5.marca#c.dm_m1_20

 ( 1)  1b.marca#c.dm_m1_20_cm = 0
 ( 2)  2.marca#c.dm_m1_20_cm = 0
 ( 3)  5.marca#c.dm_m1_20_cm = 0

       F(  3, 23647) =  125.90
            Prob > F =    0.0000

. testparm 1.marca#c.dm_m1_21 2.marca#c.dm_m1_21 5.marca#c.dm_m1_21

 ( 1)  1b.marca#c.dm_m1_21_cm = 0
 ( 2)  2.marca#c.dm_m1_21_cm = 0
 ( 3)  5.marca#c.dm_m1_21_cm = 0

       F(  3, 23647) =  151.62
            Prob > F =    0.0000

. // medium (same company produces this two)
. // 4: lucky, 7: pall mall
. testparm 4.marca#c.dm_m1_20 7.marca#c.dm_m1_20

 ( 1)  4.marca#c.dm_m1_20_cm = 0
 ( 2)  7.marca#c.dm_m1_20_cm = 0

       F(  2, 23647) =   40.30
            Prob > F =    0.0000

. testparm 4.marca#c.dm_m1_21 7.marca#c.dm_m1_21

 ( 1)  4.marca#c.dm_m1_21_cm = 0
 ( 2)  7.marca#c.dm_m1_21_cm = 0

       F(  2, 23647) =   70.81
            Prob > F =    0.0000

. 
. // discount (?)
. // 3: chesterfield, 6: montana
. testparm 3.marca#c.dm_m1_20 6.marca#c.dm_m1_20

 ( 1)  3.marca#c.dm_m1_20_cm = 0
 ( 2)  6.marca#c.dm_m1_20_cm = 0

       F(  2, 23647) =    7.22
            Prob > F =    0.0007

. testparm 3.marca#c.dm_m1_21 6.marca#c.dm_m1_21

 ( 1)  3.marca#c.dm_m1_21_cm = 0
 ( 2)  6.marca#c.dm_m1_21_cm = 0

       F(  2, 23647) =   13.84
            Prob > F =    0.0000

. 
. // this equality cannot be discarded
.                                         
. log close
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados/est_xtreg_means_ma
> rcas_ciudades.log
  log type:  text
 closed on:   8 Jul 2021, 00:41:15
---------------------------------------------------------------------------------------------------
