----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\i
> nicial.log
  log type:  text
 opened on:  10 Sep 2021, 11:06:31

. 
. /*
> Otros precios
> */
. import excel "datos/iniciales/precios_indices.xlsx", firstrow clear

. * Agregar informacion de periodo
. gen year= real(substr(Periodo,1,4))

. gen month= real(substr(Periodo,6,2))

. 
. gen ym = ym(year,month)

. format ym %tm

. 
. // variables para la regresion
. gen jan = month == 1

. gen jan20 = jan == 1 & year == 2020

. gen jan21 = jan == 1 & year == 2021

. 
. // etiquetas
. label variable jan "jan"

. label variable jan20 "jan20"

. label variable jan21 "jan21"

. 
. // impuesto desde anuncio 2020
. gen nov19_jan20 = ((month == 11 | month == 12) & year == 2019) | jan20

. // impuesto desde anuncio 2021
. gen nov20_jan21 = ((month == 11 | month == 12) & year == 2019) | jan20

. 
. save datos/prelim/de_inpc/precios_indices.dta, replace
file datos/prelim/de_inpc/precios_indices.dta saved

. 
. /* 
> precios de las marcas principales
> */
. import delimited datos/prelim/de_inpc/table11_principales7.csv, clear 
(13 vars, 32,574 obs)

. 
. save datos/prelim/de_inpc/table11_principales7.dta, replace
file datos/prelim/de_inpc/table11_principales7.dta saved

. 
. /* 
> promedios marca y ciudad
> > tpCiudad2.dta
> */
. do stata_code/inicial_marcas2.do

. // se basa en inicial_marcas.do
. // las diferencias est'an respecto a la definici'on de la 
. // variable marca2, 
. // la intenci'on era mantener los dos tipos de clasificaci'on
. // para comparar resultados, sin embargo, es aparente que algunas marcas coincid
> en 
. // por lo que ser'ia necesario hacer un criterio para separar las clasificacione
> s
. // 
. capture log close
----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chen\OneDrive\Documentos\R\tax_ene2020\tax_2020\resultados\i
> nicial.log
  log type:  text
 opened on:  10 Sep 2021, 11:06:56

. 
. /* 
> promedios marca, 
> */
. 
. use datos/prelim/de_inpc/tpCiudad2.dta, clear

. 
. collapse (mean) pzas pp ppu jan* (sd) sd_pzas = pzas sd_pp = pp sd_ppu=ppu ///
>                 (count) n_pzas = pzas n_pp=pp n_ppu=ppu , by(year month marca)

. 
. // establecer el panel
.  gen ym = ym(year,month)

.  format ym %tm

. 
. xtset marca ym
       panel variable:  marca (strongly balanced)
        time variable:  ym, 2011m1 to 2021m4
                delta:  1 month

. 
. merge m:1 year month using datos/prelim/de_inpc/precios_indices.dta, gen(m_df_p)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               868  (m_df_p==3)
    -----------------------------------------

. keep if m_ == 3
(0 observations deleted)

. drop m_

.  
. save datos/prelim/de_inpc/df_x.dta, replace
file datos/prelim/de_inpc/df_x.dta saved

. 
. /* 
> promedios ciudad 
> */
. 
. use datos/prelim/de_inpc/tpCiudad2.dta, clear

. collapse (mean) pzas pp ppu (sd) sd_pzas = pzas sd_pp = pp sd_ppu=ppu  ///
>                 (count) n_pzas = pzas n_pp=pp n_ppu=ppu , by(year month cve_ciud
> ad)

. 
. merge m:1 year month using datos/prelim/de_inpc/precios_indices.dta, gen(m_df_p)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             5,995  (m_df_p==3)
    -----------------------------------------

. keep if m_ == 3
(0 observations deleted)

. drop m_

. 
. save datos/prelim/de_inpc/df_m.dta, replace
file datos/prelim/de_inpc/df_m.dta saved

. 
.                 
. capture log close
